{
 "publication": {
  "abstract": "In this paper we present a generalization of Frangi's vesselness measure \\cite{Frangi1998} for \r\nthe enhacement of M-dimensional shapes in N-dimensional images, together \r\nwith the implementation of the corresponding Insight Toolkit (ITK) filter \\cite{ITKSoftwareGuide}. Inspired \r\nby the implementation of a multiscale vesselness measure recently presented on \r\nthe Insight Journal \\cite{Enquobahrie2007}, we also propose a unified framework for the evaluation of \r\ngeneric multiscale Hessian-based measures. The manuscript is accompanied by \r\nsource code and examples.",
  "authors": [
   {
    "author_fullname": "Antiga, Luca",
    "author_place": 1,
    "persona_email": "luca.antiga@gmail.com",
    "persona_firstname": "Luca",
    "persona_id": 25,
    "persona_lastname": "Antiga"
   }
  ],
  "categories": [
   "Data Representation",
   "Derivatives and Integrals",
   "Feature extraction",
   "Filtering",
   "Generic Programming",
   "Higher order derivatives",
   "Image",
   "Mathematics",
   "Programming",
   "Segmentation",
   "Statistics on tensors"
  ],
  "comments": [],
  "date_submitted": "2007-08-03T12:38:37Z",
  "handles": [
   {
    "handle": "1926/576",
    "handle_url": "http://hdl.handle.net/1926/576"
   }
  ],
  "identifiers": {
   "doi": null,
   "pubmed": null
  },
  "journals": [
   {
    "journal_id": 3,
    "journal_name": "The Insight Journal"
   }
  ],
  "publication_id": 175,
  "reviews": [
   {
    "author": {
     "author_email": "heibel@cs.tum.edu",
     "author_firstname": "Hauke",
     "author_id": 692,
     "author_lastname": "Heibel"
    },
    "content": "<p><strong>Summary:</strong><br />The paper describes a generalization of the vesselness measure introduced by Frangi which holds for multi-dimensional objects. The author introduces a closed form solution for the computation of N-dimensional objectness.</p><p>The idea to apply the vesselness measure to other structures (noise, plate-like, tubular, blob-like) has already been proposed by Frangi et al. (Multiscale vessel enhancement filtering, Table 1) but the generalized mathematical formulation is to my best knowledge new.</p><p>The author offers a well designed and implemented class to compute a general objectiveness measure as well as a class to compute the objectiveness on multiple scales. </p><p> <strong>Hypothesis:</strong><br />&quot;Non Applicable&quot;.<br /> <br /> <strong>Evidence:</strong><br />The author provides examples for two and three dimensional image data as well as objects of the first two dimensions (blobs, vessels). Furthermore evidence can be found in the mathematical derivation of the general objectiveness measure. </p><p> <strong>Open Science:</strong><br />The paper and its addendums fully adhere to the concept of Open Science. The authors provide the test data, all parameters and sample programs being fully functional.<br /> </p><p><strong>Reproducibility:</strong><br />I did not reproduce the data though I used the author&#39;s classes and applied them to my own datasets which was working as expected.</p><p> <strong>Use of Open Source Software:</strong><br />The authors used ITK and thus used Open Source Software. Their implementation is not depending on any additional third party libraries and can be used out of the box within the ITK framework.</p><p><strong>Open Source Contributions:</strong><br />The code is completely available. It was possible to setup a working and running project in about 10 minutes. </p><p><strong>Code Quality:</strong><br />The source code quality is high. No obviously non-portable mechanisms have been used the code is well documented. </p><p> <strong>Applicability to other problems:</strong><br />n/a </p><p> <strong>Suggestions for future work:</strong><br />Probably some users might be interested in equidistant sigma steps. I would love to see this as an option in a future implementation. I am not yet sure whether something like this should be implemented in terms of an additional template parameter of in terms of an enum and setter and getter methods to switch between different methods. </p><p> <strong>Requests for additional information from authors:</strong><br />n/a</p><p> <strong>Additional Comments:</strong><br />It took me a moment to get the difference between examples A and C, since I was assuming that objectness M=1 is actually vesselness...</p><p>I am not yet fully familiar with the ITK coding guidelines but I think using constructor initialization lists might be preferred to initialization of member variables within the constructors body.</p><p>The m_UpdateBuffer should be reset at each call to generate data, e.g. to itk::NumericTraits::NonpositiveMin().</p><p>The second output, i.e. the scales output should be reset at each call to generate data, e.g. to 0.</p><p>Besides those small remarks a nice work! </p>",
    "date": "10-08-2007",
    "review_id": 590
   }
  ],
  "submitted_by_author": {
   "author_email": "luca.antiga@gmail.com",
   "author_firstname": "Luca",
   "author_fullname": "Antiga, Luca",
   "author_id": 25,
   "author_institution": "Mario Negri Institute",
   "author_lastname": "Antiga"
  },
  "tags": [
   "Multiscale",
   "Image enhancement",
   "Vesselness",
   "Hessian"
  ],
  "title": "Generalizing vesselness with respect to dimensionality and shape"
 }
}