{
  "publication": {
    "abstract": "BioImage Suite is an NIH-supported medical image analysis software suite developed at Yale. It\r\nleverages both the Visualization Toolkit (VTK) and the Insight Toolkit (ITK) and it includes many additional\r\nalgorithms for image analysis especially in the areas of segmentation, registration, diffusion\r\nweighted image processing and fMRI analysis. BioImage Suite has a user-friendly user interface developed\r\nin the Tcl scripting language. A final beta version is freely available for download.",
    "articles": [
      "bafybeiav2h2h5tszdb4flfwbac3pvffp67gz3ome564tbfyvlorqwdpzhe"
    ],
    "authors": [
      {
        "author_fullname": "Papademetris, Xenophon",
        "author_place": 1,
        "persona_email": "xenophon.papademetris@yale.edu",
        "persona_firstname": "Xenophon",
        "persona_id": 79,
        "persona_lastname": "Papademetris"
      },
      {
        "author_fullname": "Jackowski, Marcel",
        "author_place": 2,
        "persona_id": null
      },
      {
        "author_fullname": "Rajeevan, Nallkkandi",
        "author_place": 3,
        "persona_id": null
      },
      {
        "author_fullname": "DiStasio, Marcello",
        "author_place": 4,
        "persona_id": null
      },
      {
        "author_fullname": "Okuda, Hirohito",
        "author_place": 5,
        "persona_email": "hirohito.okuda@ge.com",
        "persona_firstname": "Hirohito",
        "persona_id": 1094,
        "persona_lastname": "Okuda"
      },
      {
        "author_fullname": "Constable, R. Todd",
        "author_place": 6,
        "persona_id": null
      },
      {
        "author_fullname": "Staib, Lawrence",
        "author_place": 7,
        "persona_email": "lawrence.staib@yale.edu",
        "persona_firstname": "Lawrence",
        "persona_id": 27,
        "persona_lastname": "Staib"
      }
    ],
    "categories": [],
    "comments": [],
    "date_submitted": "2006-06-30T21:46:33Z",
    "handles": [
      {
        "handle": "1926/209",
        "handle_url": "http://hdl.handle.net/1926/209"
      }
    ],
    "identifiers": {
      "doi": null,
      "pubmed": null
    },
    "journals": [
      {
        "journal_id": 3,
        "journal_name": "The Insight Journal"
      }
    ],
    "license": "You are licensing your work to Kitware Inc. under the\nCreative Commons Attribution License Version 3.0.\n\nKitware Inc. agrees to the following:\n\nKitware is free\n * to copy, distribute, display, and perform the work\n * to make derivative works\n * to make commercial use of the work\n\nUnder the following conditions:\n\\\"by Attribution\\\" - Kitware must attribute the work in the manner specified by the author or licensor.\n\n * For any reuse or distribution, they must make clear to others the license terms of this work.\n * Any of these conditions can be waived if they get permission from the copyright holder.\n\nYour fair use and other rights are in no way affected by the above.\n\nThis is a human-readable summary of the Legal Code (the full license) available at\nhttp://creativecommons.org/licenses/by/3.0/legalcode",
    "publication_id": 95,
    "reviews": [
      {
        "author": {
          "author_email": "holmes.david3@mayo.edu",
          "author_firstname": "David",
          "author_id": 20,
          "author_lastname": "Holmes"
        },
        "content": "<b>Summary:</b>\r\nThe authors provide an \\\"update\\\" to their current efforts in developing the BioImage Suite. The BioImage Suite fully utilizes several readily available software packages to provide a \\\"user-friendly user interface\\\" for medical image analysis. The paper describes the various algorithms in the package as well as some of the biomedical applications have been developed with the suite. The discussion includes a description of licensing and availability.\r\n\r\n<b>Hypothesis:</b>\r\nN/A\r\n\r\n<b>Evidence:</b>\r\nAs the paper title suggests, this is suppose to be an \\\"update\\\" to the previous paper. The evidence should be in the \\\"updating\\\" of the textual description of the package. While I think that the suite is both interesting and potentially useful, I found the paper to be lacking a bit. I found much the the text to be the same (almost word for word) with the previous submissions which the authors are updating.\r\n\r\n<b>Open Science:</b>\r\nThe package will be open-source (and available under the GPL) soon. The package can be downloaded now following registration. The authors note that there is one library which is closed. The issue becomes whether this hinder the open-science movement to build upon their success. As the authors point out, the single library is a small component and their hands are tied due to other licensing. However, even with the restrictions (by third-parties), the authors still have the right to publish the methods included within the code. (See next section)\r\n\r\n<b>Reproducibility:</b>\r\nSince the package will be largely open source, reproducibility should be straightforward (although that is only a best guess as I have not reviewed the source). With regards to the single closed library, the authors will not be able to provide source code, but they should be publishing (in great detail) the methods within the library as that is not restricted. As such, anyone who has a valid licence of numerical recipes (which many do) can recreate the functionality. In the same manner, anyone with the appropriate Vector Vision Link licence should be able to write the appropriate connection code.\r\n\r\n<b>Use of Open Source Software:</b>\r\nThe authors take full advantage of open source software from the programming languages used (tcl/tk) to the graphics drivers (mesa), when needed. The exciting aspect of this work is the combination of all of these tools into a useful package. As already noted, there are some minor restrictions with the Vector Vision Link software and the Numerical Recipes software.\r\n\r\n<b>Open Source Contributions:</b>\r\nI do not have the source code. It was not included with submission. The website has a mechanism to get the software.\r\n\r\n<b>Code Quality:</b>\r\nDitto\r\n\r\n<b>Applicability to other problems:</b>\r\nThis suite has great application to many different clinical problems. I look forward to exploring its potential.\r\n\r\n<b>Suggestions for future work:</b>\r\nIf not available, I suggest that the authors post or publish the methods within the closed library so others can properly reproduce the work.\r\n\r\n<b>Requests for additional information from authors:</b>\r\n\r\n<b>Additional Comments:</b>\r\n\r\n",
        "date": "09-05-2006",
        "review_id": 367
      },
      {
        "author": {
          "author_email": "gavinb@cs.mu.oz.au",
          "author_firstname": "Gavin",
          "author_id": 8,
          "author_lastname": "Baker"
        },
        "content": " <b>Summary:</b>\r\n\r\n<!-- Short description of the paper. In two or three phrases describe the\r\nproblem that was addressed by the authors and the approach they took to\r\nsolve it. -->\r\n\r\nThis paper describes <b>BioImage Suite</b>, an software package for medical\r\nimage analysis. It is has been used in a wide variety of applications,\r\nincluding fMRI, DTI, and segmentation. The aim is to provide easy-to-use\r\ntools, with a strong clinical application focus.\r\n\r\nThe BioImage Suite is in a similar solution space to Slicer, Brainsuite and\r\nAnalyse. It comprises a GUI and a series of command-line tools for batch\r\nprocessing, and has been developed internally at Yale over the past 10\r\nyears, being used on a variety of projects.\r\n\r\nThis paper is an updated version of a\r\n<a href=\\\\\\\"http://hdl.handle.net/1926/37\\\\\\\">previous submission which described the\r\nBioImage Suite</a>, and the authors have fulfilled their promise to publish\r\nthe source of the package. The content of the paper itself appears to be\r\nvirtually the same as to last years\\\\\\' submission, with some changes to reflect the\r\nbeta release of the source code.\r\n\r\n<b>Hypothesis:</b>\r\n\r\n<!-- If Applicable: Describe the assumptions that the authors have made and\r\nthey hypothesis of their work, note that not all papers will fit the model\r\nof hypothesis driven work, for example, the description of an image\r\ndatabase, or the description of a toolkit will not be driven by an\r\nhypothesis, in which case, please simply write : Non Applicable in this\r\nfield or delete the subtitle. -->\r\n\r\nThat the BioImage Suite can support clinical image analysis applications,\r\nand that it is user-friendly and well-documented.\r\n\r\n<b>Evidence:</b>\r\n\r\n<!-- Describe the evidence that the authors provide in order to support\r\ntheir claims in the paper. This is a key component on Open Science, opinions\r\nthat are not supported by evidence should be labeled as speculations or\r\nauthors opinion while. The same rule applies to the text of the reviews:\r\nclaims should be supported by evidence -->\r\n\r\nThe project website includes quite a comprehensive set of\r\n<a href=\\\\\\\"http://www.bioimagesuite.org/public/Intro.html\\\\\\\">online\r\ndocumentation</a>, which describes how to use the various components of the\r\nsystem in some detail, including screenshots and tutorial-style information.\r\nThe system appears to be reasonably user-friendly, based on studying the\r\navailable screenshots.\r\n\r\nWhile the system has obviously seen considerable use and wide application\r\nover the years, the paper did not discuss clinical applications or present a\r\ncase-study.\r\n\r\n<b>Open Science:</b>\r\n\r\n<!-- Describe how much the paper and its addendums adhere to the concept of\r\nOpen Science. Do the authors provide the source code of the programs used in\r\ntheir experiments? Do the authors provide the input images that they used?\r\nOr are those images publicly available? Do the authors provide the output\r\nimages that they show in the paper? Do the authors provide enough details\r\nfor you to be able to replicate their work? -->\r\n\r\nThe authors provide access to the full source code (and nearly all the\r\ndependent libraries). The paper shows examples and screenshots of the\r\napplication running. The binary distribution also includes some example\r\nimage data.\r\n\r\n<b>Reproducibility:</b>\r\n\r\n<!-- Did you reproduce the authors work? Did you download their code? Did\r\nyou compile it? Did you run it? Did you managed to get the same results\r\nthat they reported? Were there information missing from the paper, that was\r\nnecessary for you to reproduce the work? Suggest improvements that will make\r\neasier for future readers to reproduce this work. -->\r\n\r\nI followed the instrucions on the project website to obtain the software.\r\nThis involved a quick registration process, and was then able to download\r\nthe software. I obtained the latest source\r\n(<tt>bioimagesuite_1.995_src_507.zip</tt> dated 24th August 2006) as well as\r\nthe pre-built binaries for Linux.\r\n\r\nI was unable to completely build the software from source on my machine\r\n(Debian GNU/Linux Etch, i586). While I do have LAPACK, BLAS, ATLAS and all\r\nsuch packages installed (including clapack.h), I do not have\r\nCLAPACKConfig.cmake and could find no reference via Google. I managed to\r\nhack past this problem, only to encounter other difficulties which prevented\r\nfurther progress.\r\n\r\nI untarred them into a private directory, adjusted the path settings\r\naccording to the documentation. (The install documentation says that\r\nuntarring will result in three directories, but it omits mention of the\r\n<tt>bioimage_extra</tt> directory.) The system assumes that the software is\r\ninstalled under <tt>/usr/local</tt>, which was not an option in this\r\ninstance. While the scripts to run BioImage have a BASE directory, it is\r\nnot used by the scripts, and changing the paths is most cumbersome.\r\n\r\nSome issues: the <tt>bioimagesuite/setpaths.sh</tt> script refers to FSL,\r\nwhich is not included. The <tt>setextra.sh</tt> script refers to minc20,\r\nwhich is under the extra directory but the script assumes it is under the\r\nbase directory. The configuration tries to set TCL_LIB_PATH, but the\r\ncorrect environment variable (according to the documentation I consulted)\r\nspecifies TCLLIBPATH, ie. without the underscores). Also, since this\r\npackage is distributing its own copy of Tcl, the TCL_LIBRARY environment\r\nvariable needs to be set to the base path of <tt>init.tcl</tt>.\r\n\r\nWith my custom script (see below) I was able to successfully run the suite.\r\nI loaded some test data (<tt>mni_305.hdr</tt>), and carried out some common\r\ntasks: preprocessing, bias-field correction, smoothing, histogram\r\nsegmentation, morphology and others. I was able to perform these common\r\noperations without needing to refer to the documentation, supporting the\r\nease of use claim.\r\n\r\n<b>Use of Open Source Software:</b>\r\n\r\n<!-- Did the authors use Open Source software in their work? Do they\r\ndescribe their experience with it, advantages and disadvantages? Do they\r\nprovide advice for future users of those Open Source packages? -->\r\n\r\nThe BioImage Suite makes extensive use of existing FLOSS projects, including\r\nITK, VTK, LAPACK, Mesa 3D, Tcl/Tk, IWidget, and Metakit. It leverages these\r\nlibraries to provide a high-level interface. (It also appears to include\r\nthe HDF5 package, which doesn\\\\\\'t seem to be mentioned in the documentation.)\r\nThe paper does not discuss in any detail how these libraries were used.\r\n\r\n<b>Open Source Contributions:</b>\r\n\r\n<!-- Do the authors provide their source code? Is it in a form that is\r\nusable? Do they describe clearly how to use of the code? How long did it\r\ntake you to use that code? -->\r\n\r\nThe complete source code is made available on the BioImage website, which is\r\navailable after a brief registration step. The source comprises some\r\n300,000 lines of source files, representing a very significant contribution\r\nto the community.\r\n\r\nThis website also features user forums, encompassing support, discussion on\r\nfMRI, DTI, integrating with other software, news and discussion.\r\nseveral relevant papers and resources are provided, including tutorials\r\nand user manual.\r\n\r\nAs the project is making the transition from an internal project to its\r\nfirst public release, various environmental issues have become apparent, as\r\nnoted above. This is due to the inevitable dependencies and assumptions\r\nthat one is able to make in a controlled or homogeneous environment, such as\r\nthe presence of dependent libraries or tools, and the locations and paths of\r\ncomponents, and so on. As the project progresses in its new public phase,\r\nthese issues will surely be ironed out and the project should become more\r\neasily deployable on external systems.\r\n\r\n<b>Code Quality:</b>\r\n\r\n<!-- If the authors provided their source code: Was the code easy to read?\r\nDid they use a modern coding style? Did they rely on non-portable mechanism?\r\nWas it suitable for multiple-platforms? -->\r\n\r\nThe code is broken up into sensible modules (such as GUI, Imaging, and so\r\non). The layout of the source code is generally readable and consistent,\r\nbut often uses extremely long lines (>80 characters). Most classes have\r\nsmall, cohesive methods. The class interfaces seem to be generally\r\nwell-defined. There is still a certain amount of debug code, such as\r\n<tt>cout</tt> and <tt>printf</tt> calls sprinkled about (while others use\r\nthe VTK debug macros). There are quite a few instances of literal constants\r\nand magic numbers, such as IDs for menu items which must be the same between\r\nmodules, or processing modes, colour constants, lookup tables, etc. The\r\ncoding conventions are fairly similar to the ITK conventions (making the\r\ntransition of contributions easier to manage). (A few dozen source files\r\nwere chosen semi-randomly across the various directories in the\r\nsource code for inspection.)\r\n\r\nThere is very little documentation within the code. Using a tool such as\r\nDoxygen and providing inline documentation of classes and methods would\r\nimprove the maintainability of the code, and enable external developers to\r\nget up to speed and contribute and enhance the code base.\r\n\r\nThe code is generally designed for portability, as evidenced by the fact\r\nthat it runs on Windows, Linux, Solaris and Mac OS X. This is obviously in\r\nno small part thanks to the portability of the underlying libraries, however\r\nthe authors have gone to great lengths to not only support the major\r\nplatforms in their own code, but to provide pre-built binaries for each\r\nalso.\r\n\r\n<b>Applicability to other problems:</b>\r\n\r\n<!-- Do you find that the authors methods can be applied to other image\r\nanalysis problems? Suggest other disciplines or even other specific projects\r\nthat could take advantage of this work -->\r\n\r\nThe suite includes implementations of several useful algorithms, which would\r\nbe very useful in their own right. Some of these may be appropriate to make\r\nas contributions to the ITK or VTK core. While the suite contains tools for\r\nspecific applications such as angiography, it provides general segmentation\r\nand registration tools, which may be equally used in other areas such as\r\nthoracic imaging or brain sementation.\r\n\r\n<b>Suggestions for future work:</b>\r\n\r\n<!-- Suggest to authors future directions for improving their methods, or\r\nother domains from which they could learn technique that could help them\r\nadvance in their research. -->\r\n\r\n<i>Building</i>\r\n\r\nMaking the codebase easier to build on different systems is the biggest\r\nhurdle to adoption by external developers, and to a lesser extent users.\r\nThe paths configuration could be streamlined, to make it easier to install\r\nin a custom root (for example, <tt>/opt/bioimage</tt>).\r\n\r\n<i>Distribution</i>\r\n\r\nThe binary distributions are broken up into four differnent tarballs for\r\ndownload. Since they are all required, and are built to be run together, it\r\nwould be helpful to have a single tarball to download all the required\r\nbinaries.\r\n\r\n<i>Documentation</i>\r\n\r\nThe system currently has minimal developer documentation. Information such\r\nas the build and runtime dependencies, minimum versions of packages required\r\n(eg. CLAPACK/LAPACK), CMake, and so on would be very useful. Since the\r\nsystem provides much code that could be re-used elsewhere, providing an API\r\nreference (much like ITK does with the doxygen-generated docs) would be\r\nextremely valuable.\r\n\r\n<i>Startup Scripts</i>\r\n\r\nThe scripts included assume the system is installed in <tt>/usr/local</tt>,\r\nand are difficult and tedious to update.\r\n\r\nDue to the difficulty of changing all the paths in all the startup scripts,\r\nI wrote a single script that sets all the paths at once, which are all\r\nrelative to a single base directory. This avoids the problems of requiring\r\nBioImage Suite be installed in <tt>/usr/local</tt>, and makes it easier to\r\nconfigure and customize, since it is all relative to one single base\r\ndirectory variable. The script is below:\r\n\r\n<pre>\r\n#!/bin/sh\r\n\r\nBASE=`pwd`\r\nITK_DIR=$BASE/itk241_yale\r\nVTK_DIR=$BASE/vtk44_yale\r\nEXTRA_DIR=$BASE/bioimagesuite_extra\r\nBIS_DIR=$BASE/bioimagesuite\r\n\r\nMAIN_DIR=${BIS_DIR}/main\r\nBIN_DIR=${BIS_DIR}/bin\r\nAPPS_DIR=${BIS_DIR}/apps\r\nMJACK_DIR=${BIS_DIR}/mjack\r\nVTKNR_DIR=${BIS_DIR}/vtknr\r\nDATATREE_DIR=${BIS_DIR}/datatree\r\n\r\nPATH=$BIS_DIR/bin:$EXTRA_DIR/bin:$VTK_DIR/bin:$BIN_DIR:$MAIN_DIR:$APPS_DIR:$MJACK_DIR:$VTKNR_DIR:$DATATREE_DIR:$PATH\r\nLD_LIBRARY_PATH=$ITK_DIR/lib/InsightToolkit:$VTK_DIR/lib:$VTK_DIR/lib/vtk:$EXTRA_DIR/lib:$LD_LIBRARY_PATH\r\n\r\nexport PATH\r\nexport LD_LIBRARY_PATH\r\n\r\nTCL_LIBRARY=$VTK_DIR/lib/tcl8.4\r\nTK_LIBRARY=$VTK_DIR/lib/tk8.4\r\nTCLLIBPATH=$VTK_DIR/lib/tcllib1.8\r\n\r\nexport TCL_LIBRARY\r\nexport TK_LIBRARY\r\nexport TCLLIBPATH\r\n\r\npxmenu.tcl\r\n</pre>\r\n\r\n<b>Requests for additional information from authors:</b>\r\n\r\n<!-- Did you find that information was missing from the paper? Maybe\r\nparameters for running the tests? Maybe some images were missing? Would you\r\nlike to get more details on how the diagrams, or plots were generated? -->\r\n\r\nIt would be very interesting to have not just an overview of the system, but\r\na discussion of the design of the package. How do the components fit\r\ntogether? How did they design the architecture, with its blend of C++ and\r\nTcl code? How can some of the core algorithms be reused in other projects?\r\n\r\nCross-platform development is very important, and the developers seem to\r\nhave an interesting approach involving VMWare Server. A discussion of their\r\napproach, for building, testing, deployment, etc would also be of interest\r\nto many developers.\r\n\r\nGiven the fact that the BioImage Suite has apparently been in widespread use\r\nwithin Yale for many years, it would have been most useful to present some\r\ncase studies to show how it is being used, what benefits it confers to the\r\nusers, and how it is employed in clinical diagnosis and interventions. The\r\ncore of the paper is a general overview of the features of the system, and\r\ndoesn\\\\\\'t provide much detail on how the code was implemented.\r\n\r\nOf particular interest to many members of the community would be a\r\ndiscussion of how the system interfaces to the Brainlab IGS system (a\r\nsuggestion from a reviewer in last year\\\\\\'s submission). Of course, the\r\npublication of this module\\\\\\'s source would be very useful.\r\n\r\n<b>Additional Comments:</b>\r\n\r\n<!-- This is a free-form field -->\r\n\r\nThe suite is built upon a large number of other libraries, most of which\r\nappear to be published under a BSD-style license. The authors are\r\npublishing this suite under the GPL, which has implications on the other\r\nlibraries whose source is distributed alongside. It is not a foregone\r\nconclusion that all these licenses are GPL-compatible, and some legal advice\r\nmay be appropriate to ensure no terms are being bent. It is somewhat of a\r\nconcern that the authors state in the paper that a core library will remain\r\nproprietary, as this is obviously not compatible with the GPL (depending on\r\nthe linkage between the module and the rest of the system).\r\n\r\nThe Numerical Recipes code is obviously proprietary and will remain so,\r\nfree/open alternatives to a significant number of these algorithms are available\r\nelsewhere (eg. GSL, etc) which may overcome this particular limitation,\r\nso it should be possible to replace this with code and free the affected module.\r\n\r\nSince the authors use VMWare extensively for their multi-platform\r\ndevelopment, perhaps they would consider providing a\r\n<a href=\\\\\\\"http://www.vmware.com/vmtn/appliances/\\\\\\\">\r\nVirtual Server Appliance</a> with BioImage Suite ready to run. This would\r\nenable people to try the software after a single download, and would avoid\r\npotential compatability issues with DLLs, configuring paths, and so on.\r\n\r\n<b>Conclusion</b>\r\n\r\nIn summary, the project includes full source code, documentation and sample\r\ndata. The suite clearly addresses the need to have productive tools and\r\ninterfaces for working with medical image data. The paper provides a good\r\noverview of the suite, but leaves the reader wanting to know more detail\r\nabout how it was designed and how it is being used in practice. This suite\r\nis of general and broad interest, for researchers to analyse and explore\r\nimage data. This package should prove very popular and useful for a wide\r\nvariety of users, and anyone interested should download it to evaluate it\r\nfor their application.\r\n",
        "date": "08-31-2006",
        "review_id": 349
      },
      {
        "author": {
          "author_email": "pkaz@cs.jhu.edu",
          "author_firstname": "Peter",
          "author_id": 63,
          "author_lastname": "Kazanzides"
        },
        "content": "<b>Summary:</b>\r\nThis paper describes the BioImage Suite, which is a collection of image analysis tools, including GUI-based and command-line programs, developed at Yale University.\r\n \r\n<b>Hypothesis:</b>\r\nN/A\r\n\r\n<b>Evidence:</b>\r\nN/A\r\n\r\n<b>Open Science:</b>\r\nThe authors are releasing the bulk of the source code under the GPL license. One library cannot be released as open source due to licensing issues. A pre-release version (binary and source) is available from the web site, though it currently requires a user name and password (easy to obtain after registering).\r\n\r\n<b>Reproducibility:</b>\r\nI downloaded the Windows binary and installed it on Windows XP. I used the suggested root directory (C:\\\\Yale). The installation consisted of unzipping 4 ZIP files (not 3 as mentioned in the documentation). The program is starting by running a batch file. This was very easy to do and worked. I also downloaded the source code, but did not try to compile it myself.\r\n\r\n<b>Use of Open Source Software:</b>\r\nThe paper mentions that BioImage Suite uses VTK, ITK, and TCL/TK (with extensions such as IWidgets). In addition, by reviewing the downloaded files, it is clear that it also uses other open source packages such as Xerces, MINC, and CLAPACK.\r\n\r\nThe project uses the CMake and Subversion open source tools.\r\n\r\n<b>Open Source Contributions:</b>\r\nThis is a significant amount of software that is being made available to the research community. The authors are working to replace some of the closed source libraries. The authors provide binary versions for many different operating systems.\r\n\r\n<b>Code Quality:</b>\r\nI downloaded, but did not review, the source code. The design of the web site is very good and appears to have ample documentation.\r\n\r\n<b>Applicability to other problems:</b>\r\nThere are a lot of image analysis tools, which should be applicable to a wide range of medical applications.\r\n\r\n<b>Suggestions for future work:</b>\r\nThe authors state that they make extensive use of VMWare for testing the software on different operating systems, but do not describe the testing framework. For a software package of this size, I would strongly urge the developers to create an automated testing framework (e.g., using Dart), if they have not already done so.\r\n\r\n<b>Requests for additional information from authors:</b>\r\nThe authors mention similar open source packages, such as Slicer, Brainsuite, and SPM, but do not offer a comparison to BioImage Suite. Given that they recently received an NIH grant for â\u0080\u009ccontinued development and maintenanceâ\u0080\u009d, I assume that they must have already described (at least in the proposal) the new features that their package could offer.\r\n\r\n<b>Additional Comments:</b>\r\nI find the GUI to be less â\u0080\u009csexyâ\u0080\u009d than the 3D Slicer package (though I am more familiar with 3D Slicer). The availability of command line tools is a nice feature in BioImage Suite and the generation of Makefiles to manage the batch processing is a good idea.\r\n\r\nThe VVLink capability is interesting (I also read the ISBI06 paper available on the website). \r\n\r\n\r\n",
        "date": "09-06-2006",
        "review_id": 378
      },
      {
        "author": {
          "author_email": "samset@bwh.harvard.edu",
          "author_firstname": "Eigil",
          "author_id": 447,
          "author_lastname": "Samset"
        },
        "content": "<b>Summary:</b>\r\nA medical image processing suite is described. The system packages existing algorithm in an easy-to-use application. The software is in wide use at Yale and local collaborating laboratories.\r\n \r\n<b>Hypothesis:</b>\r\nNon applicable\r\n\r\n<b>Evidence:</b>\r\nThe authors give a clear description of the software, and examplifies the capability of the software in clinical applications with several screenshots.\r\n\r\n<b>Open Science:</b>\r\nThe BioImage Suite is publically available for download. Usename and password is given on request. The source-code was not readily available (it would requre a separate request). The authors give a good description of core algorithms that are being used in the software and give referenes to these.\r\n\r\n<b>Reproducibility:</b>\r\nDownloading and running the precompiled version of the software went smoothly. When not installing to the default location, the file start_bioimagesuite had to be modified (in addition to files mentioned in the webpage)\r\nNo attempt was made to get source code or compile it.\r\n\r\n<b>Use of Open Source Software:</b>\r\nThe authors use existing opensource software such as VTK, ITK and CLapack. \r\n\r\n<b>Open Source Contributions:</b>\r\nThe code was not easily available, and was not reviewed. The authors claim that the source code will be made available under GPL (except for a part of the software). The authors do not discuss the choice of licence.\r\n\r\n<b>Code Quality:</b>\r\nNon applicable\r\n\r\n<b>Applicability to other problems:</b>\r\nThe software system that is presented can have a wide use in image processing problems. It seems that it can provide a good platform to package image processing algorithms to end users. The authors empasize that the system is easy to learn and use, which is often not the case for academic software. There is no discussion of how BioImage Suite compares to other systems like Slicer, Brainsuite, SPM or Analyze.\r\n\r\n<b>Suggestions for future work:</b>\r\nFor this reviewer the software related to VectorVision link would have the highest interest. This cannot currently be opensources. The suggested work to enable this would therefor be very usefull for the Image-Guided-Therapy community.\r\n\r\n<b>Requests for additional information from authors:</b>\r\nIt would be interesting to know more about the data model used in the system.\r\n\r\n]\r\n\r\n",
        "date": "08-23-2006",
        "review_id": 311
      }
    ],
    "submitted_by_author": {
      "author_email": "xenophon.papademetris@yale.edu",
      "author_firstname": "Xenophon",
      "author_fullname": "Papademetris, Xenophon",
      "author_id": 79,
      "author_institution": "Yale University",
      "author_lastname": "Papademetris"
    },
    "tags": [
      "Segmentation",
      "Medical Image Analysis Software",
      "Registration",
      "Surface Editing",
      "DTI"
    ],
    "title": "BioImage Suite: An integrated medical image analysis suite: An update"
  }
}