{
 "publication": {
  "abstract": "Primary stability of osseointegrated implants is necessary for short and long-term success of the treatment. This paper presents a method to help clinicians preoperatively assess this primary implant stability. The method combines a planning software with a in-house finite element solver. Once the clinician has chosen a position for the implant on the planning tool, a finite element analysis is automatically started and calculates the mechanical stability of the implant at this position. The process is designed to be as simple and fast as possible for an efficient clinical use. Mechanical testing material was used to validate the stability measured by the software. The novel tool presented here leads the way to a new generation of intelligent computer-assisted tools able to give a priori indication on the life span of the implant.",
  "authors": [
   {
    "author_fullname": "Bardyn, Thibaut",
    "author_place": 1,
    "persona_email": "thibaut.bardyn@memcenter.unibe.ch",
    "persona_firstname": "Thibaut",
    "persona_id": 829,
    "persona_lastname": "Bardyn"
   }
  ],
  "categories": [],
  "comments": [],
  "date_submitted": "2008-05-21T20:17:18Z",
  "handles": [
   {
    "handle": "10380/1367",
    "handle_url": "http://hdl.handle.net/10380/1367"
   }
  ],
  "identifiers": {
   "doi": null,
   "pubmed": null
  },
  "journals": [
   {
    "journal_id": 33,
    "journal_name": "MICCAI 2008 Workshops"
   }
  ],
  "publication_id": 555,
  "reviews": [
   {
    "author": {
     "author_email": "adwit@mech.uwa.edu.au",
     "author_firstname": "Adam",
     "author_id": 864,
     "author_lastname": "Wittek"
    },
    "content": "<p><em>(This review can be also viewed by opening the attached PDF file)</em><br /> </p><p>The idea of pre-operative prediction of mechanical properties of dental implant using<br />finite element method presented in the paper is very exciting. However, the<br />implementation of this idea appears to be flawed, which includes the following:</p><p><br />1) Justification for building &ldquo;a patient-specific&rdquo; model using a generic mesh and<br />patient-specific bone material properties is not given.</p><p><br />2) Selection of boundary conditions for the implant (the implant is rigidly fixed<br />to the bone) lacks justification.</p><p><br />3) Verification of in-house finite element code developed in the study is<br />incomplete.</p><p><br />4) The finite element modelling results grossly differ from the experimental data<br />obtained using artificial bone.</p><p><br />Therefore, I cannot recommend this manuscript for publication in its current form. A<br />major revision of the entire study should be undertaken.</p><p><br /><strong>Major comments</strong><br />1) It is commonly accepted practice that newly developed numerical algorithms<br />(such as e.g. in-house finite element codes) are at first verified against the<br />existing well-established numerical procedures (such as e.g. those<br />implemented in commercial finite element codes) or against simple examples<br />for which solutions are known (e.g. Viceconti et al. 2005, Zienkiewicz 2000).<br />The Authors should include such verification of their code in the paper.</p><p><br />2) Finite element method is a numerical method for solving partial differential<br />equations. Therefore, determining correlation coefficients between the<br />experimental and finite element modelling results when validating finite<br />element models as done in Results section is misleading. Close to linear<br />relationship between the modelling and experimental results is not sufficient<br />to claim that the modelling results are &ldquo;promising &hellip; in terms of accuracy &hellip;&rdquo;<br />as stated by the Authors in Discussion. The results shown in Figure 5 indicate<br />that the experimentally determined removal torque is around five times greater<br />than the one predicted using the finite element model. This is a clear<br />indication of gross disagreement between the modelling and experimental<br />results and evidence of serious flaw in either modelling or experimental (or<br />both) part of the study. Differences of 500% between the modelling and<br />experimental are unacceptable by any engineering standard given the fact the<br />constitutive properties of the modelled continuum are well-known. These<br />differences call for major revision of the entire study.</p><p><br />3) Figure 6 clearly indicates that the relationship between the modelling and<br />experimental results is non-linear. Justification for drawing a straight line<br />trough the points clearly following non-linear pattern should be given. As was<br />with Figure 5, 200% difference between the experimental and modelling<br />results should be explained, and relevant revision of the study should be<br />undertaken to eliminate any difference of such large magnitude.</p><p><br />4) P. 3: &ldquo;The removal torque is approximated by multiplying the friction<br />coefficient by the total of the radial reaction forces due to pressfit at the<br />bone/implant interface&rdquo;. Given the fact that no contact between the bone and<br />implant was modelled, how was the radial reaction force calculated?</p><p><br />5) Quality of the results obtained using a finite element model is determined not<br />only by accuracy of the constitutive parameters for the model but also by how<br />closely the model represents the geometry and boundary conditions of the<br />analysed structure (see e.g. Bathe 1996). What was the rationale for the<br />Authors&rsquo; assumption that patient-specific constitutive properties and generic<br />implant and bone geometry are sufficient to build a patient-specific boneimplant<br />model?</p><p><br />6) How were the dimensions of the bone part of the model determined?</p><p><br />7) In the first paragraph of section 2.1.2 Construction of patient-specific finite<br />element analysis the Authors state that &ldquo;The mesh used for the simulation is a<br />generic mesh &hellip;&rdquo;. However, in the second paragraph in the same section they<br />write that &ldquo; Elements outside of the bone are assigned near zero &hellip;stiffness,<br />making the patient specific mesh construction entirely automatic&rdquo;. This seems<br />a contradiction. Was the patient-specific or generic mesh used?</p><p><br />8) What do the Authors mean by the &ldquo;implant stability&rdquo; given the fact that they<br />assume that there is no movement between the bone and implant?</p><p><br /><strong>Minor comment:</strong><br />The paper should be re-written using the single-column format (see the Insight<br />Journal submission template at<br />http://insightsoftwareconsortium.org/wiki/index.php/IJ-Article-Template).</p><p><br /><strong>References</strong><br />Bathe, K.-J., 1996. Finite Element Procedures. Prentice-Hall, Upper Saddle River.</p><p><br />Viceconti, M., Olsen, S., Nolte, L.-P., and Burton, K., 2005. &quot;Extracting clinically<br />relevant data from finite element simulations,&quot; Clinical Biomechanics, Vol. 20,<br />pp. 451-454.</p><p><br />Zienkiewicz, O. C. and Taylor, R. L., 2000. The Finite Element Method. Vol. 2: Solid<br />mechanics London: McGraw-Hill.<br /> </p>",
    "date": "06-30-2008",
    "review_id": 1477
   }
  ],
  "submitted_by_author": {
   "author_email": "thibaut.bardyn@memcenter.unibe.ch",
   "author_firstname": "Thibaut",
   "author_id": 829,
   "author_institution": "MEM Research Center - University of Bern",
   "author_lastname": "Bardyn"
  },
  "tags": [
   "osseointegration",
   "implant",
   "finite element",
   "planning"
  ],
  "title": "Predicting implant stability: in vitro validation in artificial bone"
 }
}