{
 "publication": {
  "abstract": "This paper presents the description on Healthcare organizations are required to focus on Total quality improve:- Rendering acceptable, quality health services to patients at affordable price within reasonable price, within in a reasonable time; Applying zero errors to all patients services; maintaining a continuous error prevention program; Training employees in medical care on such aspects as error prevention,reducing delay time and providing prompt reasonable to patients needs; management system have always improvement in such systems to realize the true nature of the quality of healthcare and to be motivated towards improving this quality.In spite of billions of dollars of money spent worldwide, most of the healthcare is seen to be ineffective, inefficient and inadequate. Therefore there is a crying need to bring about a paradigm shift in the quality of health care delivery and to monitor and sustain it. It is obvious that those institutions, which are quality conscious and are committed to continuous quality improvement, will gain the highest consumer acceptance and will flourish at the expense of others. The 'Quality Revolution', as it is sometimes referred to, is nothing but putting the patient at the heart of health care and wrapping the care around it, rather than the other way around. Quality Measuring and assessing service is important, particularly when multiple sources of variation are present. Analyzing all medical processes to remove rework and waste could build health care quality and lead to significant reductions in patient cost. The use of quality-assurance programs and statistical tools can be directly applied to health-care organizations with improved quality of patient's objectives and the results of care from the patient's viewpoint.",
  "authors": [
   {
    "author_fullname": "Patel, Gunjan",
    "author_place": 1,
    "persona_email": "gunjannpatel@gmail.com",
    "persona_firstname": "Gunjan",
    "persona_id": 2151,
    "persona_lastname": "Patel"
   },
   {
    "author_fullname": "P, G",
    "author_place": 2,
    "persona_id": null
   }
  ],
  "categories": [
   "Data Representation",
   "Statistical shape models",
   "Unsupervised learning and clustering"
  ],
  "comments": [],
  "date_submitted": "2009-05-27 08:11:59",
  "handles": [
   {
    "handle": "10380/3062",
    "handle_url": "http://hdl.handle.net/10380/3062"
   }
  ],
  "identifiers": {
   "doi": null,
   "pubmed": null
  },
  "journals": [
   {
    "journal_id": 31,
    "journal_name": "The MIDAS Journal"
   }
  ],
  "license": "You are licensing your work to Kitware Inc. under the\nCreative Commons Attribution License Version 3.0.\n\nKitware Inc. agrees to the following:\n\nKitware is free\n * to copy, distribute, display, and perform the work\n * to make derivative works\n * to make commercial use of the work\n\nUnder the following conditions:\n\\\"by Attribution\\\" - Kitware must attribute the work in the manner specified by the author or licensor.\n\n * For any reuse or distribution, they must make clear to others the license terms of this work.\n * Any of these conditions can be waived if they get permission from the copyright holder.\n\nYour fair use and other rights are in no way affected by the above.\n\nThis is a human-readable summary of the Legal Code (the full license) available at\nhttp://creativecommons.org/licenses/by/3.0/legalcode",
  "publication_id": 690,
  "reviews": [],
  "submitted_by_author": {
   "author_email": "gunjannpatel@gmail.com",
   "author_firstname": "Gunjan",
   "author_fullname": "Patel, Gunjan",
   "author_id": 2151,
   "author_institution": "MCIS,Manipal University",
   "author_lastname": "Patel"
  },
  "tags": [
   "Quality Revolution",
   "QFD",
   "TQM",
   "Quality Tools",
   "Healthcare",
   "Six sigma"
  ],
  "title": "Total Quality Management in Healthcare"
 }
}