{
  "publication": {
    "abstract": "In this paper , we propose an extension to the National Library of Medicine's Insight Segmentation and Registration Toolkit (ITK. www.itk.org) with a companion image access and archival system that merges the image transfer capabilities of DICOM with DSpace (www.dspace.org), an open-source web-based digital library technology. We have extended and linked existing, freely-available DICOM and digital library software to create DICOM Accessible Digital Libraries (DADLs). Specifically, DICOM objects (and other medical image data formats such at Analyze,MetaImage) uploaded to a DADL can be grouped with other files such as journal articles or tracker data, viewed as thumbnails, and made publicly or privately available for others to search and download from a linked DICOM server. In that manner, once a researcher has identified the data he / she needs via an Internet search using meaningful descriptors, the data can be directly downloaded via standard DICOM query and retrieve utilities and that data will be perpetually indexed and accessible via an Internet handle.",
    "articles": [
      "bafkreiady247celdq2gvkcouaoxxnwxu6uellusnvk5mzv5n2tz3voioi4"
    ],
    "authors": [
      {
        "author_fullname": "Dalal, Dhaval",
        "author_place": 1,
        "persona_email": "dalal@bnl.gov",
        "persona_firstname": "Dhaval",
        "persona_id": 18,
        "persona_lastname": "Dalal"
      },
      {
        "author_fullname": "Jomier, Julien",
        "author_place": 2,
        "persona_email": "julien@jomier.com",
        "persona_firstname": "Julien",
        "persona_id": 3,
        "persona_lastname": "Jomier"
      },
      {
        "author_fullname": "Aylward, Stephen",
        "author_place": 3,
        "persona_email": "stephen.aylward@kitware.com",
        "persona_firstname": "Stephen",
        "persona_id": 1,
        "persona_lastname": "Aylward"
      }
    ],
    "categories": [],
    "comments": [],
    "date_submitted": "2005-08-05T17:01:04Z",
    "handles": [
      {
        "handle": "1926/36",
        "handle_url": "http://hdl.handle.net/1926/36"
      }
    ],
    "identifiers": {
      "doi": null,
      "pubmed": null
    },
    "journals": [
      {
        "journal_id": 3,
        "journal_name": "The Insight Journal"
      }
    ],
    "license": "You are licensing your work to Kitware Inc. under the\nCreative Commons Attribution License Version 3.0.\n\nKitware Inc. agrees to the following:\n\nKitware is free\n * to copy, distribute, display, and perform the work\n * to make derivative works\n * to make commercial use of the work\n\nUnder the following conditions:\n\\\"by Attribution\\\" - Kitware must attribute the work in the manner specified by the author or licensor.\n\n * For any reuse or distribution, they must make clear to others the license terms of this work.\n * Any of these conditions can be waived if they get permission from the copyright holder.\n\nYour fair use and other rights are in no way affected by the above.\n\nThis is a human-readable summary of the Legal Code (the full license) available at\nhttp://creativecommons.org/licenses/by/3.0/legalcode",
    "publication_id": 25,
    "reviews": [
      {
        "author": {
          "author_email": "luis.ibanez@kitware.com",
          "author_firstname": "Luis",
          "author_id": 4,
          "author_lastname": "Ibanez"
        },
        "content": "<b>Summary:</b>\r\nThis paper presents a tool for sharing DICOM images by using the Open Source systems DSpace and DCMTK.\r\n\r\n \r\n<b>Hypothesis:</b>\r\nThis paper parts from the hypothesis that a DICOM query retrieve system based on Open Source tools, can be develop for empowering users to share DICOM images.\r\n\r\n<b>Evidence:</b>\r\nA System was developed using DSpace (an open source system for maintaining institutional repositories) and DCMTK a DICOM library. The system is used for managing the images of this current conference, which provides clear evidence for its usability. \r\n\r\n<b>Open Science:</b>\r\nThe paper fully adheres to the principles of Open Science. The full material used and developed by the authors is made available. The source code of the DICOM tools is made available as part of Insight Applications, a DICOM image example is provided in order to test the system, and even the Latex source file of the paper has been uplodaded and shared with the readers.\r\n\r\n<b>Reproducibility:</b>\r\nThe reviewer attempted to rebuild the software but got entangled in a number of issues.\r\n1) This applicationrequires the dcmtk library to be built into the same system\r\n2) A number of modifications were needed in order to configure the system with CMake 2.2\r\n3) The library \"libwrap\" should be installed in the system. This seems to be needed for SSH access.\r\n\r\nAfter this modification, the reviewer still end up in a link error problem that didn't seem to be trivial to solve since it was a missing symbol from the dcmtk library.\r\n\r\nThe reviewer did this with a Debian Linux system, so it seems that some work is required for enhancing the portability of the application.\r\n\r\n\r\n<b>Use of Open Source Software:</b>\r\nThe authors made extensive use of open source tools. In particular\r\n\r\n* dcmtk : DICOM library\r\n* ITK : Image processing\r\n* FLTK : Graphical user interface\r\n\r\n\r\n<b>Open Source Contributions:</b>\r\nThe author have contributed their code already to the Insight Toolkit and it is distributed as part of InsightApplications. Unfortunately the code is not build at this point in all the platforms that are tested in the Dashboard, because it requires dcmtk to be build in the same system. It is worth to make an effort to ensure that this applications gets built nightly in at least the most popular platforms.\r\n\r\n<b>Code Quality:</b>\r\nThe code is well structured and follows the coding style of the Insight Toolkit.\r\n\r\n<b>Applicability to other problems:</b>\r\nThe tool can be reused by converting it into a module of larger applications. It is worth to add an extra GUI designed to be embedded into a main FLTK window, so the entire current application could be the PACS communication module of a larger application.\r\n\r\n<b>Suggestions for future work:</b>\r\nDetaching the application from the GUI may be an interesting thing to pursue. Probably something that should be done by a third party to ensure that the central piece of the query / retrieve functionalities can be used from different GUI fronts.\r\n\r\n<b>Requests for additional information from authors:</b>\r\nAdditional instructions on how to build the application will be appreciated. In particular on how to build dcmtk so that it is compatible with the configuration of the application.\r\n\r\n<b>Additional Comments:</b>\r\nFuture authors submitting papers to the Insight Journal may want to use this appliation as a portal for reusing data that has already been contributed to the image database of the journal.\r\n\r\n",
        "date": "09-19-2005",
        "review_id": 110
      },
      {
        "author": {
          "author_email": "holmes.david3@mayo.edu",
          "author_firstname": "David",
          "author_id": 20,
          "author_lastname": "Holmes"
        },
        "content": "<b>Summary:</b>\r\nThis paper describes the combination of the DICOM tools available within ITK (or more specifically, the DCMTK tools) with the DSpace package. The purpose of this work is to create an open, accessible framework for archiving medical image data. \r\n\r\n<b>Hypothesis:</b>\r\nThis work is not specifically hypothesis driven; however, the underlying supposition of this work is that there is a need for a well-defined architecture that for medical image archiving outside the scope of clinical RIS, HIS, and PACS systems\r\n\r\n<b>Evidence:</b>\r\nThe evidence will be generated as the package is used. Given that the submission system for this journal appears to be based on DSpace and the CADDLab MIDAS, I think that this evidence is already being generated. \r\n\r\n<b>Open Science:</b>\r\nThis work is consistent with open science principles.\r\n\r\n<b>Reproducibility:</b>\r\nUnfortunately, I have to say this is the only area where the paper is missing information. I would not be able to reproduce this very easily because the necessary information is not available. It would be beneficial to have an additional documented with this submission which lays out the steps required to link DSpace and DCMTK into a working system.\r\n\r\n<b>Use of Open Source Software:</b>\r\nThis project takes full advantage of open-source software to achieve the goals. \r\n\r\n<b>Open Source Contributions:</b>\r\nThe extensions proposed and effort in linking the different packages should add to the open source movement.\r\n\r\n<b>Code Quality:</b>\r\nNot Applicable\r\n\r\n<b>Applicability to other problems:</b>\r\nThis described tool/framework has broad applicability to many different image database collections.\r\n\r\n<b>Suggestions for future work :</b>\r\nCollaborate with everybody.\r\n\r\n<b>Requests for additional information from authors :</b>\r\n\r\nHere are a few suggestions/thoughts â\u0080\u0093\r\n\r\nIn paragraph 1, you could have better referenced your references. I noted that the DSpace reference was missing right away. Also, in paragraph 1, you refer to the NIH data sharing policy. I suggest that you look for a specific reference about that or suggest that this is your interpretation of what NIH might be interested in.\r\n\r\nIn the same manner, in paragraph 3, it would be appropriate to include a reference for the Library of Congeressâ\u0080\u0099 web-based handle system.\r\n\r\nIn section 2.1 you should consider a reference for proper anonymization or a description of what you information you anonymize. \r\n\r\nI would suggest a simple readme.txt that outlines the necessary steps to create a DADL.\r\n\r\n\r\n<b>Additional Comments:</b>\r\n\r\nThere is no reason that this work shouldn't receive a higher score except there is little information on the creation of a DADL using the work that the authors have done. While most of my suggestions aren't particularly important, I would stress the addition of a readme file for setup. This would not require much effort by the authors, but would dramatically increase the rating.",
        "date": "08-22-2005",
        "review_id": 27
      }
    ],
    "submitted_by_author": {
      "author_email": "dalal@bnl.gov",
      "author_firstname": "Dhaval",
      "author_fullname": "Dalal, Dhaval",
      "author_id": 18,
      "author_institution": "CADDlab",
      "author_lastname": "Dalal"
    },
    "tags": [
      "DICOM",
      "DSpace",
      "DCMTK"
    ],
    "title": "A DICOM-based Software Infrastructure for Data Archiving"
  }
}