{
  "publication": {
    "abstract": "The Image-Guided Surgery Toolkit (IGSTK) is an Open Source software project being developed under NIH/NIBIB funding. The toolkit will provide a common platform for implementing image-guided surgery applications and for fostering research in the field. The toolkit is based on several other open source toolkits including ITK, VTK and FLTK. Its architecture is based on the use of medium size classes, each one of them containing an explicit State Machine and a minimized API that enforces fault tolerance by design. This paper describes the architecture and its rationale.",
    "articles": [
      "bafkreicgjtpw654dd3btzeoysdbdvzz6ihef4kgai72j6cfqeqh6c4l674"
    ],
    "authors": [
      {
        "author_fullname": "Ibanez, Luis",
        "author_place": 1,
        "persona_email": "luis.ibanez@kitware.com",
        "persona_firstname": "Luis",
        "persona_id": 4,
        "persona_lastname": "Ibanez"
      },
      {
        "author_fullname": "Jomier, Julien",
        "author_place": 2,
        "persona_email": "julien@jomier.com",
        "persona_firstname": "Julien",
        "persona_id": 3,
        "persona_lastname": "Jomier"
      },
      {
        "author_fullname": "Gobbi, David",
        "author_place": 3,
        "persona_email": "david.gobbi@gmail.com",
        "persona_firstname": "David",
        "persona_id": 881,
        "persona_lastname": "Gobbi"
      },
      {
        "author_fullname": "Avila, Rick",
        "author_place": 4,
        "persona_email": "rick.avila@kitware.com",
        "persona_firstname": "Rick",
        "persona_id": 214,
        "persona_lastname": "Avila"
      },
      {
        "author_fullname": "Blake, M. Brian",
        "author_place": 5,
        "persona_email": "blakeb@cs.georgetown.edu",
        "persona_firstname": "M. brian",
        "persona_id": 80,
        "persona_lastname": "Blake"
      },
      {
        "author_fullname": "Kim, Hee-Su",
        "author_place": 6,
        "persona_email": "wizardhs@gmail.com",
        "persona_firstname": "Hee-su",
        "persona_id": 278,
        "persona_lastname": "Kim"
      },
      {
        "author_fullname": "Gary, Kevin",
        "author_place": 7,
        "persona_email": "kgary@asu.edu",
        "persona_firstname": "Kevin",
        "persona_id": 274,
        "persona_lastname": "Gary"
      },
      {
        "author_fullname": "Aylward, Stephen",
        "author_place": 8,
        "persona_email": "stephen.aylward@kitware.com",
        "persona_firstname": "Stephen",
        "persona_id": 1,
        "persona_lastname": "Aylward"
      },
      {
        "author_fullname": "Cleary, Kevin",
        "author_place": 9,
        "persona_email": "cleary@georgetown.edu",
        "persona_firstname": "Kevin",
        "persona_id": 368,
        "persona_lastname": "Cleary"
      }
    ],
    "categories": [],
    "comments": [],
    "date_submitted": "2005-08-05T06:27:18Z",
    "journals": [
      {
        "journal_id": 3,
        "journal_name": "The Insight Journal"
      }
    ],
    "license": "You are licensing your work to Kitware Inc. under the\nCreative Commons Attribution License Version 3.0.\n\nKitware Inc. agrees to the following:\n\nKitware is free\n * to copy, distribute, display, and perform the work\n * to make derivative works\n * to make commercial use of the work\n\nUnder the following conditions:\n\\\"by Attribution\\\" - Kitware must attribute the work in the manner specified by the author or licensor.\n\n * For any reuse or distribution, they must make clear to others the license terms of this work.\n * Any of these conditions can be waived if they get permission from the copyright holder.\n\nYour fair use and other rights are in no way affected by the above.\n\nThis is a human-readable summary of the Legal Code (the full license) available at\nhttp://creativecommons.org/licenses/by/3.0/legalcode",
    "publication_id": 26,
    "reviews": [
      {
        "author": {
          "author_email": "baghdadi@phenogenomics.ca",
          "author_firstname": "Leila",
          "author_id": 7,
          "author_lastname": "Baghdadi"
        },
        "content": "<b>Summary:</b>\r\n[This paper describes tracking systems for surgical procedures. I think the effort for a proper design before development is the most impressive as I have not rpesonally used the code.]\r\n \r\n<b>Hypothesis:</b>\r\n[Not Applicable]\r\n\r\n<b>Evidence:</b>\r\n[Although the authors have provided urls to support their claim, no example was given in the actual paper. ]\r\n\r\n<b>Open Science:</b>\r\n[Once again, there was no specific example in the paper but judging by list of authors I am sure there is proof for all claims made in the paper.]\r\n\r\n<b>Reproducibility:</b>\r\n[Not applicable]\r\n\r\n<b>Use of Open Source Software:</b>\r\n[The use of ITK , VTK and FLTK guarantees the use of open source software.]\r\n\r\n<b>Open Source Contributions:</b>\r\n[URLs for software and instructions for use was provided.]\r\n\r\n<b>Code Quality:</b>\r\n[Not applicable]\r\n\r\n<b>Applicability to other problems:</b>\r\n[This paper describes a specific tool for surgey so I do not believe it is applicable to everyone's research. However, the design methods and the use of state machines for determining the state of each class can possibly be applied to alot of research probelms.]\r\n\r\n<b>Suggestions for future work:</b>\r\n[Not Applicable]\r\n\r\n<b>Requests for additional information from authors:</b>\r\n[Not Applicable]\r\n\r\n<b>Additional Comments:</b>\r\n[Not Applicable]\r\n\r\n",
        "date": "09-13-2005",
        "review_id": 65
      },
      {
        "author": {
          "author_email": "i.wolf@dkfz.de",
          "author_firstname": "Ivo",
          "author_id": 6,
          "author_lastname": "Wolf"
        },
        "content": "<b>Summary:</b>\r\nThe architecture of a new toolkit (beta version available) for image-guided surgery and rationale of its design concepts are described. The key goal of the toolkit is to provide â\u0080\u009csafety-by-designâ\u0080\u009d, thus to ensure (or support) robustness of image-guided surgery applications by means of adhering to the toolkits design specifications. A key concept (also mentioned in the paperâ\u0080\u0099s title) to achieve this goal is the use of state machines.\r\n \r\n<b>Hypothesis:</b>\r\nOnly partially applicable: An implicit hypothesis of the paper is that safety-by-design is possible and state machines are suitable to achieve safety-by-design.\r\n\r\n<b>Evidence:</b>\r\nOnly partially applicable: Evidence for the hypothesis can not be expected until the toolkit has been used for real-life image-guided surgery scenarios.\r\n\r\n<b>Open Science:</b>\r\nA real open science project, everything is publicly available via the web-addresses mentioned in the article.\r\n\r\n<b>Reproducibility:</b>\r\nI did download, compile and run the code, but not recently (several months ago). It worked nicely that time.\r\n\r\n<b>Use of Open Source Software:</b>\r\nSeveral open source software are used: ITK, VTK, FLTK.\r\nAdvantages or disadvantages or advice for future users of these toolkits are not described.\r\n\r\n<b>Open Source Contributions:</b>\r\nThe toolkit is open source and in beta stage. If the goal is achieved, it probably will be very useful.\r\n\r\n<b>Code Quality:</b>\r\nThe well proven software process of Kitware is used, even with the goal of 100% testing.\r\n\r\n<b>Applicability to other problems:</b>\r\nThe focus of the toolkit is clearly image-guided surgery. It is explicitly stated that only a very restrictive API is being provided to ensure as high a safety level as possible.\r\n\r\n<b>Suggestions for future work:</b>\r\nPersonal opinion: I like the idea of using explicit state machines (not surprisingly, as we use them also in MITK, although with a different focus). I would be interested in how much they support the â\u0080\u009csafety-by-designâ\u0080\u009d goal, thus would be looking forward to a paper addressing this issue. Be evil, try to do as bad a thing as you can and demonstrate how the state machines stop you from doing this. \r\n\r\n<b>Requests for additional information from authors:</b>\r\nnone\r\n\r\n<b>Additional Comments:</b>\r\nPersonally I do not expect that all bad things can be avoided by the state machine mechanism, but that it will be very useful for testing â\u0080\u0093 not only of the toolkit, but also of the application written using the toolkit, as required by the FDA.",
        "date": "09-15-2005",
        "review_id": 77
      },
      {
        "author": {
          "author_email": "tkapur@bwh.harvard.edu",
          "author_firstname": "Tina",
          "author_id": 96,
          "author_lastname": "Kapur"
        },
        "content": "<b>Summary:</b>\r\nThis submission is a software toolkit for building Image-Guided Surgery (IGS) applications, and the companion paper describes the state machine abstraction used in the design of the toolkit. The toolkit is written in C++ and builds upon other three other open source toolkits, ITK (for image representation and processing), VTK (for visualization), and FLTK (for user interface). \r\n\r\nThis review consisted of using the instructions in the paper to download the sources and compile the toolkit (under Cygwin on a Windows XP on a Sony Viao S260 laptop with Intel 1.7Gz/512 MB Ram), running the examples, reading technical discussions that have been captured on the IGSTK wiki, joining the mailing list and participating in discussions there, and examining the source code. \r\n\r\n<b> Significance </b>\r\nI think that the creation of IGSTK is very timely. Unlike the scenario of 5-10years ago, when the technology involved in building IGS platforms was novel enough that various research labs created in-house prototypes and used those to perform scientific research, the IGS landscape today is much more mature with several companies building systems and over a thousand hospitals using these commercial systems on a routine basis. This migration of IGS systems into the commercial domain has created somewhat of a logistical void between the research and commercial worlds; Building the software and hardware for such systems from scratch no longer belongs in the research domain but at the same time companies in the area have not yet published interfaces that would allow researchers to easily test their applications/algorithms in a clinical context. I expect IGSTK to be most relevant for researchers who are seeking a software platform on which to add their contributions (such as improvements to the accuracy of a registration algorithm, a novel segmentation algorithm, a novel clinical workflow etc.) without first having to build the platform. \r\n\r\n<b> Hypothesis </b>\r\nI would say that there are three underlying hypotheses in this work: (1) a toolkit is needed for IGS (b) open source is a good way to do it and (c) state machines are a good abstraction for the components of such a toolkit.\r\n\r\n<b> Evidence </b>\r\nOn need and open source: I think that there is general agreement in the field that such a toolkit would be useful and that it's existence could allow researchers to focus on creating novel algorithms and clinical applications. The benefits of open source are well known and hence the argument for an open source version of the toolkit, but I can also see another scenario (with its own overhead, no doubt) that would achieve similar impact in which established IGS companies would provide APIs that would allow researchers to add applications to their existing hardware and software platforms. In fact, IGS companies have considered this options for a while and perhaps the existence of IGSTK will accelerate that process and allow researchers to have multiple options. The benefit of the API would be the availability of both the hardware and the software, while the benefit of the open source software toolkit is that one doesn't need to deal with any commercial entities.\r\n\r\nOn State Machines: The major components of the toolkit (viewers, spatial objects, tracker, logger) are modeled explicitly as state machines with well defined states and transitions. I think that the tracker component is particularly well suited to this abstraction because it models a device with a few clearly defined states and transitions. The use of the abstraction made the code of the tracker classes very simple to follow. I couldn't see the immediate benefit (or hazard) of using the same abstraction for the other components, for which I have seen non state-machine based implementations that do the job just fine. In any case, the motivation for using state machines is to potentially facilitate comprehensive testing, which is a good thing. For the interested reader, an active discussion is ongoing in the group via the mailing list and the wiki pages about how best to utilize hierarchical state machines in the toolkit.\r\n\r\n<b> Misc Points on Open Source/Useability/Code/Practices for Potential Users </b>\r\n- http://www.igstk.org is the best place to get the latest information about the toolkit. and is actively updated.\r\n- Good engineering practices (revision control, nightly builds, error monitoring via dashboards, active mailing lists, reasonable coding style,code reviews, documentation, wiki discussions) are all followed in the project which means that if you start using this toolkit, you will inherit a community that will answer your questions at the very least, and probably also help you move forward in your work.\r\n-Even if you are not interested in using the entire toolkit, some of the components such as the Tracker and the SpatialObjects can be used independently. The tracker component allows easy intergration of different trackers (NDI trackers are currently supported) and also has a very useful simulation mode to allow testing/demo without a physical tracker.\r\n-The learning curve for users who are not familiar with the VTK and ITK worlds will be steep. For example, I don't use cmake in my daily life, so I always spend the bulk of my installation cycles reminding myself on how to use it.\r\n-Some installation notes: I started with the iteration-2 tag, but quickly moved to the cvs head to take advantage of the additional bug fixes and features. If you are using Tortoise on Windows to interface to cvs (like I do), ensure that the tags are set correctly when you decide to move from the iteration-# tag to the head. I also had to comment out a line in the file igstkImageSpatialObjectRepresentation.cxx (line 170 in v1.1. of the file) to be able to compile. I figured I'd revisit it if I was missing any functionality in the examples, but didn't seem to.\r\n-The developer mailing list is quite active and the IGSTK team is very responsive to outside questions/input. If you are considering using this toolkit down the road, you might find it beneficial to get involved with the group now and share your use-cases with them. \r\n- The tool is a work in progress, as are the example programs available with it. The team plans to release a clinically realistic application example this year, which should showcase more of its functionality.\r\n\r\n<b> Overall </b>\r\nI am giving this paper a 4 rating because it satisfies all the criteria of good open source in terms of mechanics, and I also think that the end result will be useful to the field and the current state of the work shows every indication that it will get there within the year. For folks who are interested in checking it out right now, my suggestion is that the time you will spend getting a working copy of the toolkit on your machine will be worthile if you are a developer and would like to be an informed participant in the discussions that are shaping the toolkit. If your interest is to use the toolkit to build your own application, I would recommend waiting until the first clinical tracking application is released later this year.\r\n\r\n",
        "date": "09-15-2005",
        "review_id": 70
      }
    ],
    "revisions": [
      {
        "article": "bafkreicgjtpw654dd3btzeoysdbdvzz6ihef4kgai72j6cfqeqh6c4l674",
        "citation_list": [
          {
            "doi": "10.1007/978-3-540-40899-4_11",
            "key": "ref1",
            "score": 101.67977,
            "unstructured": "\"Ultrasound/MRI overlay with image warping for neurosurgery.\" MICCAI 2000, Pittsburg+October+11+106+114+2000+D.G. Gobbi+R.M. Comeau+T.M.: Peters"
          },
          {
            "doi": "10.1093/oso/9780198250791.003.0005",
            "key": "ref2",
            "score": 76.97512,
            "unstructured": "\"On Computable Numbers, with an application to the+Entscheidungsproblem.\"+1936+A. Turing"
          },
          {
            "key": "ref3",
            "score": 44.037132,
            "unstructured": "Building a Safer Health System”+2000+L.T. Kohn+J.M. Corrigan+M.S. Donaldson"
          },
          {
            "key": "ref4",
            "score": 42.776188,
            "unstructured": "Center for Devices and Radiological Health+2005+FDA"
          },
          {
            "key": "ref5",
            "score": 42.776188,
            "unstructured": "FDA Center for Devices and Radiological Health+September 9th+1999"
          },
          {
            "key": "ref6",
            "score": 42.776188,
            "unstructured": "Center for Devices and Radiological Health+July+27+2000+FDA"
          },
          {
            "key": "ref7",
            "score": 42.776188,
            "unstructured": "Center for Devices and Radiological Health+January+11+2002+FDA"
          },
          {
            "key": "ref8",
            "score": 25.994806,
            "unstructured": "The ITK Software Guide”, ISBN 1-930934-10-6+2005+L. Ibanez+W. Schroeder"
          },
          {
            "doi": "10.1016/b978-012387582-2/50003-4",
            "key": "ref9",
            "score": 78.10236,
            "unstructured": "The Visualization Toolkit, An Object Oriented Approach to 3D Graphics”, Kitware Inc+1998+W. Schroeder+K. Martin+B. Lorensen"
          },
          {
            "key": "ref10",
            "score": 27.500834,
            "unstructured": "a cross-platform C++ GUI Toolkit+FLTK"
          },
          {
            "key": "ref11",
            "score": 38.064224,
            "unstructured": "Software Freedom and Intellectual Property Law”+ISBN: 0131487876+2004+Hall Prentice"
          }
        ],
        "dapp": null,
        "dataset": null,
        "doi": null,
        "handle": "1926/31",
        "source_code": null,
        "source_code_git_ref": null
      }
    ],
    "source_code_git_repo": null,
    "submitted_by_author": {
      "author_email": "luis.ibanez@kitware.com",
      "author_firstname": "Luis",
      "author_fullname": "Ibanez, Luis",
      "author_id": 4,
      "author_institution": "KITWARE Inc.",
      "author_lastname": "Ibanez"
    },
    "tags": [
      "State Machines",
      "Mission Critical Applications",
      "Open Source Software",
      "Image Guided Surgery"
    ],
    "title": "IGSTK: A State Machine Architecture for an Open Source Software Toolkit for Image-Guided Surgery Applications"
  }
}