{
  "publication": {
    "abstract": "The Medical Imaging Interaction Toolkit (MITK) is an opensource toolkit for the development of interactive medical image analysis software. MITK is based on the open-source Insight Toolkit (ITK) and Visualization Toolkit (VTK) and extends them with features required for interactive systems. ITK is used for the algorithmic scope and general infrastructure, VTK for visualization. Key features of MITK are the coordination of multiple 2D and 3D visualizations of arbitrary data, a general interaction concept including undo/redo, and its extendibility and flexibility to create tailored applications due to its toolkit character and\r\ndifferent layers of hidden complexity. The paper gives a brief introduction into the overall concepts and goals of the MITK approach. Suggestions and participation are welcome. MITK is available at www.mitk.org.",
    "articles": [
      "bafybeibqkhfwhewzllrgc2teg3ludkff4qwz6tjrsqiohjpaa6adsaie6u"
    ],
    "authors": [
      {
        "author_fullname": "Wolf, Ivo",
        "author_place": 1,
        "persona_email": "i.wolf@dkfz.de",
        "persona_firstname": "Ivo",
        "persona_id": 6,
        "persona_lastname": "Wolf"
      },
      {
        "author_fullname": "Nolden, Marco",
        "author_place": 2,
        "persona_id": null
      },
      {
        "author_fullname": "Boettger, Thomas",
        "author_place": 3,
        "persona_email": "th.boettger@web.de",
        "persona_firstname": "Thomas",
        "persona_id": 117,
        "persona_lastname": "Boettger"
      },
      {
        "author_fullname": "Wegner, Ingmar",
        "author_place": 4,
        "persona_id": null
      },
      {
        "author_fullname": "Schoebinger, Max",
        "author_place": 5,
        "persona_email": "m.schoebinger@dkfz-heidelberg.de",
        "persona_firstname": "Max",
        "persona_id": 172,
        "persona_lastname": "Schoebinger"
      },
      {
        "author_fullname": "Hastenteufel, Mark",
        "author_place": 6,
        "persona_email": "m.hastenteufel@gmx.de",
        "persona_firstname": "Mark",
        "persona_id": 12,
        "persona_lastname": "Hastenteufel"
      },
      {
        "author_fullname": "Heimann, Tobias",
        "author_place": 7,
        "persona_email": "t.heimann@dkfz-heidelberg.de",
        "persona_firstname": "Tobias",
        "persona_id": 210,
        "persona_lastname": "Heimann"
      },
      {
        "author_fullname": "Meinzer, Hans-Peter",
        "author_place": 8,
        "persona_id": null
      },
      {
        "author_fullname": "Vetter, Marcus",
        "author_place": 9,
        "persona_id": null
      }
    ],
    "categories": [],
    "comments": [],
    "date_submitted": "2005-07-29T16:39:01Z",
    "journals": [
      {
        "journal_id": 3,
        "journal_name": "The Insight Journal"
      }
    ],
    "license": "You are licensing your work to Kitware Inc. under the\nCreative Commons Attribution License Version 3.0.\n\nKitware Inc. agrees to the following:\n\nKitware is free\n * to copy, distribute, display, and perform the work\n * to make derivative works\n * to make commercial use of the work\n\nUnder the following conditions:\n\\\"by Attribution\\\" - Kitware must attribute the work in the manner specified by the author or licensor.\n\n * For any reuse or distribution, they must make clear to others the license terms of this work.\n * Any of these conditions can be waived if they get permission from the copyright holder.\n\nYour fair use and other rights are in no way affected by the above.\n\nThis is a human-readable summary of the Legal Code (the full license) available at\nhttp://creativecommons.org/licenses/by/3.0/legalcode",
    "publication_id": 13,
    "reviews": [
      {
        "author": {
          "author_email": "stephen.aylward@kitware.com",
          "author_firstname": "Stephen",
          "author_id": 1,
          "author_lastname": "Aylward"
        },
        "content": "<b>Summary:</b>\r\nThe authors present MITK, a freely available and truly open-source (commercial and non-commercial use) software library that provides modules that integrate and extend ITK, VTK, GLUT, and FLTK/QT. Integration alone is noteworthy - the extensions are even more noteworthy.\r\n\r\nKey features include the coordination fo multiple 2D/3D visualizations of spatial objects, a general interaction concept including undo/redo, and a layered API that hides complexity at upper levels while also allowing specialization of functionality at lower levels.\r\n\r\nThe layered approach is particularly useful in this context. A user can quickly piece together some broad modules to form a \"standard\" application, and then time can be spent to refine the inner workings of one or two of the modules to provide tailored functionality.\r\n \r\n<b>Hypothesis:</b>\r\nA diversity of open-source projects can be integrated and wrapped to provide software modules that simplify medical image analysis application development.\r\n\r\n<b>Evidence:</b>\r\nThe paper is written in a casual tone and introduces the concepts behind MITK and provides a few specifcs regarding the options available in MITK.\r\n\r\nThe paper provides an excellent overview of which strengths were combined from the various open source packages that comprise MITK. That overview is written at an ideal level of detail. Specific programming constructs (e.g., smart pointers) are mentioned without going into overly detailed explanations. The details given are exactly what a reader would need to begin to investigate the integration of those packages into his/her own toolkit.\r\n\r\nThe paper, however, would benefit from a bit more details regarding what options are available to someone using MITK to develop an application. A list of available visualization models, for example. Otherwise, the authors could provide more details regarding the process of developing one or two demonstration applications using MITK. Either type of additional information would be welcome.\r\n\r\n<b>Open Science:</b>\r\nMITK is released under an open-BSD-style license. It is available for commercial or non-commercial use. Many aspects are GUI independent, and GUI components from different packages (e.g., QT or FLTK) can be used; however, most work appears to be done with QT components - the development of FLTK components seems to be more limited. This is unfortunate given QT's licensing restrictions.\r\n\r\n<b>Reproducibility:</b>\r\nThe website for MITK is very good. Publications, documentation, and the code are readily available. The installation details and requirements are well specificied.\r\n\r\n<b>Use of Open Source Software:</b>\r\nMakes heavy use of open-source.\r\n\r\n<b>Open Source Contributions:</b>\r\nIs released as open source: commercial and non-commercial.\r\n\r\n<b>Code Quality:</b>\r\nI did not look at the code, but the use of ITK, VTK, etc and the fact that the group has contributed back to those toolkits suggests that they use good coding style/practices.\r\n\r\n<b>Additional Comments:</b>\r\nUsers interesting in this package should be aware of related work in the form of Slicer and SOViewers. MITK, however, appears to fill a gap between those two toolkits. It allows more specialization than Slicer, and it is easier to develop a standard application using MITK than using SOViewers.\r\n",
        "date": "09-19-2005",
        "review_id": 109
      },
      {
        "author": {
          "author_email": "holmes.david3@mayo.edu",
          "author_firstname": "David",
          "author_id": 20,
          "author_lastname": "Holmes"
        },
        "content": "<b>Summary:</b>\r\nThis paper describes the development of a medical image software framework based on ITK, VTK, QT, and FLTK. The framework is, conceptionally, one level closer to the end-user than any of the components, because it creates high-level widgets and controls used for interacting with data and algorithms. End-user developers should be able to build interactive applications with MITK.\r\n \r\n\r\n<b>Hypothesis:</b>\r\nNot Applicable\r\n\r\n<b>Evidence:</b>\r\nNot Applicable other than the fact that the framework has been built. The paper doesn't provide studies or evidence that the framework is valid, end-user acceptable, fast, or other metrics of performace. However, this was not the intent of the paper and (my opinion only) I don't believe such a study would be prudent at this time. (my opinion only) I would suggest that the software probably requires some time to mature.\r\n\r\n<b>Open Science:</b>\r\nThe work is consistent with open science principles\r\n\r\n\r\n<b>Reproducibility:</b>\r\nThe software can be downloaded and run. Although the package hasn't been submitted with the paper, the paper explicitly describes where the code can be obtained from. I admit that I have not taken the time to download and run it. \r\n\r\n\r\n<b>Use of Open Source Software:</b>\r\nMost of the packages are open source except for QT which does have some licensing restrictions.\r\n\r\n<b>Open Source Contributions:</b>\r\nThe whole package is available for user evaluation. In addition, the authors request community participation to test and develop the software.\r\n\r\n<b>Code Quality:</b>\r\nOnce again, in the intereste of full disclosure, I have not yet downloaded the package and worked with it.\r\n\r\n<b>Applicability to other problems:</b>\r\nBecause it is a framework, there are many specific applications which can utilize this code to develop targeted software.\r\n\r\n<b>Suggestions for future work :</b>\r\nPerformace evaluation in the context of specifica applications.\r\n\r\n<b>Requests for additional information from authors :</b>\r\nIt would be beneficial to have a little code example in the text to show the implementation approach. As is noted in figure 2, a small example in fltk exists. Some amount of this code might be included and described in the text as a specific example.\r\n\r\n<b>Additional Comments:</b>\r\nNone\r\n",
        "date": "08-16-2005",
        "review_id": 28
      }
    ],
    "revisions": [
      {
        "article": "bafybeibqkhfwhewzllrgc2teg3ludkff4qwz6tjrsqiohjpaa6adsaie6u",
        "dapp": null,
        "dataset": null,
        "doi": null,
        "handle": "1926/380",
        "source_code": null,
        "source_code_git_ref": null
      },
      {
        "article": "bafybeibqkhfwhewzllrgc2teg3ludkff4qwz6tjrsqiohjpaa6adsaie6u",
        "dapp": null,
        "dataset": null,
        "doi": null,
        "handle": "1926/14",
        "source_code": null,
        "source_code_git_ref": null
      },
      {
        "article": "bafybeibqkhfwhewzllrgc2teg3ludkff4qwz6tjrsqiohjpaa6adsaie6u",
        "dapp": null,
        "dataset": null,
        "doi": null,
        "handle": "1926/1389",
        "source_code": null,
        "source_code_git_ref": null
      }
    ],
    "source_code_git_repo": null,
    "submitted_by_author": {
      "author_email": "i.wolf@dkfz.de",
      "author_firstname": "Ivo",
      "author_fullname": "Wolf, Ivo",
      "author_id": 6,
      "author_institution": "DKFZ",
      "author_lastname": "Wolf"
    },
    "tags": [
      "MITK",
      "visualization",
      "interaction",
      "VTK",
      "ITK"
    ],
    "title": "The MITK Approach"
  }
}