{
  "publication": {
    "abstract": "This work describes the implementation of computational geometry algorithms developed within the Insight Toolkit (ITK): Distance Transform (DT), Voronoi diagrams, k Nearest Neighbor (kNN) transform, and finally a K Nearest Neighbor classifier for multichannel data, that is used for supervised segmentation. We have tested this algorithm for 2D and 3D medical datasets, and the results are excellent in terms of accuracy and performance. One of the strongest points of the algorithms described here is that they can be used for many other applications, because they are based on the ordered propagation paradigm. This idea consists in actually not raster scan the image but rather in start from the image objects and propagate them until the image is totally filled. This has been demonstrated to be a good approach in many algorithms as for example, computation of Distance Transforms, Voronoi Diagrams, Fast Marching, skeletons computation, etc. We show here that these algorithms have low computational complexity and it provides excellent results for clinical applications as the segmentation of brain MRI.",
    "authors": [
      {
        "author_fullname": "Cardenes, Ruben",
        "author_place": 1,
        "persona_email": "ruben@ctm.ulpgc.es",
        "persona_firstname": "Ruben",
        "persona_id": 448,
        "persona_lastname": "Cardenes"
      },
      {
        "author_fullname": "Sanchez, Manuel Rene",
        "author_place": 2,
        "persona_id": null
      },
      {
        "author_fullname": "Ruiz-Alzola, Juan",
        "author_place": 3,
        "persona_id": null
      }
    ],
    "date_submitted": "2006-06-30T11:58:12Z",
    "handles": [
      {
        "handle": "1926/204",
        "handle_url": "http://hdl.handle.net/1926/204"
      }
    ],
    "id": 94,
    "identifiers": {
      "doi": null,
      "pubmed": null
    },
    "journals": [
      {
        "journal_id": 3,
        "journal_name": "The Insight Journal"
      }
    ],
    "submitted_by_author": {
      "author_email": "ruben@ctm.ulpgc.es",
      "author_firstname": "Ruben",
      "author_id": 448,
      "author_institution": "University of Las Palmas de Gran Canaria",
      "author_lastname": "Cardenes"
    },
    "tags": [
      "multichannel segmentation",
      "KNN Segmentation",
      "Computational Geometry",
      "Voronoi Diagrams",
      "KNN Transform",
      "Distance Transform",
      "ordered propagation"
    ],
    "title": "Computational Geometry Computation and KNN Segmentation in ITK"
  }
}