{
 "publication": {
  "abstract": "In this paper, we review the technical details of new features in OpenIGTLink version 2. OpenIGTLink is a free open-source network communication protocol designed for data exchange among devices and software. Since the first release of version 1.0 protocol along with a reference C/C++ library in 2008, the number of developers and users, who use OpenIGTLink in their research projects, have been growing among convincing some commercial companies to implement research interface based on OpenIGTLink their commercial products. However, the message types initially defined for research prototypes does not cover some of functionality in commercial products, thus the protocol needed to be requires refinement in the protocol. The goal of the extension in version 2 is to support such new demands emerged after the release of the initial version, while keeping the protocol as simple as possible. The version 2 protocol has been implemented as an extension of version 1; it is backward compatible in the sense that messages generated by OpenIGTLink version 2 compliant software can be received by version 1 compliant software. ",
  "authors": [
   {
    "author_fullname": "Tokuda, Junichi",
    "author_place": 1,
    "persona_email": "tokuda@bwh.harvard.edu",
    "persona_firstname": "Junichi",
    "persona_id": 761,
    "persona_lastname": "Tokuda"
   },
   {
    "author_fullname": "Hata, Nobuhiko",
    "author_place": 2,
    "persona_id": null
   }
  ],
  "categories": [
   "Data",
   "Images",
   "IO"
  ],
  "comments": [],
  "date_submitted": "2011-09-30 01:45:50",
  "handles": [
   {
    "handle": "10380/3293",
    "handle_url": "http://hdl.handle.net/10380/3293"
   }
  ],
  "identifiers": {
   "doi": null,
   "pubmed": null
  },
  "journals": [
   {
    "journal_id": 38,
    "journal_name": "MICCAI 2011 Workshops"
   }
  ],
  "license": "You are licensing your work to Kitware Inc. under the\nCreative Commons Attribution License Version 3.0.\n\nKitware Inc. agrees to the following:\n\nKitware is free\n * to copy, distribute, display, and perform the work\n * to make derivative works\n * to make commercial use of the work\n\nUnder the following conditions:\n\\\"by Attribution\\\" - Kitware must attribute the work in the manner specified by the author or licensor.\n\n * For any reuse or distribution, they must make clear to others the license terms of this work.\n * Any of these conditions can be waived if they get permission from the copyright holder.\n\nYour fair use and other rights are in no way affected by the above.\n\nThis is a human-readable summary of the Legal Code (the full license) available at\nhttp://creativecommons.org/licenses/by/3.0/legalcode",
  "publication_id": 823,
  "reviews": [],
  "submitted_by_author": {
   "author_email": "tokuda@bwh.harvard.edu",
   "author_firstname": "Junichi",
   "author_fullname": "Tokuda, Junichi",
   "author_id": 761,
   "author_institution": "Brigham and Women\\'s Hospital",
   "author_lastname": "Tokuda"
  },
  "tags": [
   "Network communication",
   "Image-guided therapy"
  ],
  "title": "OpenIGTLink Protocol Version 2"
 }
}