{
 "publication": {
  "abstract": "As part of the Center of Excellence in Genomic Science at Caltech, we have initiated the Digital Fish\r\nProject. Our goal is to use in toto imaging of developing transgenic zebrafish embryos on a genomic scale\r\nto acquire digital, quantitative, cell-based, molecular data suitable for modelling the biological circuits\r\nthat turn an egg into an embryo. In toto imaging uses confocal/2-photon microscopy to capture the\r\nentire volume of organs and eventually whole embryos at cellular resolution every few minutes in living\r\nspecimens thoughout their development. The embryos are labelled such that nuclei are one color and cell\r\nmembranes another color to allow cells to be segmented and tracked as they move and divide. The use\r\nof a transgenic marker in a third color allows a variety of molecular data to be marked. In toto imaging\r\ngenerates 4-d image sets (xyzt) which can contain 100,000 to 1,000,000 images per experiment. We are\r\ndeveloping a software package called GoFigure to visualize, segment, and analyze these very large image\r\nsets. GoFigure uses a MySQL database back end for managing storage of images and segmented objects\r\nand uses VTK and ITK for visualization and segmentation. We plan to use in toto imaging to digitize the\r\ncomplete expression and subcellular localization patterns of thousands of proteins throughout zebrafish\r\nembryogenesis. This genomic data, our zebrafish lines, and GoFigure will be distributed following the\r\nOpen Data/Open Source model.",
  "authors": [
   {
    "author_fullname": "Gouaillard, Alexandre",
    "author_place": 1,
    "persona_email": "agouaillard@gmail.com",
    "persona_firstname": "Alexandre",
    "persona_id": 322,
    "persona_lastname": "Gouaillard"
   },
   {
    "author_fullname": "Brown, Titus",
    "author_place": 2,
    "persona_id": null
   },
   {
    "author_fullname": "Bronner-Fraser, Marianne",
    "author_place": 3,
    "persona_id": null
   },
   {
    "author_fullname": "Fraser, Scott E.",
    "author_place": 4,
    "persona_id": null
   },
   {
    "author_fullname": "Megason, Sean G.",
    "author_place": 5,
    "persona_id": null
   }
  ],
  "categories": [],
  "comments": [],
  "date_submitted": "2007-07-16T04:51:54Z",
  "handles": [
   {
    "handle": "1926/565",
    "handle_url": "http://hdl.handle.net/1926/565"
   }
  ],
  "identifiers": {
   "doi": null,
   "pubmed": null
  },
  "journals": [
   {
    "journal_id": 3,
    "journal_name": "The Insight Journal"
   }
  ],
  "publication_id": 170,
  "reviews": [
   {
    "author": {
     "author_email": "danielle.pace@kitware.com",
     "author_firstname": "Danielle",
     "author_id": 643,
     "author_lastname": "Pace"
    },
    "content": "<p><strong>Summary:<br /></strong>An image-based approach to systems biology allows both cell lineage trees and quantitative molecular data to be gathered over time and at cellular resolution.&nbsp; This paper describes GoFigure, a software package for the image processing of four-dimensional in toto images with the overall goal of extracting these two types of data.&nbsp; In particular, the development of zebrafish embryos will be studied at the cellular level in order to discover more about the genetic circuits underlying embryogenesis.&nbsp; Although still in progess, once completed this project will be an excellent contribution to the open source community in systems biology, as a very large collection of molecular data (the &quot;Digital Fish&quot;) and GoFigure itself will be released in an open source fashion.<br /><br /><strong>Hypothesis:<br /></strong>The overall hypothesis is that an image-based approach to systems biology yields accurate and reliable molecular and cell lineage data.&nbsp; Although no hard&nbsp;evidence to support this is provided per se, the rationale behind their approach is extensively discussed and in my opinion makes a lot of sense.<br /><br /><strong>Evidence:<br /></strong>1)&nbsp; The advantages of an image-based approach to systems biology over more traditional molecular approaches are clear and convincing.&nbsp; 2) The authors claim that &quot;computers have a notoriously difficult time (spotting cells in microscopic images)&quot; but do not reference previous (presumably unsuccessful attempts) by themselves or others to solve this problem. 3) The authors claim that &quot;we cannot predict how when and where a protein will be expressed, we cannot predict how a protein will fold and function once it is translated, and we cannot predict the interaction between expressed proteins that allow them to form functional genetic circuits&quot; without mentioning previous bioinformatics work on subcellular localization, protein folding and reverse engineering of genetic networks.&nbsp; Although a thorough overview of systems biology is obviously not necessary in this paper, the wording of this part of the introduction would likely make the newcomer falsely think that these problems have never been attempted before. <br /><br /><strong>Open Science:<br /></strong>Although the authors&nbsp;mention that the GoFigure software package and their data will be released in an open-source&nbsp;manner, no code, code documentation, images or data&nbsp;are provided with this submission.<br /><br /><strong>Reproducibility:<br /></strong>I could not reproduce the authors&#39; work because no source code was provided.<br /><br /><strong>Use of Open Source Software:<br /></strong>The authors use VTK and ITK for visualization and segmentation, as well as CMake and CPack.&nbsp; The authors also mention their plans to use a KWStyle GUI and perhaps Qt in the future.<br /><br /><strong>Open Source Contributions:<br /></strong>Once again, no source code is provided in this submission.<br /><br /><strong>Code Quality:<br /></strong>Not applicable.<br /><br /><strong>Applicability to other problems:<br /></strong>Once the authors develop a faster segmentation algorithm, it can presumably be used for segmentation in other large datasets.<br /><br /><strong>Suggestions for future work:<br /></strong>Not sure if this will help, but work&nbsp;by Abolmaesumi and Sirouspour on segmentation in medical images (particularly segmentation of the prostate in ultrasound images) may apply here - their algorithm is fast because it requires no numerical optimization.&nbsp; See &quot;Segmentation of prostate contours from ultrasound images&quot;, Proceedings of the IEEE International Conference on Acoustics, Speech, and Signal Processing 2004, vol 3 pp 517-520, 2004; &quot;Ultrasound image segmentation using an interacting multiple-model probabilistic data association filter&quot;, Proceedings of the SPIE, vol 5370 pp 484-493, 2004; and &quot;An interacting multiple model probabilistic data association filter for cavity boundary extraction from ultrasound images&quot;, IEEE Transactions on Medical Imaging, vol 23(6) pp 772-782, 2004.<br /><br /><strong>Requests for additional information from authors:<br /></strong>1) The authors do not mention how molecular data (such as that from YFPs) is extracted from the in toto images - this presumably involves segmentation as well as further quantification.&nbsp; Has any of this work been done, or does it fall under future work? 2) Neither the segmentation algorithms nor the propagation algorithms used have been described in any detail - I am interested in what has been attempted so far.&nbsp; 3) How is the accuracy of the current segmentation algorithm quantified?&nbsp; The paper says that it is &quot;quite accurate&quot; but I would like to know how this has been determined.&nbsp; Also, the paper mentions that the current segmentation algorithm is slow - how much time does it take?&nbsp; 5)&nbsp; Although the advantages of incorporating use interaction into GoFigure are clear, I wonder how this works in practice.&nbsp; If the number of cells across space and time is as large as it seems to be, how much time does the user have to spend looking for false negatives and false positives?&nbsp; 6) More references on both in toto imaging and imaging for systems biology are needed so that the newcomer can see how this work fits into the rest of the field and how it is unique.<br /><br /><strong>Additional Comments:<br /></strong>1) The writing / English of this paper should be improved, particularly in Section 3.&nbsp; 2) Overall this is an excellent project - I&#39;m sure that plenty of systems biologists will be eager to get their hands on your software and data once it is released.&nbsp; Great work so far!</p><div>Score justification:<br /></div><p>1)&nbsp; (2 points) Does the paper follow the standards of open-science by including the relevant code, data, and parameters needed to replicate the work described in the paper? Can the work be duplicated? How well does the work (when appropriate) build upon (instead of duplicating) existing open-source efforts? </p><p>0 stars (because no code or data was provided in this submission)</p><p>2)&nbsp; (1 point) Does the work address a (knowledge or software-based) need within the community? Where do you see it having the most impact?</p><p>1 star - an open source&nbsp;software package for image-based systems biology is needed so that the difficult image processing work involved is not duplicated by researchers and so that biologists not explicitly trained in computer science can use the package and the associated data in their own work.</p><p>3)&nbsp; (1 point) How well is the work described in the paper? Is sufficient background material provided in the paper itself, or easily located using pointers in the paper? </p><p>1 star - the work is adequately described, and the background material is especially detailed.</p><p>4)&nbsp; (1 point) Can you name one or two research projects that you think would benefit from the use of this work?</p><p>1 star - the data provided by this work could definitely be used by bioinformaticians interested in reverse engineering of genetic networks, both to extract the underlying genetic circuits in zebrafish embryogenesis and as a test dataset to compare various reverse engineering algorithms.</p>",
    "date": "09-10-2007",
    "review_id": 556
   },
   {
    "author": {
     "author_email": "stephen.aylward@kitware.com",
     "author_firstname": "Stephen",
     "author_id": 1,
     "author_lastname": "Aylward"
    },
    "content": "<p><strong>Summary:</strong><br />This paper is an excellent introductory text on the motivations for the field of systems biology and the process of in toto imaging as well as for the software architecture and GUI design for a system for processing 4D microscopy images.</p><p>Systems biology is concerned with imaging and quantifying the interactions between cell behavior and molecular circuits, particularly during embryogenesis.</p><p>In toto imaging in this test is concerned with 3D imaging (confocal microscopy or 2-photon fluorescence microscopy) to track tissue and organ development at the cellular and protein level over time.</p><p>The software and interface must support mosaicing, displaying, segmenting, and editing the segmentations from those massive 4D images.</p><p>The paper represents work-in-progress such that the software is not yet available.</p><p>Response from the author to a previous review shows that the data is available online at:<br /><a href=\\\"%5C%22%5C%22../midas/view_collection.php?collectionid=37%5C%22%5C%22\\\">http://www.insight-journal.org/midas/view_collection.php?collectionid=37</a> </p><p>(With Version 2 of this paper - authors now provide links to data, code, binaries, and more!!!)</p><p><strong>Hypothesis:</strong><br />Cellular segmentation in 4D images is a grand challenge in systems biology and the GoFigure software will help non-computer-scientists generate effective cell segmentations from massive datasets in a timely manner.</p><p> <strong>Evidence:</strong><br />The initial implementation is somewhat limited but lessons were learned and will be addressed in the upcoming release.</p><p>Lessons learned include:</p><p>1) Hand editing tools are needed for when segmentations fail - and segmentations will fail.<br />The GoFigure software provides means for adding and deleting cell segmentations - it is surprising that they do not provide merging and splitting tools for when cell segmentations are inaccurate.</p><p>2) Large data can be effectively handled via tailored views - it is sufficient to provide 2D views that scroll over time or in 3D - there is no need to attempt complex graphical representations of 4D data. </p><p>3) Initial attempt at segmentation was done on 2D images - future versions will be in 3D and possibly in 4D; incorporating heuristics as well as higher dimensional information. 2D image segmentations were inaccurate and time consuming. </p><p><strong>Open Science:</strong><br />The paper is work-in-progress. The paper has not been updated to mention the availability of data, and the software remains unavailable.</p><p>The licensing terms of the software has not been identified. Additionally, it is limited to running on Windows at this time because of the use of MFC.</p><p>The authors are congratulated for making their data freely available. </p><p><strong>Reproducibility:</strong><br />Waiting for code release. Additionally, the paper is written at a higher level - more of an introductory text than a how-to text.<br /> <br /> <strong>Use of Open Source Software:</strong><br />Software uses ITK and VTK.</p><p><br /> <strong>Open Source Contributions:</strong><br />The license for the code is not given.</p><p>The data has been posted using a by-attribution license! </p><p> <strong>Applicability to other problems:</strong><br />This software way be generally applicable when 4D data needs to be quantified. The use of ITK suggests that other segmentations could be incorporated into the software. Also, the backend mysql database for managing images and analysis results should be generally useful. This software could evolve into a very useful toolkit.<br /><br /><strong>Suggestions for future work:</strong><br />1) Release the source</p><p>2) Go cross-platform</p><p>3) Release more data</p><p>4) Ensure mysql can handle the large images (some groups prefer PGSQL for large images).</p><p>5) Provide demonstrations and how-to text</p><p>6) Fix the spelling, grammar, and punctuation in the paper, particularly in the second half of the text. </p>",
    "date": "09-13-2007",
    "review_id": 555
   },
   {
    "author": {
     "author_email": "gaetan.lehmann@gmail.com",
     "author_firstname": "Gaetan",
     "author_id": 328,
     "author_lastname": "Lehmann"
    },
    "content": "<p><strong>Summary:<br /></strong><br />The authors describe the The Digital Fish Project, which involve the in vivo imaging of full Zebra fish embryos using a 2 photon confocal microscope, and the GoFigure software, used to segment the cells and the nuclei, track them over the time, visualize the acquired images, ...<br /> </p><p><strong>Open Science:<br /></strong><br />The paper, the data and the software are licensed with an open source license. </p><p> <br /> <strong>Reproducibility:</strong></p><p>GoFigure is currently usable only on the windows OS, an OS I&#39;m not used to using. I haven&#39;t built the code.&nbsp;</p><p>&nbsp;<strong>Use of Open Source Software:<br /></strong><br />Yes. ITK, VTK and CMake are used. The authors are also planning to use KWWidgets. </p><p> <br /> <strong>Open Source Contributions:<br /></strong><br />Yes. The source code is fully available with subversion. </p><p> <br /> <strong>Code Quality:<br /></strong><br />The code seem well structured and documented (That&#39;s also the Ohoh point of view http://www.ohloh.net/projects/8464?p=GoFigure). </p><p> <br /> <strong>Applicability to other problems:</strong></p><p>In toto imaging is one of the most interesting thing to study the embryogenesis. This software, as well as the biological methods used, will be very useful to study the embryogenesis in other species. We can also imagine using it to study the differenciation of the cells in some particular tissues. </p><p><br /> <strong>Requests for additional information from authors:</strong></p><p>What image format comes from your microscope? It is usualy a bit difficult to read proprietary format of the biggest confocal manufacturers, and if a new reader have been developed, in may be one other good thing to reuse from this project.</p><p> Confocal imaging usually have an extinction of the signal when the depth increase. Don&#39;t you have that phenomenon in your images? If yes, have you leave correct it? How?</p><p>You say the image are noisy. How are you denoising them? </p><p> Finall, you say that &quot;the amount of the expression marker in each cell can then be quantitated&quot;. However, from my own experience, quantitation is very difficult in confocal images, because it is highly dependent of several factors (gain and offset of the detector, transparency of the object and/or the medium, depth extinction, photo blitching, ...). Can you say more about what you want to measure, and how you will do that ?</p><p><strong>Additional Comments:<br /></strong><br />A very promising project - I will follow it closely!</p><p>&nbsp;</p>",
    "date": "09-14-2007",
    "review_id": 571
   },
   {
    "author": {
     "author_email": "richard.beare@ieee.org",
     "author_firstname": "Richard",
     "author_id": 197,
     "author_lastname": "Beare"
    },
    "content": "<p><strong>Summary:</strong><br />This paper is an overview of the Digital Fish Project. There is discussion of plans for automated segmentation work and mention of a framework to support the project, but minimal details. Some data has been made available in response to another reviewer. </p><p> <strong>Open Science:</strong><br />At present there is nothing computational to review, although the paper states that code will be made public. <br /> <br /> <strong>Additional Comments:</strong><br /> </p><p>The project background is really interesting - it is a great example of how computational data analysis tools, such as image analysis, are changing the way in which some life sciences research is carried out. I&#39;d recommend that the paper concentrate on this aspect, with emphasis on the scale and complexity of the problem. If suitable datasets can be made available with this paper then perhaps we will see part of the solution developed by the ITK community. </p> <p>There is minimal technical content in the paper in its current form, with disussion limited to high level concepts - &quot;tracks&quot;, &quot;lineages&quot; etc, and a couple of viewer screenshots. It reads like a marketing piece in places. </p> <p>I&#39;d like to see the tools become cross platform.</p>",
    "date": "09-10-2007",
    "review_id": 557
   },
   {
    "author": {
     "author_email": "holmes.david3@mayo.edu",
     "author_firstname": "David",
     "author_id": 20,
     "author_lastname": "Holmes"
    },
    "content": "<p><strong>Summary:</strong><br />The authors describe the Digital Fish project which involves the acquisition of in toto images of zebrafish and the development of the GoFigure software tools.&nbsp; In toto imaging is detailed along with the purpose of the project.&nbsp;The authors state that the project is an open source project with both the images and data available to other researchers.</p><p><br /><strong>Evidence:</strong><br />The authors provide a clear description of the methods and an introduction to the GoFigure software.&nbsp; While the authors state that the project is Open Source, I was unable to find an licensing information about either the software or data.</p><p><br /><strong>Open Science:</strong><br />The authors purport that the work is open source; however, I was unable to verify this.&nbsp; The software</p><p><br /><strong>Reproducibility:</strong><br />I was unable to evaluate the software or data.&nbsp; There is no reference in the paper to how to obtain the software or data.&nbsp; I was able to find the na-mic wiki page (<a href=\\\"http://wiki.na-mic.org/Wiki/index.php/NA-MIC_NCBC_Collaboration:3D+t_Cells_Lineage:GoFigure\\\">http://wiki.na-mic.org/Wiki/index.php/NA-MIC_NCBC_Collaboration:3D+t_Cells_Lineage:GoFigure</a>) for GoFigure.&nbsp; The software is available, but only in binary form.&nbsp; It sounds like the next version should be completely open.&nbsp; I was unable to find the data.&nbsp; There is a webpage on the CIT website, but it requires a username and password.</p><p><br /><strong>Use of Open Source Software:</strong><br />The&nbsp; next version of the software should be written with the various software tools provided by na-mic.</p><p><br /><strong>Open Source Contributions:</strong><br />If completed and released, this will provide an excellent open platform for analyzing confocal images.&nbsp; The data will be very useful for developing new processing algorithms as well.</p><p><br /><strong>Code Quality:</strong><br />Unable to evaluate.&nbsp; </p><p><br /><strong>Applicability to other problems:</strong><br />As stated above, it will hopefully be applicable to other confocal imaging projects.</p><p><br /><strong>Suggestions for future work:</strong><br />None</p><p><br /><strong>Requests for additional information from authors:</strong><br />No information is currently provided on obtaining either the software or data.&nbsp; There is also no licensing information.&nbsp; The text would benefit, at a minimum, from the reference to the na-mic wiki page.</p><p><br /><strong>Additional Comments:</strong><br />There are several typos in the text, particularly near the end.&nbsp; I suggest that authors edit the text one more time.</p>",
    "date": "09-01-2007",
    "review_id": 542
   }
  ],
  "submitted_by_author": {
   "author_email": "agouaillard@gmail.com",
   "author_firstname": "Alexandre",
   "author_id": 322,
   "author_institution": "Singapore Agency for Science Technology and Research",
   "author_lastname": "Gouaillard"
  },
  "tags": [
   "Cell tracking",
   "confocal imaging",
   "system biology"
  ],
  "title": "GoFigure and The Digital Fish Project: Open tools and open data for an imaging based approach to system biolgy"
 }
}