{
  "publication": {
    "abstract": "The deconvolution, also called deblurring, tries to revert the optical distortion introduced during the aquisition of the image. It is a family of image processing which can be classed in the larger family of image restoration.\nDeconvolution is a very difficult problem, and many algorithms have been proposed to solve it, with different strenght and weakness which may depend on the context where they are used. As a consequence, it is desirable to have several algorithms available when trying to restore some images. The different algorithms are often built on a similar principle, making possible to share a large part of their API in their implementation. Also, the most generic operations related to deconvolution should be reusable in order to avoid code duplication and ease the implementation of new algorithms.\n\nIn this contribution, the infrastructure for the implementation of several deconvolution algorithms is proposed. Based on this infrastructure, twelve simple deconvolution algorithms of reference are also provided.\n",
    "articles": [
      "bafkreigpkyx4psi7sy5gofmikvp3axe77pfq5ayx5kz54cijmy4rv4tlty"
    ],
    "authors": [
      {
        "author_fullname": "Lehmann, Gaëtan",
        "author_place": 1,
        "persona_id": null
      }
    ],
    "categories": [
      "Filtering",
      "Programming"
    ],
    "comments": [],
    "date_submitted": "2010-08-30 04:47:02",
    "handles": [
      {
        "handle": "10380/3207",
        "handle_url": "http://hdl.handle.net/10380/3207"
      }
    ],
    "identifiers": {
      "doi": null,
      "pubmed": null
    },
    "journals": [
      {
        "journal_id": 3,
        "journal_name": "The Insight Journal"
      }
    ],
    "license": "You are licensing your work to Kitware Inc. under the\nCreative Commons Attribution License Version 3.0.\n\nKitware Inc. agrees to the following:\n\nKitware is free\n * to copy, distribute, display, and perform the work\n * to make derivative works\n * to make commercial use of the work\n\nUnder the following conditions:\n\\\"by Attribution\\\" - Kitware must attribute the work in the manner specified by the author or licensor.\n\n * For any reuse or distribution, they must make clear to others the license terms of this work.\n * Any of these conditions can be waived if they get permission from the copyright holder.\n\nYour fair use and other rights are in no way affected by the above.\n\nThis is a human-readable summary of the Legal Code (the full license) available at\nhttp://creativecommons.org/licenses/by/3.0/legalcode",
    "publication_id": 753,
    "reviews": [],
    "submitted_by_author": {
      "author_email": "gaetan.lehmann@gmail.com",
      "author_firstname": "Gaetan",
      "author_fullname": "Lehmann, Gaetan",
      "author_id": 328,
      "author_institution": "INRA",
      "author_lastname": "Lehmann"
    },
    "tags": [
      "fft",
      "deconvolution"
    ],
    "title": "Deconvolution: infrastructure and reference algorithms"
  }
}