{
  "publication": {
    "abstract": "This paper focuses on the role of open-source software in the development of a novel magnetic resonance image (MRI) tissue classification algorithm. Specifically, we describe the of use existing classes in the Insight Segmentation and Registration Toolkit (ITK) and several new classes that were implemented to perform non-parametric density estimation and entropy minimization. These new classes also provide a general framework for nonparametric density estimation and related applications.",
    "articles": [
      "bafkreiervwid5tf6ts2n5xdtevfl2krcs3ce6ctzfx47ajez5uqe6ls6ta"
    ],
    "authors": [
      {
        "author_fullname": "Tasdizen, Tolga",
        "author_place": 1,
        "persona_email": "tolga@sci.utah.edu",
        "persona_firstname": "Tolga",
        "persona_id": 57,
        "persona_lastname": "Tasdizen"
      },
      {
        "author_fullname": "Awate, Suyash",
        "author_place": 2,
        "persona_email": "suyash@cs.utah.edu",
        "persona_firstname": "Suyash",
        "persona_id": 234,
        "persona_lastname": "Awate"
      },
      {
        "author_fullname": "Whitaker, Ross",
        "author_place": 3,
        "persona_id": null
      }
    ],
    "categories": [],
    "comments": [],
    "date_submitted": "2005-08-03T16:33:51Z",
    "journals": [
      {
        "journal_id": 3,
        "journal_name": "The Insight Journal"
      }
    ],
    "license": "You are licensing your work to Kitware Inc. under the\nCreative Commons Attribution License Version 3.0.\n\nKitware Inc. agrees to the following:\n\nKitware is free\n * to copy, distribute, display, and perform the work\n * to make derivative works\n * to make commercial use of the work\n\nUnder the following conditions:\n\\\"by Attribution\\\" - Kitware must attribute the work in the manner specified by the author or licensor.\n\n * For any reuse or distribution, they must make clear to others the license terms of this work.\n * Any of these conditions can be waived if they get permission from the copyright holder.\n\nYour fair use and other rights are in no way affected by the above.\n\nThis is a human-readable summary of the Legal Code (the full license) available at\nhttp://creativecommons.org/licenses/by/3.0/legalcode",
    "publication_id": 24,
    "reviews": [
      {
        "author": {
          "author_email": "ibitter@nih.gov",
          "author_firstname": "Ingmar",
          "author_id": 45,
          "author_lastname": "Bitter"
        },
        "content": "\r\n<b>Summary:</b>\r\nThe paper presents a method to classify voxels in MRI brain images into brain tissue classes. It uses probabilistic brain atlases and non-parametric density estimation and entropy minimization to determine convergence of the classification.\r\n \r\n<b>Hypothesis:</b>\r\nThat the method can classify brain tissues better than other state of the art classification methods.\r\n\r\n<b>Evidence:</b>\r\nThere is no evidence for any of the claims. The reader is referred to a currently unpublished paper for the details on mathematics and experiments and comparisons.\r\n\r\n<b>Open Science:</b>\r\nThe paper states that the code is based on and extents ITK. All new components are (or will be) contributed to ITK. However, the implementation is described as work in progress.\r\nNo input data or result images are available. \r\n\r\n<b>Reproducibility:</b>\r\nReproducing the work is impossible without information on what to reproduce.\r\n\r\n<b>Use of Open Source Software:</b>\r\nThe described software is open source, based on ITK, and the important classes are well described. However, there are no pointers to the complete application discussed in the paper. It seems that I am supposed to build such an application myself from the existing and new ITK classes.\r\n\r\n<b>Open Source Contributions:</b>\r\nI did not evaluate their contribution, nor double checked that the new classes are in the ITK CVS repository.\r\n\r\n<b>Code Quality:</b>\r\nI did not evaluate the code.\r\n\r\n<b>Applicability to other problems:</b>\r\nThe methods appears to be quite general and can easily go beyond brain tissue classification. With few changes it does not even have to be restricted to MRI data.\r\n\r\n<b>Suggestions for future work:</b>\r\nAdd evidence for the capabilities of your method.\r\n\r\n<b>Requests for additional information from authors:</b>\r\n\r\n<b>Additional Comments:</b>\r\nThe references have many capitalization errors in the paper titles.\r\n\r\n<b>Conclusion:</b>\r\nThe described additions to ITK are most likely very valuable, but the paper does not provide any evidence for its performance claims and it therefore not an example of open science. It does address a need in the community (if it really works) and there is some background material and probably other applications that can benefit from this work. \r\n\r\nI'll be happy to change my review if the paper adds the missing evidence and makes it easy to reproduce the results.\r\n",
        "date": "09-08-2005",
        "review_id": 48
      },
      {
        "author": {
          "author_email": "gregory-harris@uiowa.edu",
          "author_firstname": "Greg",
          "author_id": 199,
          "author_lastname": "Harris"
        },
        "content": "<b>Summary:</b>\r\nThe authors propose a (uniform?) map-distortion approach to getting crisp anatomy diagrams for MRI images of an organ whose positional variability with respect to tissue class information is aparently unknown to them. The basal ganglia and perhaps the cerebellum could well be solved this way, but not the cerebral cortex.\r\n \r\n<b>Hypothesis:</b>\r\nThe authors propose the (novel?) hypothesis that tissue segmentation should be contingent on the deformability of a tissue-type probability vector atlas onto the acquisition structural image set; that bias field correction should be iterative and anatomy-based; that a stochastic approach to what sampling of features to use will lead to a convergent labeling of the image set with stable posterior class likelihood images; and that the MRI signal from adjacent voxels constitutes the right pool from which to draw feature samples. In this, the authors' interest in texture-driven \"surface reconstruction\" reported elsewhere appears to be what they have in mind (conjecture).\r\n\r\n<b>Evidence:</b>\r\nThey claim to be evaluating tissue classifications with a \"synthetic data ground truth\" phantom image generation process, but didn't validate the appropriateness of their phantom, either. We didn't even find out if the phantom was based on an MRI scan that classified well.\r\n\r\n<b>Open Science:</b>\r\nThere were no Open Science software submissions with this work-in-progress report.\r\n\r\n<b>Reproducibility:</b>\r\nThe only way to reproduce the work corresponding to this report is to steal their idea and crank out code of our own. However, I already know that prior probability field deformation and bias field estimation are inadequate to solve the problem of classifying the human cerebral cortex volume as to gyri and sulci and as to gray matter wrapped around positionally variable white matter spines.\r\n\r\n<b>Use of Open Source Software:</b>\r\nThe authors dutifully cited their use of ITK, but seemed to miss the point of what someone with experience in brain imaging and already using ITK would want in the way of significant details: knowing that pixel features are stored in an Image class instantiated with a PixelType of [type] Vector is hardly news; instead (in addition?) there should be a discussion of how the kernel size varies from early iterations to late ones: does it go from gross to fine on a schedule? What kind of signal processing filter does this in effect establish, and how does it compare to, say, an edge-preserving filter like itkGradientAnisotropicDiffusionImageFilter?\r\n\r\n<b>Open Source Contributions:</b>\r\nThey provided a flow chart, and said such a scheme is open to user experimentation, but their code has not been released into ITK yet.\r\n\r\n<b>Code Quality:</b>\r\nWe are left to expect they are planning to meet the ITK consortium standards for things added to ITK.\r\n\r\n<b>Applicability to other problems:</b>\r\nThe Parzen method, sorting out worthwhile signal from characterizable error, is general, and suggests considerations of interest to anyone coping with numerically founded map or diagram fitting.\r\n\r\n<b>Suggestions for future work:</b>\r\nStatistical texture is a part of choosing the training classes in the stereotaxic cluster Mahalanobis metric classifier I contributed[1] to brains2, but we found that it was important to have the same prior probabilities for classes everywhere throughout the image. We currently have split bias field correction out as a pre-processing stage (that uses ITK) for our T1-T2 tissue classification workup.\r\n\r\n<b>Requests for additional information from authors:</b>\r\nThe authors propose an implausible kind of measurement feedback based on stability of its outcome. Someone needs to make the case somewhere that MRI tissue classification is a discrete-outcome maximum likelihood kind of probability estimate, rather than a voxel composition fractions kind of probability estimate as histology would suggest.\r\n\r\n<b>Additional Comments:</b>\r\nBrain tissue classification is an important problem, but one that must be distinguished from the more anatomically positional problem of parcellation into the functioning units of the cerebral cortex and its supporting nuclei. An atlas has no business decreeing whether you may see gray matter at each of the anatomical coordinates you have imaged. \r\n\r\n[1] Harris, G., Andreasen, N.C.,Cizadlo, T., Bailey, J.M., Bockholt, H.J., Magnotta, V.A., and Arndt, S. 1999. Improving Tissue Classification in MRI: A Three-Dimensional Multi-Spectral Discriminant Analysis Method With Automated Training Class Selection. Journal of Computer-Assisted Tomography, 23(1), 144-154.\r\n",
        "date": "09-09-2005",
        "review_id": 54
      }
    ],
    "revisions": [
      {
        "article": "bafkreiervwid5tf6ts2n5xdtevfl2krcs3ce6ctzfx47ajez5uqe6ls6ta",
        "dapp": null,
        "dataset": null,
        "doi": null,
        "handle": "/3507",
        "source_code": null,
        "source_code_git_ref": null
      },
      {
        "article": "bafkreiervwid5tf6ts2n5xdtevfl2krcs3ce6ctzfx47ajez5uqe6ls6ta",
        "dapp": null,
        "dataset": null,
        "doi": null,
        "handle": "1926/29",
        "source_code": null,
        "source_code_git_ref": null
      },
      {
        "article": "bafkreiervwid5tf6ts2n5xdtevfl2krcs3ce6ctzfx47ajez5uqe6ls6ta",
        "dapp": null,
        "dataset": null,
        "doi": null,
        "handle": "/3477",
        "source_code": null,
        "source_code_git_ref": null
      }
    ],
    "source_code_git_repo": null,
    "submitted_by_author": {
      "author_email": "tolga@sci.utah.edu",
      "author_firstname": "Tolga",
      "author_fullname": "Tasdizen, Tolga",
      "author_id": 57,
      "author_institution": "University of Utah",
      "author_lastname": "Tasdizen"
    },
    "tags": [
      "MRI segmentation",
      "ITK",
      "MRI tissue classification",
      "Parzen window"
    ],
    "title": "A nonparametric, entropy-minimizing MRI tissue classification algorithm implementation using ITK"
  }
}