{
 "publication": {
  "abstract": "We have successfully created a software environment in which ultrasound data can be manipulated by, ITK (the Insight Tool-Kit), in real-time. We were able to access each frame generated within the resident computer of a TerasonTM Ultrasound Machine, convert it into the ITK image format, and demonstrate the concurrent operation of ITK on the same computer by writing the images to an external hard drive. At a rate of 10 frames per second, 512 by 512 pixel grayscale frames were written by ITK methods to the external hard drive through USB 2.0 while the ultrasound scan was occurring without thrashing or delay in system performance. This simple exercise demonstrates the potential of ITK in processing ultrasound images in real-time in addition to the more traditional off-line processing.",
  "authors": [
   {
    "author_fullname": "Wang, David",
    "author_place": 1,
    "persona_email": "david@wangmd.com",
    "persona_firstname": "David",
    "persona_id": 104,
    "persona_lastname": "Wang"
   },
   {
    "author_fullname": "Chang, Wilson",
    "author_place": 2,
    "persona_id": null
   },
   {
    "author_fullname": "Stetten, George",
    "author_place": 3,
    "persona_email": "email@stetten.com",
    "persona_firstname": "George",
    "persona_id": 111,
    "persona_lastname": "Stetten"
   }
  ],
  "categories": [],
  "comments": [],
  "date_submitted": "2005-08-05T21:07:26Z",
  "handles": [
   {
    "handle": "1926/43",
    "handle_url": "http://hdl.handle.net/1926/43"
   }
  ],
  "identifiers": {
   "doi": null,
   "pubmed": null
  },
  "journals": [
   {
    "journal_id": 3,
    "journal_name": "The Insight Journal"
   }
  ],
  "publication_id": 36,
  "reviews": [
   {
    "author": {
     "author_email": "julien@jomier.com",
     "author_firstname": "Julien",
     "author_id": 3,
     "author_lastname": "Jomier"
    },
    "content": "<b>Summary:</b>\r\nThis paper presents a combination of ITK and an Ultrasound device to perform real-time ultrasound acquisition.\r\n \r\n<b>Hypothesis:</b>\r\nNA\r\n\r\n<b>Evidence:</b>\r\nIt is not clear to me why the authors are testing writing on USB drive for real-time application.\r\nWriting into memory might be more useful.\r\nHowever, the paper is well written and well presented.\r\n\r\n<b>Open Science:</b>\r\nThe authors make use of ITK and provide the source code in the paper.\r\n\r\n<b>Reproducibility:</b>\r\nI did not reproduce the results in the paper: an ultrasound system is needed.\r\n\r\n<b>Use of Open Source Software:</b>\r\nThe authors used the Insight Toolkit (ITK). The other third-party libraries are private.\r\n\r\n<b>Open Source Contributions:</b>\r\nThe source code was provided only as written in the paper.\r\n\r\n<b>Code Quality:</b>\r\nThe code looks good and is using ITK. However this opinion is based only on the code presented on the paper.\r\nMoreover, the code shouldn't be portable since it is using COM object only defined on specific platforms.\r\n\r\n<b>Applicability to other problems:</b>\r\nThe code might be applied to other real-time imaging devices.\r\n\r\n<b>Suggestions for future work:</b>\r\nThe authors should detail the paper more and state the needs in the clinic. What is the lowest refresh rate a clinician wants to see? \r\nTesting ITK speed to read/write onto memory and apply filters for real-time Utrasound would be nice.\r\n\r\n<b>Requests for additional information from authors:</b>\r\nThe paper should state the refresh rate of the US.\r\nThe type of disk (rpms) should be also stated.\r\nThe list of references is short. Some links to the Ultrasound device and related info would be a plus.\r\n\r\n<b>Additional Comments:</b>\r\nThe list of areas in medicine is very long...\r\nSpecifying that COM = Component Object Model would be a plus for those non familiar with Windows design.\r\nThe type of file to be written should be stated in the paper\r\n\r\n",
    "date": "09-15-2005",
    "review_id": 45
   },
   {
    "author": {
     "author_email": "holmes.david3@mayo.edu",
     "author_firstname": "David",
     "author_id": 20,
     "author_lastname": "Holmes"
    },
    "content": "<b>Summary:</b>\r\nThe authors describe the initial effort in capturing ultrasound images from a commercially available US system (Terason, Inc). The effort includes the combination of ITK and a proprietary Windows COM object to extract the image data. \r\n\r\n<b>Hypothesis:</b>\r\nNot Applicable.\r\n\r\n<b>Evidence:</b>\r\nUnclear -- this work appears to just be getting off of the ground.\r\n\r\n<b>Open Science:</b>\r\nDifficult to comment on given that the project appears to just be getting off of the ground.\r\n\r\n<b>Reproducibility:</b>\r\nThe entire code is not available. However, given that the application requires access to specific hardware and proprietary software, the inclusion of code would be for demonstration purposes (which would be valuable).\r\n\r\n\r\n<b>Use of Open Source Software:</b>\r\nIt seems that the authors used OSS as much as possible.\r\n\r\n<b>Open Source Contributions:</b>\r\nRefer to the Reproducibility comments.\r\n\r\n<b>Code Quality:</b>\r\nNot Applicable\r\n\r\n<b>Applicability to other problems:</b>\r\nThis is difficult to asses, so I can only speculate. This may be applicable in a general sense if it provides a framework for other researchers to capture data into ITK processes using standard windows programming methods. It is unclear if there is enough generality. Second, if the hardware is widely used, different researchers may be able to use this to development independant processing methods. \r\n\r\n<b>Suggestions for future work :</b>\r\nThe work must be extended to meet the expectations of the title.\r\n\r\n<b>Requests for additional information from authors :</b>\r\nSee comments below\r\n\r\n<b>Additional Comments:</b>\r\nWhile I can appreciate the need for real-time ultrasound image analysis, I don't think that this paper meets the expectations. There is no image analysis in the paper and the real-time aspects are only touched upon. Instead, the authors describe image data capture and storage. Data capture and storage is challenging. The particular type of storage and file format can dramatically affect the speed of storage. Moreoever, the use of ITK for storage may also entail overhead which would affect performace (although I have not tested this). Also, the need for an intermediate step of OpenGL viewing seems peripheral if the main goal is only storage for offline analysis.\r\n",
    "date": "08-16-2005",
    "review_id": 29
   },
   {
    "author": {
     "author_email": "luis.ibanez@kitware.com",
     "author_firstname": "Luis",
     "author_id": 4,
     "author_lastname": "Ibanez"
    },
    "content": "<b>Summary:</b>\r\nThis paper describes the use of the Open Source software, the Insight Toolkit (ITK), for supporting a real-time system for processing ultrasound images at real-time, about 10 to 20 frames per second.\r\n \r\n\r\n<b>Hypothesis:</b>\r\nThe point of the paper is to demonstrate that Open Source software is efficient enough for processing images at real-time rates, in this particular case at 10 frames per second.\r\n\r\n<b>Evidence:</b>\r\nThe authors developed a system that interfaces with an ultrasound probe (Terason), grabs images by using a clever trick through a copy of an OpenGL texture into memory, and then save the input images into files. The authors experimented by writing to a hard drive and to an external drive connected through a USB 2.0 port. Their observations indicate that 20 frames per second was to high of a rate for the system to sustain, while a rate of 10 frames per second was suitable for saving the images into disk and simultaneously displaying them using OpenGL.\r\n\r\n<b>Open Science:</b>\r\nThe paper does not fully adhere to the practice of Open Science, because the content of the paper cannot be fully reproduced due to two reasons\r\n\r\n<ul> \r\n<li>The work relies on the use of a particular hardware and software, the Terason Ultra-Sound probe.\r\n<li>The source code was not provided\r\n</ul>\r\n\r\nThe paper is still a valuable contribution, since it let other developers know that Open Source is efficient enough for being used in real-time systems.\r\n\r\n\r\n<b>Reproducibility:</b>\r\nThe exact work reported in the paper can not be reproduced by this reviewer due to lack of access to an Ultrasound probe and to the author's source code. However the reviewer could verify the performance claims made in this paper, by running similar processing and checking the time required to write images on disk.\r\n\r\nThis verication was done by using as source code a modification of the example:\r\n\r\n Insight/Examples/IO/ImageReadWrite.cxx\r\n\r\nThe pixel type in this code was changed from \"unsigned short\" to \"unsigned char\".\r\n\r\nIn this file, the try/catch block that invokes the writer->Update() method was put inside a for() loop from 0 to <100, and an itk::TimeProbe was added to Start() before the loop and to Stop() just after the loop. This test was set to write the image in a directory located in an external drive Maxtor \"OneTouch\", 120Gb, connected using a USB 2.0, through a USB hub of four ports. The code was run from a laptop DELL Latitude D810, with a Pentium M 750 at 1.86 GHz, running Windows XP. The code was compiled with Visual Studio .NET 2003, in Release mode.\r\n\r\nThe test used as input image the classical Lena at 512 x 512 from\r\n\r\n http://web.onetel.net.uk/~simonnihal/texcom/lena.html\r\n\r\n\r\nWriting this image 100 times in <b>PNG format</b>, in the USB 2.0 external drive took the following times (in seconds)\r\n\r\nTest 1 = 18.672\r\nTest 2 = 17.718\r\nTest 3 = 17.609\r\nTest 4 = 18.453\r\nTest 5 = 18.015\r\n\r\nThat is an average of 5.52 image per second.\r\n\r\nWhen a <b>JPEG format</b> was used for writing, with the default compression of the JPEG ImageIO writer in ITK , \r\nthe times (in seconds) became:\r\n\r\nTest 1 = 8.734\r\nTest 2 = 8.906\r\nTest 3 = 8.735\r\nTest 4 = 8.531\r\nTest 5 = 9.062\r\n\r\nThat is an average of 11.37 images per second.\r\n\r\nWhen using a <b>MetaImage</b> format, which is composed of a header file and an uncompressed raw binary file,\r\nthe times became:\r\n\r\nTest 1 = 4.406\r\nTest 2 = 5.062\r\nTest 3 = 5.312\r\nTest 4 = 4.859\r\nTest 5 = 5.453\r\n\r\nThat is an average of 19.92 images per second.\r\n\r\n\r\nThe authors do not mention the fileformat used for writing, but the values above indicate that the fileformat used for writing is a critical decision when performace is relevant to the writing process.\r\n\r\nIn any case, the reviewer verified that it is possible to write images of 8bits/pixel and 512 x 512 pixels into an external drive through a \r\nUSB 2.0 connection at rates of 10 to 20 images per second.\r\n\r\n\r\n\r\nWriting in an internal hard hardrive of 60 Gb at 7200 RPM produced the following results, again for writing 100 images:\r\n\r\n<b>PNG format </b> in seconds\r\n\r\nTime 1 = 9.234\r\nTime 2 = 9.718\r\nTime 3 = 9.235\r\nTime 4 = 9.156\r\nTime 5 = 9.125\r\n\r\nThat is an average of 10.76 images per second.\r\n\r\n\r\n<b>JPEG file format</b> in seconds\r\n\r\nTime 1 = 3.750\r\nTime 2 = 3.812\r\nTime 3 = 3.641\r\nTime 4 = 3.625\r\nTime 5 = 3.531\r\n\r\nThat is an average of 27.23 images per second\r\n\r\n\r\n<b>MetaImage Format</b> in seconds\r\n\r\nTime 1 = 1.437\r\nTime 2 = 1.015\r\nTime 3 = 2.734\r\nTime 4 = 1.312\r\nTime 5 = 2.171\r\n\r\nThat is an average of 57.67 images per second, however, note the larger variability on the times.\r\n\r\n\r\n\r\n\r\n<b>Use of Open Source Software:</b>\r\n\r\nThe authors used the Insight Toolkit (ITK) which is an Open Source package for segmentation and registration of medical images.\r\n\r\n\r\n<b>Open Source Contributions:</b>\r\n\r\nThe authors do not provided their source code along with the paper.\r\nOnly code snippets are included in the text of the paper.\r\n\r\n\r\n<b>Code Quality:</b>\r\n\r\nNot applicable.\r\n\r\n\r\n\r\n<b>Applicability to other problems:</b>\r\n\r\nThe experiment perfomed by the authors is relevant in other image modalities. In particular for image guided surgery suported by fluoroscopic images, where having real time feedback is crucial for guiding the actions of the clinician.\r\n\r\n\r\n<b>Suggestions for future work :</b>\r\n\r\nThe main question that comes to mind is how much actual image processing can be performed at the rates of 10 to 20 frames per second. For example, tracking of objects. It is worth to continue profiling different image analysis methods in the context of real-time systems. Such an effort will foster the improvement of the Open Source software available to the community.\r\n\r\n\r\n<b>Requests for additional information from authors :</b>\r\n\r\nPlease let us know what image file format did you use in your experiments.\r\n\r\n\r\n\r\n<b>Additional Comments:</b>\r\n\r\n\r\n",
    "date": "08-10-2005",
    "review_id": 24
   }
  ],
  "submitted_by_author": {
   "author_email": "david@wangmd.com",
   "author_firstname": "David",
   "author_id": 104,
   "author_institution": "University of Pittsburgh",
   "author_lastname": "Wang"
  },
  "tags": [
   "Image Analysis",
   "Real Time",
   "Terasonn",
   "Ultrasound"
  ],
  "title": "Real-Time Ultrasound Image Analysis for the Insight Toolkit"
 }
}