{
  "publication": {
    "abstract": "Segmentation forms the onset for image analysis especially for medical images, making any abnormalities in tissues distinctly visible. Possible application includes the detection of tumor boundary in SPECT, MRI or electron MRI (EMRI). Nevertheless, tumors being heterogeneous pose a great problem when automatic segmentation is attempted to accurately detect the region of interest (ROI). Consequently, it is a challenging task to design an automatic segmentation algorithm without the incorporation of 'a priori' knowledge of an organ being imaged. To meet this challenge, here we propose an intelligence-based approach integrating evolutionary k-means algorithm within multi-resolution framework for feature segmentation with higher accuracy and lower user interaction cost. The approach provides several advantages. First, spherical coordinate transform (SCT) is applied on original RGB data for the identification of variegated coloring as well as for significant computational overhead reduction. Second the translation invariant property of the discrete wavelet frames (DWF) is exploited to define the features, color and texture using chromaticity of LL band and luminance of LH and HL band respectively. Finally, the genetic algorithm based K-means (GKA), which has the ability to learn intelligently the distribution of different tissue types without any prior knowledge, is adopted to cluster the feature space with optimized cluster centers. \nExperimental results of proposed algorithm using multi-modality images such as MRI, SPECT, and EMRI are presented and analyzed in terms of error measures to verify its effectiveness and feasibility for medical applications.",
    "articles": [
      "bafybeiejzxzmmtkf75ldcjxift7dxupvx5phupr6dtql2pfy2iinzdxezi"
    ],
    "authors": [
      {
        "author_fullname": "V, Thavavel",
        "author_place": 1,
        "persona_id": null
      },
      {
        "author_fullname": "J, JafferBasha",
        "author_place": 2,
        "persona_id": null
      }
    ],
    "categories": [
      "Feature extraction",
      "Iterative clustering"
    ],
    "comments": [],
    "date_submitted": "2010-04-07 00:48:34",
    "journals": [
      {
        "journal_id": 31,
        "journal_name": "The MIDAS Journal"
      }
    ],
    "license": "You are licensing your work to Kitware Inc. under the\nCreative Commons Attribution License Version 3.0.\n\nKitware Inc. agrees to the following:\n\nKitware is free\n * to copy, distribute, display, and perform the work\n * to make derivative works\n * to make commercial use of the work\n\nUnder the following conditions:\n\\\"by Attribution\\\" - Kitware must attribute the work in the manner specified by the author or licensor.\n\n * For any reuse or distribution, they must make clear to others the license terms of this work.\n * Any of these conditions can be waived if they get permission from the copyright holder.\n\nYour fair use and other rights are in no way affected by the above.\n\nThis is a human-readable summary of the Legal Code (the full license) available at\nhttp://creativecommons.org/licenses/by/3.0/legalcode",
    "publication_id": 723,
    "reviews": [],
    "revisions": [
      {
        "article": "bafybeiejzxzmmtkf75ldcjxift7dxupvx5phupr6dtql2pfy2iinzdxezi",
        "dapp": null,
        "dataset": null,
        "doi": null,
        "handle": "10380/3160",
        "source_code": null,
        "source_code_git_ref": null
      }
    ],
    "source_code_git_repo": null,
    "submitted_by_author": {
      "author_email": "thavavelmurugesanv@gmail.com",
      "author_firstname": "Thavavel",
      "author_fullname": "Murugesan, Thavavel",
      "author_id": 2528,
      "author_institution": "karunya university",
      "author_lastname": "Murugesan"
    },
    "tags": [
      "Wavelet frames",
      "Spherical coordinate transform",
      "K-means clustering",
      "Genetic algorithm",
      "Wavelet features",
      "Color image segmentation",
      "Medical image segmentation"
    ],
    "title": "An Intelligent cluster-based segmentation using Wavelet Features:Application to Medical Images"
  }
}