{
  "publication": {
    "abstract": "The anisotropic diffusion algorithm has been intensively studied in the past decades, which could be considered as a very efficient image denoising procedure in many biomedical applications. Several authors contributed many clever solutions for diffusion parameters fitting in specific imaging modalities. Furthermore, besides improvements regarding the image denoising quality, one important variable that must be carefully set is the conductance, which regulates the structural edges preservation among the objects presented in the image. The conductance value is strongly dependent on image noise level and an appropriate parameter setting is, usually, difficult to find for different images databases and modalities. Fortunately, thanks to many efforts from the scientific community, a few automatic methods have been proposed in order to set the conductance value automatically. Here, it is presented an ITK class which offers a simple collection of the most common automatic conductance setting approaches in order to assist researchers in image denoising procedures using anisotropic-based filtering methods (such as well described in the AnisotropicDiffusionFunction class).",
    "articles": [
      "bafybeighxsb3dbfd4mbfnzddyuc6futj255x4mzngx2sckxyuavg5tb5wu"
    ],
    "authors": [
      {
        "author_fullname": "Senra Filho, Antonio Carlos",
        "author_place": 1,
        "persona_email": "acsenrafilho@gmail.com",
        "persona_firstname": "Antonio Carlos da Silva",
        "persona_id": 9445,
        "persona_lastname": "Senra Filho"
      }
    ],
    "categories": [
      "Anisotropic blurring filters",
      "Edge Detection"
    ],
    "comments": [],
    "date_submitted": "2017-05-03 13:59:07",
    "journals": [
      {
        "journal_id": 3,
        "journal_name": "The Insight Journal"
      }
    ],
    "license": "You are licensing your work to Kitware Inc. under the\nCreative Commons Attribution License Version 3.0.\n\nKitware Inc. agrees to the following:\n\nKitware is free\n * to copy, distribute, display, and perform the work\n * to make derivative works\n * to make commercial use of the work\n\nUnder the following conditions:\n\\\"by Attribution\\\" - Kitware must attribute the work in the manner specified by the author or licensor.\n\n * For any reuse or distribution, they must make clear to others the license terms of this work.\n * Any of these conditions can be waived if they get permission from the copyright holder.\n\nYour fair use and other rights are in no way affected by the above.\n\nThis is a human-readable summary of the Legal Code (the full license) available at\nhttp://creativecommons.org/licenses/by/3.0/legalcode",
    "publication_id": 983,
    "reviews": [],
    "revisions": [
      {
        "article": "bafybeighxsb3dbfd4mbfnzddyuc6futj255x4mzngx2sckxyuavg5tb5wu",
        "dapp": null,
        "dataset": null,
        "doi": null,
        "handle": "10380/3572",
        "source_code": null,
        "source_code_git_ref": null
      }
    ],
    "source_code_git_repo": null,
    "submitted_by_author": {
      "author_email": "acsenrafilho@gmail.com",
      "author_firstname": "Antonio Carlos da Silva",
      "author_fullname": "Senra Filho, Antonio Carlos da Silva",
      "author_id": 9445,
      "author_institution": "University of Sao Paulo",
      "author_lastname": "Senra Filho"
    },
    "tags": [
      "Anisotropic Diffusion",
      "Image Filtering",
      "Conductance"
    ],
    "title": "Automatic Conductance Estimation Methods for Anisotropic Diffusion ITK Filters"
  }
}