{
 "publication": {
  "abstract": "Inactivation of the retinoblastoma gene in mouse embryos results\r\nin morphological changes in the placenta, which has been shown to\r\naffect fetal survivability. The construction of a 3D virtual\r\nplacenta aids in accurately quantifying structural changes using\r\nimage analysis. The placenta dataset consisted of 786 images\r\ntotaling 550 GB in size, which were registered into a volumetric\r\ndataset using ITK's registration framework. The registration\r\nprocess faces many challenges arising from the large image sizes,\r\ndamages during sectioning, staining gradients both within and\r\nacross sections, and background noise leading to local solutions.\r\nIn this work, we implement a rigorous ITK-based preprocessing\r\npipeline for removing noise and employ a novel 2-level\r\noptimization strategy for enhanced registration in ITK. We provide\r\n3D visualizations and numerical results to demonstrate our\r\nimprovements.",
  "authors": [
   {
    "author_fullname": "Mosaliganti, Kishore",
    "author_place": 1,
    "persona_email": "kishoreraom@gmail.com",
    "persona_firstname": "Kishore",
    "persona_id": 981,
    "persona_lastname": "Mosaliganti"
   },
   {
    "author_fullname": "Pan, Tony",
    "author_place": 2,
    "persona_id": null
   },
   {
    "author_fullname": "Machiraju, Raghu",
    "author_place": 3,
    "persona_email": "raghu.machiraju@gmail.com",
    "persona_firstname": "raghu",
    "persona_id": 595,
    "persona_lastname": "machiraju"
   },
   {
    "author_fullname": "Huang, Kun",
    "author_place": 4,
    "persona_id": null
   },
   {
    "author_fullname": "Saltz, Joel",
    "author_place": 5,
    "persona_id": null
   }
  ],
  "categories": [],
  "comments": [],
  "date_submitted": "2005-08-01T21:50:01Z",
  "handles": [
   {
    "handle": "1926/23",
    "handle_url": "http://hdl.handle.net/1926/23"
   },
   {
    "handle": "/3347",
    "handle_url": "http://hdl.handle.net//3347"
   }
  ],
  "identifiers": {
   "doi": null,
   "pubmed": null
  },
  "journals": [
   {
    "journal_id": 3,
    "journal_name": "The Insight Journal"
   }
  ],
  "publication_id": 19,
  "reviews": [
   {
    "author": {
     "author_email": "luis.ibanez@kitware.com",
     "author_firstname": "Luis",
     "author_id": 4,
     "author_lastname": "Ibanez"
    },
    "content": "<b>Summary:</b>\r\nThis paper describes a methodology for registering the successive microscopy slices of a mouse placenta using the author\\\\\\'s modified version of the ITK registration framework.\r\n \r\n<b>Hypothesis:</b>\r\nThe authors suggest that the characterization of placenta morphology can be used for correlating genetic changes with phenotypic variation. The characterization of morphology is intended to be done after reconstructing a 3D model of the placenta via registration of a full microscopy sectioning of a mouse placenta.\r\n\r\n<b>Evidence:</b>\r\nThe authors provide multiple examples of the images at the various stages of the registration process, and describe many of the details of their registration approach. Unfortunately, the authors do not provide the source code used for their study, nor the images that could be used for replicating their work. \r\n\r\n<b>Open Science:</b>\r\nThe paper do not satisfy the requirements of Open Science, since it doesnt enable the reader to repeat and replicate the work reported by the authors. The lack of source code and images makes impossible for a reader to replicate the work of the authors. However the paper provide useful advice regarding that image registration methodology that was used by the authors for performing the alignment of the microscopy images.\r\n\r\n<b>Reproducibility:</b>\r\nThe work cannot be reproduced due to the lack of source code and images.\r\n\r\n<b>Use of Open Source Software:</b>\r\nThe authors made extensive use of the Insight Toolkit, and modified some of the components in the Registration Framework, in order to suite the particular characteristics of their image registration problem. Unfortunately the source code of such modification is not being shared, so authors that are interested in using a similar approach will have to re-implement the source code for that methodology.\r\n\r\n<b>Open Source Contributions:</b>\r\nSource code was not provided\r\n\r\n<b>Code Quality:</b>\r\nSource code was not provided\r\n\r\n<b>Applicability to other problems:</b>\r\nThe authors introduced the interesting concept of a two level optimization scheme where the parameters of the optimizer are set differently at the beggining and at the end of the registration process. This concept seems to be applicable to many if not all of the typical image regsitration problems. It would be interesting to implement this concept into auxiliary classes and to make them available to the community as part of the Insight Toolkit.\r\n\r\n<b>Suggestions for future work:</b>\r\nSince the final goal of the authors is to characterize the morphology of the surface of the placenta, it may be interesting to use registration methods that will focus on aligning the boundaries of the placenta. Among the possible options, the authors may want to consider the use of Image metrics that operate on the gradient magnitude of the images, or on the result of edge-detection algorithms such as Canny. The use of PointSet to image registration may also be appropriate for focusing the registration process on aliging the surface of the placenta.\r\n\r\n<b>Requests for additional information from authors:</b>\r\nIt will be quite useful for readers if the authors share their source code and their image data.\r\n\r\n<b>Additional Comments:</b>\r\nThe description of the authors reveals that they have dedicated a significant amount of time to this problem. It is unfortunate that readers involved in similar fields would have to reimplement the work reported by the authors due to the lack of source code sharing.\r\n\r\n",
    "date": "09-18-2005",
    "review_id": 103
   },
   {
    "author": {
     "author_email": "holmes.david3@mayo.edu",
     "author_firstname": "David",
     "author_id": 20,
     "author_lastname": "Holmes"
    },
    "content": "<b>Summary:</b>\r\nThe authors have a large volume serial histology registration problem to address. Like many others, they preprocess the data and register it. The purpose of this paper is not to validate the technique (because there is not enough data or gold standards), but to describe the workflow\r\n \r\n<b>Hypothesis:</b>\r\nImplicit hypothesis that there is a workflow (which happens to use ITK) that can process and register these histologic sections\r\n\r\n<b>Evidence:</b>\r\nThe authors describe the method; however, there is no code and data so there is no real evidence.\r\n\r\n<b>Open Science:</b>\r\nThe authors state that they use ITK for their processing (they don't state what they use for visualization). There is no code for the two algorithms (processing and registration); however, the registration approach is the basic approach described in all of the ITK documentation. There is not much to contribute back to the open science community because it appears to be a straightforward application of the API. Possibly if the tissue detection algorithm was new, it could be plugged back into the API.\r\n\r\n<b>Reproducibility:</b>\r\nSorry, there is no code. Equally important, there is no data. You would need both for reproducibility. Also, specific parameters for processing would have to be included as well.\r\n\r\n<b>Use of Open Source Software:</b>\r\nThey used ITK\r\n\r\n<b>Open Source Contributions:</b>\r\nNope\r\n\r\n<b>Code Quality:</b>\r\nN/A\r\n\r\n<b>Applicability to other problems:</b>\r\nWell, the area of research is important because histologic registration is really needed.\r\n\r\n<b>Suggestions for future work:</b>\r\nMore validation\r\n\r\n<b>Requests for additional information from authors:</b>\r\nI am pleased to see ITK being used for this type of application. It is an important area which the authors are contributing.\r\n\r\nI have several comments for the authors' consideration:\r\n\r\n(1) Your use of figure is not particularly good. Figure 1 combines two completely different thoughts into one image. Several of the figures (including the left side of Figure 3) are not specificaly referenced in the paper. They should be so a reader can go back and forth.\r\n\r\n(2) It appears that some of the pre-processing algorithm has been previously published. I appreciate the fact that your reference that while still giving some of the details. The rest probably needs validation or comparision to other methods. Also, I notice that Figure 2 suggests that you downsample the data. That is not mentioned in the text, but is really important because it has implications for the results.\r\n\r\n(3) I like the MI approach that ITK uses. I think that multiple start points is also a good ideal; however, I wouldn't call this a novel idea. It is common to have more than one registration performed with different initial conditions or perturbations.\r\n\r\n(4) For this journal (although not all journals), it is really important to have the code and data for independant validation and testing.\r\n\r\n<b>Additional Comments:</b>\r\n[This is a free-form field]\r\n\r\n",
    "date": "09-15-2005",
    "review_id": 75
   }
  ],
  "submitted_by_author": {
   "author_email": "kishoreraom@gmail.com",
   "author_firstname": "Kishore",
   "author_id": 981,
   "author_institution": "Harvard Medical School",
   "author_lastname": "Mosaliganti"
  },
  "tags": [
   "Mutual Information",
   "Registration",
   "Light Microscopy",
   "Optimization strategy"
  ],
  "title": "ITK-based Registration of Large Images from Light Microscopy: A Biomedical Application"
 }
}