{
  "publication": {
    "abstract": "In this work, \r\nwe extend a previously demonstrated entropy based groupwise registration method\r\nto include a non-rigid deformation model based on B-splines. \r\nWe describe an open source implementation of the groupwise registration algorithm \r\nusing the Insight Toolkit ITK.\r\nWe provide the source code, parameters, input and\r\noutput data that we used for validation.\r\n\r\n\r\nWe describe an efficient implementation of the algorithm \r\nby using a stochastic optimization scheme embedded in a multi-resolution setting.\r\nThe objective function is optimized using gradient descent algorithm combined\r\nwith line search for the step size.\r\nThe derivative of the objective function is evaluated efficiently by computing Jacobian of \r\nB-spline deformation field locally.\r\n\r\n\r\nWe demonstrate the algorithm in application to different imaging modalities\r\nincluding proton density, FA, T1 and T2 MR images. \r\nWe validate the algorithm on synthetic datasets varying from 2 to 30 images\r\nby recovering randomly applied affine and B-spline transforms.",
    "articles": [
      "bafkreifyws2gckwozlqp2x23neg6u63h6efqnqswhyhpdltecurl3wey7m",
      "bafkreifyws2gckwozlqp2x23neg6u63h6efqnqswhyhpdltecurl3wey7m",
      "bafkreifxjvkowe2oqu5e7t2jrxa3ujqlnf2s6lvpt2khh5oel7jwd42gni",
      "bafkreifyws2gckwozlqp2x23neg6u63h6efqnqswhyhpdltecurl3wey7m"
    ],
    "authors": [
      {
        "author_fullname": "Balci, Serdar K.",
        "author_place": 1,
        "persona_email": "serdar@csail.mit.edu",
        "persona_firstname": "Serdar",
        "persona_id": 622,
        "persona_lastname": "Balci"
      },
      {
        "author_fullname": "Golland, Polina",
        "author_place": 2,
        "persona_id": null
      },
      {
        "author_fullname": "Wells, William M.",
        "author_place": 3,
        "persona_email": "sw@csail.mit.edu",
        "persona_firstname": "William",
        "persona_id": 219,
        "persona_lastname": "Wells"
      }
    ],
    "categories": [
      "Deformable registration",
      "Generic Programming",
      "Groupwise registration",
      "Image pyramids",
      "Parallelization, SMP",
      "Programming",
      "Registration",
      "Registration metrics",
      "Registration optimizers",
      "Transforms"
    ],
    "comments": [
      {
        "content": "Hello Mr. Serdar Balci my name is Christian and I am so interested in your implementation I read about B-spline deformation but I try to use in 2D-3D registration process using a ray casting. So I would like to extend your work and I would like to talk about this more with you if it is possible.\r\n\r\nRegardss Mr. Serdar Balci.",
        "date": "2019-01-02T13:51:32",
        "persona_email": "csucav@unsa.edu.pe",
        "persona_firstname": "Christian",
        "persona_id": 11615,
        "persona_lastname": "Suca velando"
      },
      {
        "content": "hi,I\\'ve tried to complile and run this program with vs2008 and ITK  ，but i encountered some problems:\r\n  1) when i tried to match the affine data created by CreateImagesetAffine,i\\'ve got an exception as follows:\r\nFile：..\\\\..\\\\..\\\\ITK\\\\Code\\\\Common\\\\ItkMultithreader.cxx\r\nLine:475\r\nitk::ERROR: MultiThreader<00f62ae0>:Exception occurred during SingleMethodExcute.\r\nitk::ERROR:   UnivariateEntropyMultiImageMetric.txx :238\r\nitk::ERROR:  UnivariateEntropyMultiImageMetric<00f62910>: too many samples mapped outside the moving buffer.\r\n\r\n2)while after i run the ComputeoutPuts.exe，debug error occured:  \r\n this application has requested the runtime to terminate it in an unusual way .please contact the support team for more informaiton.\r\n\r\nbesides,after i choose to terminate this ,i find if i chose to use B-spline to do registration,only affine file and outputimage can be found,the output files related with the b-spline-grid can not be found.I need your help  urgently...expecting your answer and help....thank you for all your help... ",
        "date": "2013-07-09T21:15:30",
        "persona_email": "cdwangjiang@126.com",
        "persona_firstname": "Wang",
        "persona_id": 8067,
        "persona_lastname": "Jiang"
      }
    ],
    "date_submitted": "2007-07-17T18:44:11Z",
    "journals": [
      {
        "journal_id": 3,
        "journal_name": "The Insight Journal"
      }
    ],
    "license": "You are licensing your work to Kitware Inc. under the\nCreative Commons Attribution License Version 3.0.\n\nKitware Inc. agrees to the following:\n\nKitware is free\n * to copy, distribute, display, and perform the work\n * to make derivative works\n * to make commercial use of the work\n\nUnder the following conditions:\n\\\"by Attribution\\\" - Kitware must attribute the work in the manner specified by the author or licensor.\n\n * For any reuse or distribution, they must make clear to others the license terms of this work.\n * Any of these conditions can be waived if they get permission from the copyright holder.\n\nYour fair use and other rights are in no way affected by the above.\n\nThis is a human-readable summary of the Legal Code (the full license) available at\nhttp://creativecommons.org/licenses/by/3.0/legalcode",
    "publication_id": 173,
    "reviews": [
      {
        "author": {
          "author_email": "mmattar.cs@gmail.com",
          "author_firstname": "Marwan",
          "author_id": 681,
          "author_lastname": "Mattar"
        },
        "content": "Overall Review:<br />The algorithm implemented through this paper is of great utility to the medical imaging community. It is implemented in ITK, which means that it will be accessible to a very large user base. A great amount of effort was placed to provide an efficient implementation of the algorithm along with two different transformation models. Their experimental results, while limited, provide sufficient evidence for the correctness of their implementation.<br /><br />Summary: <br />This paper experiments with a new transformation model based on B-splines for an existing joint alignment algorithm. Using the Jacobian of the deformation field within a stochastic optimization framework (in a multi-resolution setting) an efficient implementation of this algorithm is derived. The authors provide an open source implementation of the algorithm and their transformations using ITK. They provide basic experimental results on synthetic data to validate the correctness of their implementation and the similarity in results between affine registration and B-spline registration. <br /><br />Hypothesis: <br />B-splines have not yet been tested as a deformation model within existing Groupwise Registration algorithms. The implicit hypothesis in this work is that the use of B-splines is advantageous, at least for the type of data tested here. <br /><br />However, the major contribution of this work is providing an efficient open source implementation of the Groupwise Registration algorithm that can be used with either affine transformations or B-spline based transformations. <br /><br />Evidence: <br />The authors did not explicitly state that B-spline registration is better or worse than affine registration. No direct, quantitative analysis was performed to show which type of registration worked better. Visually, the results are very similar and it is not clear if B-spline registration provides any advantages over affine registration. Also, the experimental results are somewhat weak since they are based on synthetic data. Especially since the synthetic volumes are created by randomly transforming the same original volume. <br /><br />However, their results do confirm that their implementation of the algorithm using either transformation model is correct. In all 4 experiments, the algorithm produced significantly sharper mean images and an almost black STD image. <br /><br />I disagree that a black STD image is sufficient evidence for a perfect registration (as stated in page 7). One needs to also compare the mean image to the original image used before any random transformations were applied. That way we can ensure that the algorithm is not creating data. The extreme case is if the algorithm changed all the images to purely white, then the STD image will be black but the mean image will be far from reality. <br /><br />Open Science: &nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;<br />This paper adheres strongly to the concept of open science. The authors provide an open source implementation of the algorithm and do a good job at describing it. They also provide all experiment parameters and the data used for their experiments. The experiments can easily be replicated by following the steps in Section 5 of the paper. <br /><br />Reproducibility: <br />I downloaded and viewed the provided code but did not attempt to compile it. By viewing the code and my basic understanding of ITK it seems as though one can reproduce the results by simply installing the necessary packages and running a provided script (as outlined in Section 5).<br />&nbsp;<br />Use of Open Source Software: <br />The authors used ITK to implement their algorithm. They did not provide any specific information regarding ITK with respect to its advantages, disadvantages or hints for users. However, ITK is a widely used open source package for registration, I am not sure that such information was necessary. Of course any important information specific to the classes they implemented might have been worth mentioning.<br />&nbsp;<br />Open Source Contributions: <br />The authors provide their code along with a helpful description on how to use it. Since it was implemented using ITK it is in usable form. I have not attempted to use it.<br />&nbsp;<br />Code Quality: <br />Their code is easy to read and since it was implemented with ITK, they followed all the guidelines and good code design enforced by ITK. <br />&nbsp;<br />Applicability to other problems: <br />Groupwise image registration is a very important problem in medical imaging. A large number of researchers will find this implementation of great value.<br /><br />Suggestions for future work: <br /><br />1.&nbsp;&nbsp; &nbsp; More extensive experiments using real data<br />2.&nbsp;&nbsp; &nbsp; A study to compare B-spline registration to affine registration<br />3.&nbsp;&nbsp; &nbsp; Provide run time information for the experiments<br />&nbsp;<br />Requests for additional information from authors: <br />None.<br />&nbsp;<br />Additional Comments: <br />The authors did not give a reason for extending previous work to include B-spline registration. It is not clear from their results if B-spline registration is better or even faster than affine registration. Filling in these gaps would make the paper much more complete.<br />",
        "date": "09-11-2007",
        "review_id": 558
      },
      {
        "author": {
          "author_email": "tomash.kazmar@seznam.cz",
          "author_firstname": "Tomas",
          "author_id": 762,
          "author_lastname": "Kazmar"
        },
        "content": "<strong>Summary:</strong><br />This entry deals with groupwise registration, that is a registration of multiple images at once without explicit reference frame.<br /><br /><strong><span>Hypothesis:</span></strong><br />Groupwise registration can be efficiently extended by B-spline deformable transform.<br /><br /><strong><span>Evidence:</span></strong><br />The authors provide output of the algorithm, that is test images before and after registration along with mean and standard deviation images. Sharper mean images and zero standard deviation images are interpreted as successful alignment.<br /><br /><strong><span>Open Science:</span></strong><br />Source code as well as input images are provided in the entry. Images used in the paper are not included, although one can expect these are selected from the input images as a result of the included tests. All the details needed to understand the algorithm are contained in the paper.<br /><br /><strong><span>Reproducibility:</span></strong><br />Downloaded, compile and run the tests was a matter of minutes. I did not verify if the results are the same as the tests with 3D volumes are more time expensive than I presumed.<br /><strong><br /><span>Use of Open Source Software:</span></strong><br />Only the Insight toolkit is used.<br /><br /><strong><span>Open Source Contributions:</span></strong><br />Provided source code is clearly described in the appendix to the article and accompanied by numerous tests.<br /><br /><strong><span>Code Quality:</span></strong><br />Source code is properly commented, cleanly divided into separate classes. It is possible to use it without any problem with current ITK, as far as I can tell the code does not involve any non-portable mechanism.<br /><br /><strong><span>Applicability to other problems:</span></strong><br />There are many problems that can benefit from a deformable groupwise registration, specifically where there is a need to bring a set of images into alignment without choosing a pivot/reference frame coordinate system.<br /><br /><strong><span>Suggestions for future work:</span></strong><br />Test the algorithm not only with volume data with synthetic deformations but also test alignment of 2D image sets and non-synthetic deformations.<br /><br /><strong><span>Requests for additional information from authors:</span></strong><br />Script that produces the output images used in the paper should be added.<br /><br /><strong><span>Additional Comments:</span></strong><br />Although B-splines transform used is have been optimized still the speed is not quick,<br />it takes over a minute to align two exactly identical 480x480 images(?).<br /><br />I encountered a bug worth patching, GroupwiseRegistration executable causes memory<br />corruption when registration-&gt;GetLastTransformParameters() is called after resetting the<br />length of parameters array registration-&gt;SetTransformParametersLength(int), this call<br />should be moved to line 1123, after using the old transform parameters.",
        "date": "01-30-2008",
        "review_id": 638
      }
    ],
    "revisions": [
      {
        "article": "bafybeie5c7sfln3jo3dpgf2zfeha5e4c5xvwuwwbyieltjyhuexgy6cx6u",
        "citation_list": [
          {
            "doi": "10.1109/isbi.2004.1398686",
            "key": "ref1",
            "score": 109.68654,
            "unstructured": "Consistent groupwise non-rigid registration for atlas construction+In IEEE ISBI+2004+2+2+2+K K Bhatia+J V Hajnal+B K Puri+A D Edwards+D Rueckert"
          },
          {
            "doi": "10.1259/bjr/25329214",
            "key": "ref2",
            "score": 83.46325,
            "unstructured": "Non-rigid image registration: Theory and practice+The British Journal of Radiology+77+140+153+2004+W R Crum+T Hartkens+D L G"
          },
          {
            "key": "ref3",
            "score": 47.365776,
            "unstructured": "1973+2+1+R.O. Duda+P.E. Hart. Pattern Classification+Scene Analysis"
          },
          {
            "key": "ref4",
            "score": 23.805683,
            "unstructured": "first edition+2003+L. Ibanez+W. Schroeder+L. Ng+J. Cates"
          },
          {
            "doi": "10.1016/j.neuroimage.2004.07.068",
            "key": "ref5",
            "score": 108.30368,
            "unstructured": "Unbiased diffeomorphic atlas construction for computational anatomy+NeuroImage+3+1+160+2004+S Joshi+Matthieu Jomier+Guido Gerig"
          },
          {
            "doi": "10.1007/11784012_19",
            "key": "ref6",
            "score": 80.74025,
            "unstructured": "A comparison of acceleration techniques for nonrigid medical image registration+In WBIR+1+159+2006+3+Stefan Klein+Josien P.W. Pluim"
          },
          {
            "doi": "10.1109/cvpr.2000.855856",
            "key": "ref7",
            "score": 102.066444,
            "unstructured": "Learning from one example through shared densities on transforms+In IEEE CVPR+2+471+2000+1+E. Miller+N. Matsakis+P. Viola"
          },
          {
            "doi": "10.1109/42.796284",
            "key": "ref8",
            "score": 77.01957,
            "unstructured": "Nonrigid registration using free-form deformations: Application to breast mr images+IEEE TMI+2+2+128+2003+D. Rueckert"
          },
          {
            "doi": "10.1016/s0262-8856(00)00055-x",
            "key": "ref9",
            "score": 91.31336,
            "unstructured": "The role of image registration in brain mapping+Image and Vision Computing+19+3+24+2001+A Toga+P Thompson"
          },
          {
            "doi": "10.1016/s0262-8856(03)00137-9",
            "key": "ref10",
            "score": 94.89868,
            "unstructured": "Image registration methods: A survey+Image and Vision Computing+21+977+1000+2003+Barbara Zitova+Jan Flusser"
          },
          {
            "doi": "10.1007/11569541_30",
            "key": "ref11",
            "score": 67.48865,
            "unstructured": "Efficient population registration of 3d data. In Computer Vision for Biomedical Image Applications+2+301+2005+1+Lilla Zollei"
          }
        ],
        "dapp": null,
        "dataset": null,
        "doi": null,
        "handle": "1926/568",
        "source_code": "bafybeiczycvqdwtnvj4ogwr5xeimpa5eppcijl5zfv35dxyzwqqdi5o55m",
        "source_code_git_ref": null
      }
    ],
    "source_code_git_repo": null,
    "submitted_by_author": {
      "author_email": "serdar@csail.mit.edu",
      "author_firstname": "Serdar",
      "author_fullname": "Balci, Serdar",
      "author_id": 622,
      "author_institution": "MIT CSAIL",
      "author_lastname": "Balci"
    },
    "tags": [
      "groupwise registration",
      "non-rigid registration"
    ],
    "title": "Non-rigid Groupwise Registration using B-Spline Deformation Model"
  }
}