{
  "publication": {
    "abstract": "This paper describes the implementation of the LDFFD and TDFFD algorithms. Both quantify motion and deformation from an input image sequence by taking profit of the temporal dimension of velocity fields in the diffeomorphic registration framework to process the input image sequence as a single 3D+t object. The rationale behind these approaches is to formulate motion estimation in an image sequence as a multi-channel registration problem. This paper describes our implementation, currently following the original ITK registration framework without multi-threading and diffeomorphic registration framework.\nMigration to ITKv4 will be addressed in future work. We also provide code for computing strain on a segmentation represented as a VTK polydata mesh. Program usages for LDFFD and TDFFD as well as strain quantification results are given for one 3D ultrasound image sequence acquired on a healthy volunteer.",
    "articles": [
      "bafybeianagg4wcgylx4mvjvdwwvtrmy4oqmrhp6yl65blvan4vyq54k3fq"
    ],
    "authors": [
      {
        "author_fullname": "De Craene, Mathieu",
        "author_place": 1,
        "persona_email": "decraene@gmail.com",
        "persona_firstname": "Mathieu ",
        "persona_id": 5877,
        "persona_lastname": "De craene"
      },
      {
        "author_fullname": "Piella, Gemma",
        "author_place": 2,
        "persona_id": null
      }
    ],
    "categories": [
      "Registration metrics",
      "Transforms"
    ],
    "comments": [],
    "date_submitted": "2012-03-09 04:39:30",
    "journals": [
      {
        "journal_id": 3,
        "journal_name": "The Insight Journal"
      }
    ],
    "license": "You are licensing your work to Kitware Inc. under the\nCreative Commons Attribution License Version 3.0.\n\nKitware Inc. agrees to the following:\n\nKitware is free\n * to copy, distribute, display, and perform the work\n * to make derivative works\n * to make commercial use of the work\n\nUnder the following conditions:\n\\\"by Attribution\\\" - Kitware must attribute the work in the manner specified by the author or licensor.\n\n * For any reuse or distribution, they must make clear to others the license terms of this work.\n * Any of these conditions can be waived if they get permission from the copyright holder.\n\nYour fair use and other rights are in no way affected by the above.\n\nThis is a human-readable summary of the Legal Code (the full license) available at\nhttp://creativecommons.org/licenses/by/3.0/legalcode",
    "publication_id": 855,
    "reviews": [],
    "revisions": [
      {
        "article": "bafybeianagg4wcgylx4mvjvdwwvtrmy4oqmrhp6yl65blvan4vyq54k3fq",
        "dapp": null,
        "dataset": null,
        "doi": null,
        "handle": "10380/3345",
        "source_code": null,
        "source_code_git_ref": null
      }
    ],
    "source_code_git_repo": null,
    "submitted_by_author": {
      "author_email": "decraene@gmail.com",
      "author_firstname": "Mathieu ",
      "author_fullname": "De craene, Mathieu ",
      "author_id": 5877,
      "author_institution": "Universitat Pompeu Fabra",
      "author_lastname": "De craene"
    },
    "tags": [
      "temporal",
      "diffeomorphism"
    ],
    "title": "An implementation of TDFFD and LDFFD algorithms"
  }
}