{
  "publication": {
    "abstract": "This document describes the process used in implementing image segmentation through a region growing algorithm with the use of the Insight Toolkit (ITK) imaging program. The code used to implement the region growing algorithm is documented in the ITK Software Guide and makes use of the ITK library. This paper is accompanied with all source code, input data, parameters and output data that were originally used in developing the image segmentation application, except where prior laws or agreements prohibit redistribution of such material. The only data subject to not being redistributable was the input file used for testing which was a brain dataset from Kitware’s MIDAS collection named Normal090-T2.mha. The rest of this scientific publication is written in a manner such that it facilitates reproducibility of the reported results.",
    "authors": [
      {
        "author_fullname": "Lajara, Julio",
        "author_place": 1,
        "persona_email": "lajarj@rpi.edu",
        "persona_firstname": "Julio",
        "persona_id": 714,
        "persona_lastname": "Lajara"
      }
    ],
    "categories": [],
    "comments": [],
    "date_submitted": "2007-10-19T03:45:48Z",
    "journals": [
      {
        "journal_id": 3,
        "journal_name": "The Insight Journal"
      }
    ],
    "license": "You are licensing your work to Kitware Inc. under the\nCreative Commons Attribution License Version 3.0.\n\nKitware Inc. agrees to the following:\n\nKitware is free\n * to copy, distribute, display, and perform the work\n * to make derivative works\n * to make commercial use of the work\n\nUnder the following conditions:\n\\\"by Attribution\\\" - Kitware must attribute the work in the manner specified by the author or licensor.\n\n * For any reuse or distribution, they must make clear to others the license terms of this work.\n * Any of these conditions can be waived if they get permission from the copyright holder.\n\nYour fair use and other rights are in no way affected by the above.\n\nThis is a human-readable summary of the Legal Code (the full license) available at\nhttp://creativecommons.org/licenses/by/3.0/legalcode",
    "publication_id": 196,
    "reviews": [],
    "revisions": [
      {
        "article": "bafkreictm6keuvxnyus7tkkmhzceaguaf6j7ung73krxcnltq3q42znubu",
        "dapp": null,
        "dataset": null,
        "doi": null,
        "handle": "1926/1308",
        "source_code": "bafybeibat42xizrkd7gpcwy5zvl4avoqdjkph6cgk353xetml7okcqq5qy",
        "source_code_git_ref": null
      }
    ],
    "source_code_git_repo": null,
    "submitted_by_author": {
      "author_email": "lajarj@rpi.edu",
      "author_firstname": "Julio",
      "author_fullname": "Lajara, Julio",
      "author_id": 714,
      "author_institution": "Rensselaer Polytechnic Institute",
      "author_lastname": "Lajara"
    },
    "tags": [
      "region growing",
      "image segmentation",
      "ventricle"
    ],
    "title": "Image Segmentation: Ventricle Isolation Using Region Growing"
  }
}