{
    "abstract": "As part of the Center of Excellence in Genomic Science at Caltech, we have initiated the Digital Fish\r\nProject. Our goal is to use in toto imaging of developing transgenic zebrafish embryos on a genomic scale\r\nto acquire digital, quantitative, cell-based, molecular data suitable for modelling the biological circuits\r\nthat turn an egg into an embryo. In toto imaging uses confocal/2-photon microscopy to capture the\r\nentire volume of organs and eventually whole embryos at cellular resolution every few minutes in living\r\nspecimens thoughout their development. The embryos are labelled such that nuclei are one color and cell\r\nmembranes another color to allow cells to be segmented and tracked as they move and divide. The use\r\nof a transgenic marker in a third color allows a variety of molecular data to be marked. In toto imaging\r\ngenerates 4-d image sets (xyzt) which can contain 100,000 to 1,000,000 images per experiment. We are\r\ndeveloping a software package called GoFigure to visualize, segment, and analyze these very large image\r\nsets. GoFigure uses a MySQL database back end for managing storage of images and segmented objects\r\nand uses VTK and ITK for visualization and segmentation. We plan to use in toto imaging to digitize the\r\ncomplete expression and subcellular localization patterns of thousands of proteins throughout zebrafish\r\nembryogenesis. This genomic data, our zebrafish lines, and GoFigure will be distributed following the\r\nOpen Data/Open Source model.",
    "authors": [
        {
            "author_fullname": "Gouaillard, Alexandre",
            "author_place": 1,
            "persona_email": "agouaillard@gmail.com",
            "persona_firstname": "Alexandre",
            "persona_id": 322,
            "persona_lastname": "Gouaillard"
        },
        {
            "author_fullname": "Brown, Titus",
            "author_place": 2,
            "persona_id": null
        },
        {
            "author_fullname": "Bronner-Fraser, Marianne",
            "author_place": 3,
            "persona_id": null
        },
        {
            "author_fullname": "Fraser, Scott E.",
            "author_place": 4,
            "persona_id": null
        },
        {
            "author_fullname": "Megason, Sean G.",
            "author_place": 5,
            "persona_id": null
        }
    ],
    "date_submitted": "2007-07-16T04:51:54Z",
    "handles": [
        {
            "handle": "1926/565",
            "handle_url": "http://hdl.handle.net/1926/565"
        }
    ],
    "identifiers": {
        "doi": null,
        "pubmed": null
    },
    "journals": [
        {
            "journal_id": 3,
            "journal_name": "The Insight Journal"
        }
    ],
    "publication_id": 170,
    "submitted_by_author": {
        "author_email": "agouaillard@gmail.com",
        "author_firstname": "Alexandre",
        "author_id": 322,
        "author_institution": "Singapore Agency for Science Technology and Research",
        "author_lastname": "Gouaillard"
    },
    "tags": [
        "Cell tracking",
        "confocal imaging",
        "system biology"
    ],
    "title": "GoFigure and The Digital Fish Project: Open tools and open data for an imaging based approach to system biolgy"
}