{
  "publication": {
    "abstract": "Using a robot system to position needles or needle shaped tools during clinical procedures such as biopsy, radio frequency ablation, and target drug delivery has a great potentials in increasing accuracy and speed of the process, and minimizing trauma to patient. This paper describes a robot assist needle placement system developed using Image Guided Surgery Toolkit (IGSTK). IGSTK is an open source software toolkit aimed at providing a robust and safe platform for researchers and clinicians for fast prototyping of image guided applications with minimum cost and effort",
    "articles": [
      null,
      "bafybeieff7bh6nlkru5pbkmfqihqfhyifdlarbulrxedhfcafg2ocytryq",
      null,
      null,
      "bafybeiamw5s5w76elabzsbum3qivukagorzab5sqmyndufap3pjov3xizu"
    ],
    "authors": [
      {
        "author_fullname": "Enquobahrie, Andinet",
        "author_place": 2,
        "persona_email": "andinet.enqu@kitware.com",
        "persona_firstname": "Andinet",
        "persona_id": 68,
        "persona_lastname": "Enquobahrie"
      },
      {
        "author_fullname": "Cheng, Peng",
        "author_place": 1,
        "persona_id": null
      },
      {
        "author_fullname": "Stenzel, Roland",
        "author_place": 3,
        "persona_email": "roland.stenzel@gmx.net",
        "persona_firstname": "Roland",
        "persona_id": 428,
        "persona_lastname": "Stenzel"
      },
      {
        "author_fullname": "Lin, Ralph",
        "author_place": 4,
        "persona_id": null
      },
      {
        "author_fullname": "Zhang, Hui",
        "author_place": 5,
        "persona_email": "zhang@isis.imac.georgetown.edu",
        "persona_firstname": "Hui",
        "persona_id": 313,
        "persona_lastname": "Zhang"
      },
      {
        "author_fullname": "Yaniv, Ziv",
        "author_place": 6,
        "persona_email": "zivy@isis.georgetown.edu",
        "persona_firstname": "Ziv",
        "persona_id": 201,
        "persona_lastname": "Yaniv"
      },
      {
        "author_fullname": "Kim, Hee-su",
        "author_place": 7,
        "persona_email": "wizardhs@gmail.com",
        "persona_firstname": "Hee-su",
        "persona_id": 278,
        "persona_lastname": "Kim"
      },
      {
        "author_fullname": "Cleary, Kevin",
        "author_place": 8,
        "persona_email": "cleary@georgetown.edu",
        "persona_firstname": "Kevin",
        "persona_id": 368,
        "persona_lastname": "Cleary"
      }
    ],
    "categories": [],
    "comments": [],
    "date_submitted": "2006-07-11",
    "handles": [
      {
        "handle": "1926/223",
        "handle_url": "http://hdl.handle.net/1926/223"
      }
    ],
    "identifiers": {
      "doi": null,
      "pubmed": null
    },
    "journals": [
      {
        "journal_id": 3,
        "journal_name": "The Insight Journal"
      }
    ],
    "license": "You are licensing your work to Kitware Inc. under the\nCreative Commons Attribution License Version 3.0.\n\nKitware Inc. agrees to the following:\n\nKitware is free\n * to copy, distribute, display, and perform the work\n * to make derivative works\n * to make commercial use of the work\n\nUnder the following conditions:\n\\\"by Attribution\\\" - Kitware must attribute the work in the manner specified by the author or licensor.\n\n * For any reuse or distribution, they must make clear to others the license terms of this work.\n * Any of these conditions can be waived if they get permission from the copyright holder.\n\nYour fair use and other rights are in no way affected by the above.\n\nThis is a human-readable summary of the Legal Code (the full license) available at\nhttp://creativecommons.org/licenses/by/3.0/legalcode",
    "publication_id": 110,
    "reviews": [
      {
        "author": {
          "author_email": "xenophon.papademetris@yale.edu",
          "author_firstname": "Xenophon",
          "author_id": 79,
          "author_lastname": "Papademetris"
        },
        "content": "<b>Summary:</b>\r\nThe paper presents a robot assisted needle placement system based on\r\nIGSTK. The platform has been tested and encouraging results are presented.\r\n \r\n<b>Open Science:</b> The authors provided source code and a data set,\r\nunfortunately one also needs a robot and the intra-operative scanner to\r\nreplicate the findings both of which are unfortunately not so easily\r\ndownloadable or available.\r\n\r\n<b>Reproducibility:</b>\r\nI downloaded and looked at the code which is of good quality and looks very\r\nsimilar to code in ITK. I did not attempt to compile it as it requires VTK\r\n5 and ITK 2.6 which I did not have installed on my system, however the\r\nInsight Journal dashboard suggests that it compiled just fine.\r\n\r\n<b>Use of Open Source Software:</b>\r\nThe authors use the usual combination of ITK/VTK and the IGSTK toolkit (as\r\nimplied by the title). The comment about IGSTK being a safe platform for\r\nresearchers and clinicians to use needs to be qualified, especially since\r\nany additional code (extensions, user applications) is perfectly capable of\r\ncrashing even the most stable of systems. \r\n\r\n<b>Open Source Contributions:</b>\r\nThe source code is made available (together with IGSTK and FLTK), see\r\nreproducibility above.\r\n\r\n<b>Code Quality:</b>\r\nSee reproducibility above.\r\n\r\n<b>Applicability to other problems:</b>\r\nThe methodology developed for the application is fairly crude in terms of\r\nwhat constitutes state of the art image analysis. Having said that, the\r\nresults suggest that it is suitable for the application and perhaps use of\r\nmore sophisticated methods might be overkill. \r\n\r\nThe use of a CT scanner for registration is uncommon though, intra-operative\r\nscanners are not as easily available and use of CT scanner in a patient setup is \r\nkept to a minimum for radiation purposes. This makes the method less applicable to\r\nother problems. Point fiducials are time consuming but often easier to implement \r\nin most common situations.\r\n\r\n<b>Suggestions for future work:</b>\r\n\r\n<OL>\r\n<LI> Figure 4: The word ERROR appears in the textbox below the figure. This\r\nis a dangerous think to publish for anything related to\r\nintervention! While in this case, this is not a serious issue, it should be\r\nqualified in the caption. I assume this is the output from the state\r\nmachine.\r\n\r\n<LI> The validation study is not sufficiently well described. What was the\r\nexperimental setup? Did the authors test the amount of time for which\r\ncommunication with the robot remained stable under stress (also leaving the\r\nconnection on for a few hours without actually invoking it). What is the\r\naffect of accidental disconnection of the robot on the software (cables do\r\nget loose in real situations). In general testing of this type needs to\r\nassume that the worst will happen as it often unfortunately does in the\r\ncase of real interventions.\r\n\r\n<LI> I assume that the authors mean \\\\\\\\\\\\\\\"more sophisticated\\\\\\\\\\\\\\\" as opposed to\r\n\\\\\\\\\\\\\\\"more relaxed\\\\\\\\\\\\\\\" registration methods. Iterative closest point methods might\r\nbe appropriate, the authors might also consider robust methods which are\r\nable to do outlier rejection and hence handle any overdetection (the Robust\r\nPoint Matching framework was pioneered by Anand Rangarajan and his\r\ncollaborators comes to mind here, this code is available in various forms).\r\n</LI>\r\n</OL>\r\n\r\n<b>Requests for additional information from authors:</b>\r\nThe validation study needs to be better described. What CT scanner was\r\nused what was the environment in which the robot was placed\r\netc. Reproducibility is also critical, how do the results vary if the robot\r\nis imaged twice in the same position, or if the robot is moved back to the\r\nsame position and reimaged. This is really the weak point of this paper.\r\n\r\n\r\n\r\n\r\n",
        "date": "09-05-2006",
        "review_id": 376
      },
      {
        "author": {
          "author_email": "holmes.david3@mayo.edu",
          "author_firstname": "David",
          "author_id": 20,
          "author_lastname": "Holmes"
        },
        "content": "<b>Summary:</b>\r\nThe authors describe an application of the IGSTK software for robot-guided needle placement. While the paper is loosely about the entire robot-guided application, the method focuses on the registration component of the procedure largely because the is the most critical aspect of the software. The background briefly describes both the hardware and the IGSTK software. The method and results are in regards to the fiducial registration method.\r\n \r\n<b>Hypothesis:</b>\r\nAlthough not a hypothesis, the premise of the paper is that robot-guided needle placement is an important clinical application and requires effective software. Specifically, the software must be effective at registering the tool to the patient. Once achieved, visualization is important.\r\n\r\n<b>Evidence:</b>\r\nThe evidence is through a small validation study on a phantom. The details of the validation study are lacking a bit, but the results suggest that the fiducial registration method is effective.\r\n\r\n<b>Open Science:</b>\r\nThis work is completely open science and includes source code which can be used in conjunction with the paper to evaluate and test the method.\r\n\r\n<b>Reproducibility:</b>\r\nThe source code allows for an evaluation of the method and reproducing the study. The authors also include data in their submission which is great. That being said, there is not much information on the validation study (including the type of phantom) and how the ground truth was determined. Nevertheless, the method is reproducible and would allow another investigator to conduct an independent evaluation.\r\n\r\n<b>Use of Open Source Software:</b>\r\nEverything is open source\r\n\r\n<b>Open Source Contributions:</b>\r\nCode is available; however, I did not have the opportunity to review it thoroughly or run it. It does seems sparse on documentation in the code.\r\n\r\n<b>Code Quality:</b>\r\nSame as above.\r\n\r\n<b>Applicability to other problems:</b>\r\nOne would hope and expect that the application could be applied to other IGS applications. This provides a nice example of how to use IGSTK in a clinical application.\r\n\r\n<b>Suggestions for future work:</b>\r\nThe authors appropriately suggest future work for themselves. I look forward to following this project into the future.\r\nGet going on the clinical trials to show the work that open-source can and should be used to treat patients.\r\n\r\n<b>Requests for additional information from authors:</b>\r\nThe paper would benefit from including more references appropriate to the registration method. There are several fiducial based registration papers in the literature.\r\n\r\nThe validation study could be more detailed as well.\r\n\r\n<b>Additional Comments:</b>\r\n[This is a free-form field]\r\n\r\n",
        "date": "09-05-2006",
        "review_id": 369
      }
    ],
    "submitted_by_author": {
      "author_email": "andinet.enqu@kitware.com",
      "author_firstname": "Andinet",
      "author_fullname": "Enquobahrie, Andinet",
      "author_id": 68,
      "author_institution": "Kitware, Inc.",
      "author_lastname": "Enquobahrie"
    },
    "tags": [
      "Robot",
      "Registration",
      "Segmentation",
      "CT"
    ],
    "title": "Robot Assisted Needle Placement: Application developed using an open source image guided surgery toolkit (IGSTK)"
  }
}