{
  "publication": {
    "abstract": "Parameterization of surfaces, sometimes alled ”‘flattening”’ as it maps a surface embedded in 3D into its intrinsic 2D domain, is a powerfull tool for the analysis of surfaces. For the past years, there has been a growing interest in the Community that even lead to one implementation of one special type of parameterization in ITK [1,5,8,9]. We are providing here a more general framework for parameterization of single connected surfaces of any genus. It is based on a recent addition to ITK: itkQuadEdgeMesh [6] which allows an elegant an optimal implementation of algorithm for geometry and topology processing of discrete 2-manifolds. The 5 algorithms that we implemented map the meshes into a planar domain with fixed boundary leading to more stability and speed than mapping into the spherical domain. Each of them use different kind of parameterization with different properties. The conformal parameterization is usually used as it is intrinsic to the geometry of the mesh and thus allow shape analysis independently of the connectivity. However if flattening the mesh is your only goal, then the simplest parameterization algorithm (graph theory) will give you the best speed. This is the case when you want to further process the mesh in a lower dimension. Using specific solvers, the parameterization of meshes can be done sufficiently fast (couple of seconds) to consider this approach in interactive applications.",
    "authors": [
      {
        "author_fullname": "Gelas, Arnaud",
        "author_place": 1,
        "persona_email": "arnaudgelas@gmail.com",
        "persona_firstname": "Arnaud",
        "persona_id": 7896,
        "persona_lastname": "Gelas"
      },
      {
        "author_fullname": "Gouaillard, Alexandre",
        "author_place": 2,
        "persona_email": "agouaillard@gmail.com",
        "persona_firstname": "Alexandre",
        "persona_id": 322,
        "persona_lastname": "Gouaillard"
      }
    ],
    "date_submitted": "2007-11-22",
    "handles": [
      {
        "handle": "1926/1315",
        "handle_url": "http://hdl.handle.net/1926/1315"
      }
    ],
    "id": 202,
    "identifiers": {
      "doi": null,
      "pubmed": null
    },
    "journals": [
      {
        "journal_id": 3,
        "journal_name": "The Insight Journal"
      }
    ],
    "submitted_by_author": {
      "author_email": "agouaillard@gmail.com",
      "author_firstname": "Alexandre",
      "author_id": 322,
      "author_institution": "Singapore Agency for Science Technology and Research",
      "author_lastname": "Gouaillard"
    },
    "tags": [
      "discrete surfaces",
      "parameterization"
    ],
    "title": "Parameterization of discrete surfaces"
  }
}