{
 "publication": {
  "abstract": "The gold standard for measuring muscle regeneration in muscular dystrophy therapies is counting the number of dystrophin-positive muscle fibers on a cryostat muscle section immunostained for dystrophin. The standard process of manually counting a few thousand myofibers is tedious, time consuming, and limits quantitative analysis of a therapy success. We present an unsupervised method for segmenting and counting the number of myofibers on an immunofluorescent microscopy image. The key threshold selection problem is resolved by maximizing the number of sub-threshold connected components. Components significantly smaller than the known lower bound myofiber area, the only input parameter, are ignored to reduce noise. Validation on a series of images (n=63) revealed that our algorithm varied by less than 10% from manual counts in the relevant range of operation. The algorithm allows us to quantify three-dimensional dystrophin expression and design experiments that address a major limitation in muscular dystrophy therapies, the limited distribution of dystrophin after treatment. Further we have extended this method to segment and count objects in other immunofluorescent images. The method was quickly developed and tested using the Insight Toolkit (ITK), an open source C++ library for the development of image analysis software.",
  "authors": [
   {
    "author_fullname": "Urish, Kenneth",
    "author_place": 1,
    "persona_email": "ken.urish@gmail.com",
    "persona_firstname": "Kenneth",
    "persona_id": 55,
    "persona_lastname": "Urish"
   },
   {
    "author_fullname": "August, Jonas",
    "author_place": 2,
    "persona_id": null
   },
   {
    "author_fullname": "Huard, Johnny",
    "author_place": 3,
    "persona_id": null
   }
  ],
  "categories": [],
  "comments": [],
  "date_submitted": "2005-08-06",
  "handles": [
   {
    "handle": "1926/48",
    "handle_url": "http://hdl.handle.net/1926/48"
   }
  ],
  "identifiers": {
   "doi": null,
   "pubmed": null
  },
  "journals": [
   {
    "journal_id": 3,
    "journal_name": "The Insight Journal"
   }
  ],
  "publication_id": 40,
  "submitted_by_author": {
   "author_email": "ken.urish@gmail.com",
   "author_firstname": "Kenneth",
   "author_id": 55,
   "author_institution": "Univeristy of Pittsburgh",
   "author_lastname": "Urish"
  },
  "tags": [
   "Automatic Thresholding",
   "Immunofluorescent Images",
   "Micropscopy Images",
   "Unsupervised Thresholding"
  ],
  "title": "Unsupervised Segmentation for Myofiber Counting in Immunofluorescent Microscopy Images"
 }
}