{
  "publication": {
    "abstract": "This paper describes the Insight Toolkit (ITK) Conformal Flattening filter: itkConformalFlatteningFilter.\r\nThis ITK filter is an implementation of a paper by Sigurd Angenent, et al., “On the Laplace-Beltrami\r\nOperator and Brain Surface Flattening”. This filter performs an angle preserving map of any genus\r\nzero (i.e. no handles) triangulated mesh to the sphere or, alternatively, to the plane. In other words,\r\nany given triangle in the resulting sphere will have the same angles as the corresponding triangle in the\r\noriginal mesh, though their areas may differ. In this paper, we describe our code and provide the user\r\nwith enough details to reproduce the results which we present in this paper. This filter has a variety of\r\napplications including the flattening of brain surfaces, which was the initial motivation for this work.",
    "articles": [
      "bafybeigbq2fxyi4efa2gziq55ldzvesoyadvddi4r4i6hn2nl2qnpjtmoa",
      "bafybeiagvctxygotfrx4aj6bktjvnrsz7bacmll2u5kgbmpag2ciw6tihm",
      "bafybeibg2yfjxlmw25vpagguaowbyqtl7ztbirgis54sbhjqii4tgrvafa"
    ],
    "authors": [
      {
        "author_fullname": "Gao, Yi",
        "author_place": 1,
        "persona_email": "yi.gao@gatech.edu",
        "persona_firstname": "Yi",
        "persona_id": 468,
        "persona_lastname": "Gao"
      },
      {
        "author_fullname": "Melonakos, John",
        "author_place": 2,
        "persona_email": "jmelonak@ece.gatech.edu",
        "persona_firstname": "John",
        "persona_id": 37,
        "persona_lastname": "Melonakos"
      },
      {
        "author_fullname": "Melonakos, John",
        "author_place": 2,
        "persona_email": "john@arrayfire.com",
        "persona_firstname": "John",
        "persona_id": 11869,
        "persona_lastname": "Melonakos"
      },
      {
        "author_fullname": "Tannenbaum, Allen",
        "author_place": 3,
        "persona_id": null
      }
    ],
    "categories": [],
    "comments": [],
    "date_submitted": "2006-07-11T03:41:53Z",
    "journals": [
      {
        "journal_id": 3,
        "journal_name": "The Insight Journal"
      }
    ],
    "license": "You are licensing your work to Kitware Inc. under the\nCreative Commons Attribution License Version 3.0.\n\nKitware Inc. agrees to the following:\n\nKitware is free\n * to copy, distribute, display, and perform the work\n * to make derivative works\n * to make commercial use of the work\n\nUnder the following conditions:\n\\\"by Attribution\\\" - Kitware must attribute the work in the manner specified by the author or licensor.\n\n * For any reuse or distribution, they must make clear to others the license terms of this work.\n * Any of these conditions can be waived if they get permission from the copyright holder.\n\nYour fair use and other rights are in no way affected by the above.\n\nThis is a human-readable summary of the Legal Code (the full license) available at\nhttp://creativecommons.org/licenses/by/3.0/legalcode",
    "publication_id": 112,
    "reviews": [
      {
        "author": {
          "author_email": "sylvainjaume@gmail.com",
          "author_firstname": "Sylvain",
          "author_id": 102,
          "author_lastname": "Jaume"
        },
        "content": "<b>Summary:</b>\r\nThe paper describes an implementation of the paper about conformal flattening of triangle surfaces by Angenent et al. 1999.\r\nThe code uses VTK and ITK, and includes a new ITK class, three applications, and two example surfaces.\r\n\r\n<b>Hypothesis:</b>\r\nThe paper addresses the flattening of *triangle* surfaces, typically obtained with the Marching Cubes algorithm. The implementation applies to surfaces of genus zero with no boundaries, i.e. closed surfaces with no handles.\r\nA triangle surface can be mapped on a 2D parameterization under one of two constraints: to preserve the area of the triangles (authalic flattening), or to preserve the angles of the triangles (conformal flattening).\r\nThe authors take the conformal flattening approach.\r\n\r\n<b>Evidence:</b>\r\nTwo example applications are included: one with a synthetic surface and one brain surface.\r\nThe quality of the results is only reported for the synthetic surface. Besides it would be interesting to visualize the angle ratios computed in anglePreserveCheck.\r\nFinally a scalar bar with a title and units would make the figures more informative.\r\n\r\n<b>Open Science:</b>\r\nThe authors provide everything to reproduce the results in the paper. However they do not give some information that the user needs to reproduce similar results with her/his own data.\r\nThe way the triangle meshes were created and the quality of the triangles may dramatically impact the results of the flattening. How the example surfaces were created, and what are the equations or input images?\r\nWhich tools were used, in which order? What are the parameters? What are the potential issues and workarounds (e.g. increasing the value of one parameter)?\r\n\r\n<b>Reproducibility:</b>\r\nThe code compiles like a charm on VS8 and is straightforward to use (one input and one output). I got exactly the results reported in the paper.\r\nTo take advantage of the IJ testing facility, the authors may want to add a test in the CMakeLists.txt.\r\n\r\n<b>Use of Open Source Software:</b>\r\nThe authors mention that they use \\\\\\'open-source tools\\\\\\', but these tools require manual editing. More information about this editing would help potential users.\r\n\r\n<b>Open Source Contributions:</b>\r\nThe three applications are easy to compile, to run and to understand.\r\nTheir code only differs in the visualization parameters of their Display method. Would it make more sense to factorize the surface flattening in a single application and the visualization in another?\r\nThis second application could have two sets of parameters: one for nice.vtk and one for brain.vtk.\r\n\r\n<b>Code Quality:</b>\r\nI noticed major VTK memory leaks. For instance instances of vtkIdList are created and never deleted.\r\nTo be consistent with the ITK style, the underscore at the begining of variable names could be removed.\r\nFor the same reason, the name of the class methods could start with a capital letter: setPointP, mapToSphere, mapToPlane, setScale.\r\nAs for the documentation of the methods, it is preferred to write the comments before the method signature.\r\nFuture users of this code would aprreciate if all methods were documented.\r\n\r\nAs it is, the code may cause runtime errors. Calls to \\\\\\'return\\\\\\' are missing after every itkExceptionMacro.\r\nIt is recommended to insert filter->Update() in a try/catch block.\r\nWhy setting point P to -100000 in brainTest.cxx and itkConformalFlatteningFilterTest.cxx?\r\nvtkPolyDataNormals may create some problems since it may duplicate points. In any case, it does not seem to improve the rendering.\r\n\r\n<b>Applicability to other problems:</b>\r\nThe numerous problems that require a 2D parameterization could benefit from this implementation.\r\n\r\n<b>Suggestions for future work:</b>\r\nThe authors may be interested in using the topology correction code OpenTopology published in the InsightJournal.\r\n\r\n<b>Requests for additional information from authors:</b>\r\nThe implementation could be explained further in the paper (matrix construction, solver for the equation system, vnl functions called, etc.).\r\nHow the equations of section 1 (that can be found in Angenent et al. paper) map to the actual code that the authors contributed?\r\nOnly two sentences at the end of section 1 offer some information about the implementation.\r\n\r\n<b>Additional Comments:</b>\r\nThe information that anglePreserveCheck writes to the standard output needs some revisions: the file is named angleRatioDiff.txt and it contains the ratios for the angles around every node.",
        "date": "10-10-2006",
        "review_id": 408
      },
      {
        "author": {
          "author_email": "xiaoning.qian@gmail.com",
          "author_firstname": "Xiaoning",
          "author_id": 487,
          "author_lastname": "Qian"
        },
        "content": "<b>Summary:</b> \r\nThis paper describes the implementation of an angle preserving flattening\r\nalgorithm. The algorithm provides one alternative for the brain study after\r\nthe conformal flattening map.\r\n \r\n<b>Hypothesis:</b>\r\nThe implemented algorithm preserves relative angles and guarantees a\r\nbijective map and the original structure can be recovered by inverse\r\nmap. ( The later is not shown as the main point though. )\r\n\r\n\r\n<b>Evidence:</b>\r\nThe authors only provide the results for one synthetic and one brain. They\r\nlook good and the mean and s.t.d. of angle ratios for the brain is valid.\r\nBut as the authors noted, they could not get more brain surface as the\r\ncurrent segmentation algorithms are not able to give them genus zero \r\nsurfaces.\r\n\r\n\r\n<b>Open Science:</b>\r\n The source codes and data for the algorithm used in the experiments is\r\n provided. The authors follow the standards of open source.\r\n\r\n<b>Reproducibility:</b>\r\n I haven\\'t run the algorithm or tests the authors provided.\r\n\r\n<b>Use of Open Source Software:</b>\r\n The codes are based on ITK.\r\n\r\n<b>Code Quality:</b>\r\n I haven\\'t looked at the source codes carefully at this time.\r\n\r\n<b>Applicability to other problems:</b>\r\nThe statistical study for any genus zero surface.\r\n\r\n<b>Suggestions for future work:</b>\r\n The work probably needs more data for testing.\r\n\r\n<b>Additional Comments:</b>\r\n There are some typos in the paper. (for example, in pape 2)\r\nAnd also, it seems to me that the authors directly took the mathematical\r\npart for the reference [1]. I think that some intuitive introduction of the\r\nalgorithm would be better.\r\n\r\n",
        "date": "09-02-2006",
        "review_id": 356
      }
    ],
    "revisions": [
      {
        "article": "bafybeigbq2fxyi4efa2gziq55ldzvesoyadvddi4r4i6hn2nl2qnpjtmoa",
        "dapp": null,
        "dataset": null,
        "doi": null,
        "handle": "1926/225",
        "source_code": "bafybeiamcrfs4oc5ljpbo2uz7voywickjd27cnnzl37e7ofrti76y2yjry",
        "source_code_git_ref": null
      }
    ],
    "source_code_git_repo": null,
    "submitted_by_author": {
      "author_email": "jmelonak@ece.gatech.edu",
      "author_firstname": "John",
      "author_fullname": "Melonakos, John",
      "author_id": 37,
      "author_institution": "Georgia Tech",
      "author_lastname": "Melonakos"
    },
    "tags": [
      "Brain",
      "Conformal Flattening",
      "Mesh",
      "ITK",
      "VTK",
      "Angle-preserving"
    ],
    "title": "Conformal Flattening ITK Filter"
  }
}