{
 "publication": {
  "abstract": "Image fusion provides a mechanism to combine multiple images into a single representation to aid human visual perception and image processing tasks. Such algorithms endeavour to create a fused image containing the salient information from each source image, without introducing artefacts or inconsistencies. Image fusion is applicable for numerous fields including: defence systems, remote sensing and geoscience, robotics and industrial engineering, and medical imaging. In the medical imaging domain, image fusion may aid diagnosis and surgical planning tasks requiring the segmentation, feature extraction, and/or visualisation of multi-modal datasets.\r\n\r\nThis paper discusses the implementation of an image fusion toolkit built upon the Insight Toolkit (ITK). Based on an existing architecture, the proposed framework (GIFT) offers a 'plug-and-play' environment for the construction of n-D multi-scale image fusion methods. We give a brief overview of the toolkit design and demonstrate how to construct image fusion algorithms from low-level components (such as multi-scale methods and feature generators). A number of worked examples for medical applications are presented in Appendix A, including quadrature mirror filter discrete wavelet transform (QMF DWT) image fusion.",
  "authors": [
   {
    "author_fullname": "Mueller, Daniel; Maeder, Anthony; O'Shea, Peter",
    "author_place": 1,
    "persona_email": "dan.muel@gmail.com",
    "persona_firstname": "Dan",
    "persona_id": 286,
    "persona_lastname": "Mueller"
   }
  ],
  "categories": [],
  "comments": [],
  "date_submitted": "2006-07-08T07:36:35Z",
  "handles": [
   {
    "handle": "1926/216",
    "handle_url": "http://hdl.handle.net/1926/216"
   }
  ],
  "identifiers": {
   "doi": null,
   "pubmed": null
  },
  "journals": [
   {
    "journal_id": 3,
    "journal_name": "The Insight Journal"
   }
  ],
  "publication_id": 103,
  "reviews": [],
  "submitted_by_author": {
   "author_email": "dan.muel@gmail.com",
   "author_firstname": "Dan",
   "author_id": 286,
   "author_institution": "Philips Healthcare",
   "author_lastname": "Mueller"
  },
  "tags": [
   "multi-modal",
   "wavelet",
   "ITK",
   "image fusion"
  ],
  "title": "The Generalised Image Fusion Toolkit (GIFT)"
 }
}