{
  "publication": {
    "abstract": " A fully automatic brain segmentation method is presented. First the skull is stripped using a model-based level set on T1-weighted inversion recovery images, then the brain ventricles and basal ganglia are segmented using the same method on T1-weighted images. The central white matter is segmented using a regular level set method but with high curvature regulation. To segment the cortical gray matter, a skeleton-based model is created by extracting the mid-surface of the gray matter from a preliminary segmentation using a threshold-based level set. An implicit model is then built by defining the thickness of the gray matter to be 2.7 mm. This model is incorporated into the level set framework and used to guide a second round more precise segmentation. Preliminary experiments show that the proposed method can provide relatively accurate results compared with the segmentation done by human observers. The processing time is considerably shorter than most conventional automatic brain segmentation methods. ",
    "authors": [
      {
        "author_fullname": "Wang, Chunliang",
        "author_place": 2,
        "persona_email": "chunliang.wang@liu.se",
        "persona_firstname": "Chunliang",
        "persona_id": 8762,
        "persona_lastname": "Wang"
      },
      {
        "author_fullname": "Smedby, Örjan",
        "author_place": 3,
        "persona_id": null
      }
    ],
    "date_submitted": "2013-10-21 17:14:16",
    "handles": [
      {
        "handle": "10380/3439",
        "handle_url": "http://hdl.handle.net/10380/3439"
      }
    ],
    "id": 903,
    "identifiers": {
      "doi": null,
      "pubmed": null
    },
    "journals": [
      {
        "journal_id": 41,
        "journal_name": "MICCAI 2013 Workshops"
      }
    ],
    "submitted_by_author": {
      "author_email": "chunliang.wang@liu.se",
      "author_firstname": "Chunliang",
      "author_id": 8762,
      "author_institution": "Linköping University, Linköping, Sweden",
      "author_lastname": "Wang"
    },
    "tags": [
      "Level set",
      "Skeleton Based Model",
      "coherent propagation",
      "Brain Segmentation"
    ],
    "title": "Fully automatic brain segmentation using model-guided level sets and skeleton-based models"
  }
}