{
  "publication": {
    "abstract": "This document introduces a program based on the algorithm described by Maria Cristina Tugurlan. The program uses file readers, image filters, and file writers from the Insight Toolkit ITK www.itk.org. It produces as output an image whose values are the times of first arrival of a wavefront that spreads from seed points with a speed at every point equal to the input image intensity. It performs the computation in parallel on distributed memory computers using the Message Passing Interface MPI. Each MPI process reads a small piece of the input image into memory. It computes fast marching on its piece. It sends and receives the values from fast marching at piece boundaries. It recalculates fast marching a number of times set from the command line using the new boundary values each time. Each MPI process writes only a small piece of the output file.\n\nA substantial difference is seen when the output of MPI fast marching is compared to the output of serial fast marching. This difference may be acceptable for some uses. The program should be able to handle input images that are too large to fit in the memory of a single computer.",
    "articles": [
      "bafkreibr4xuolczwpavzcnvv2zdhgcoujpsshkdjypsrlhjmzkschmg6my"
    ],
    "authors": [
      {
        "author_fullname": "Hobbs, Kevin",
        "author_place": 1,
        "persona_email": "hobbsk@ohiou.edu",
        "persona_firstname": "Kevin",
        "persona_id": 465,
        "persona_lastname": "Hobbs"
      }
    ],
    "categories": [
      "Distributed computation",
      "Level sets"
    ],
    "comments": [],
    "date_submitted": "2009-11-23 12:39:35",
    "journals": [
      {
        "journal_id": 3,
        "journal_name": "The Insight Journal"
      }
    ],
    "license": "You are licensing your work to Kitware Inc. under the\nCreative Commons Attribution License Version 3.0.\n\nKitware Inc. agrees to the following:\n\nKitware is free\n * to copy, distribute, display, and perform the work\n * to make derivative works\n * to make commercial use of the work\n\nUnder the following conditions:\n\\\"by Attribution\\\" - Kitware must attribute the work in the manner specified by the author or licensor.\n\n * For any reuse or distribution, they must make clear to others the license terms of this work.\n * Any of these conditions can be waived if they get permission from the copyright holder.\n\nYour fair use and other rights are in no way affected by the above.\n\nThis is a human-readable summary of the Legal Code (the full license) available at\nhttp://creativecommons.org/licenses/by/3.0/legalcode",
    "publication_id": 704,
    "reviews": [],
    "revisions": [
      {
        "article": "bafkreibr4xuolczwpavzcnvv2zdhgcoujpsshkdjypsrlhjmzkschmg6my",
        "dapp": null,
        "dataset": null,
        "doi": null,
        "handle": "10380/3137",
        "source_code": null,
        "source_code_git_ref": null
      }
    ],
    "source_code_git_repo": null,
    "submitted_by_author": {
      "author_email": "hobbsk@ohiou.edu",
      "author_firstname": "Kevin",
      "author_fullname": "Hobbs, Kevin",
      "author_id": 465,
      "author_institution": "Ohio University",
      "author_lastname": "Hobbs"
    },
    "tags": [
      "Parallel",
      "Distributed Memory",
      "Fast Marching",
      "MPI"
    ],
    "title": "An Implementation of Parallel Fast Marching Using the Message Passing Interface"
  }
}