{
  "publication": {
    "abstract": "MINC2.0 IO support for ITK.",
    "articles": [
      "bafkreigdimlbaal722ytuzylccl2xcosbuoqd7alscj3wl6cmyjoimtczm"
    ],
    "authors": [
      {
        "author_fullname": "Baghdadi, Leila",
        "author_place": 1,
        "persona_email": "baghdadi@phenogenomics.ca",
        "persona_firstname": "Leila",
        "persona_id": 7,
        "persona_lastname": "Baghdadi"
      }
    ],
    "categories": [
      "IO"
    ],
    "comments": [],
    "date_submitted": "2005-11-30T21:29:16Z",
    "journals": [
      {
        "journal_id": 3,
        "journal_name": "The Insight Journal"
      }
    ],
    "license": "You are licensing your work to Kitware Inc. under the\nCreative Commons Attribution License Version 3.0.\n\nKitware Inc. agrees to the following:\n\nKitware is free\n * to copy, distribute, display, and perform the work\n * to make derivative works\n * to make commercial use of the work\n\nUnder the following conditions:\n\\\"by Attribution\\\" - Kitware must attribute the work in the manner specified by the author or licensor.\n\n * For any reuse or distribution, they must make clear to others the license terms of this work.\n * Any of these conditions can be waived if they get permission from the copyright holder.\n\nYour fair use and other rights are in no way affected by the above.\n\nThis is a human-readable summary of the Legal Code (the full license) available at\nhttp://creativecommons.org/licenses/by/3.0/legalcode",
    "publication_id": 64,
    "reviews": [
      {
        "author": {
          "author_email": "rupert.brooks@gmail.com",
          "author_firstname": "Rupert",
          "author_id": 171,
          "author_lastname": "Brooks"
        },
        "content": "<FONT COLOR=\\\"red\\\">UPDATE:</FONT>\r\nAfter corresponding with the author, i would adjust my comments somewhat. Specifically, the reader was never intended to read minc version 1 files, so the fact that it doesn\\'t is not really a problem. Some problems that i was having were due to a faulty build of the minctools i was using, rather than anything to do with this code particularly.\r\n\r\nFor those who might like to use this module, i would point out two things: \r\n<OL>\r\n<LI>You can convert your old minc 1 files, such as brainweb files, to minc 2 using the mincconvert utility found on the website listed in the paper. Note that mincconvert does not automatically get installed with the release that I used (2.0.09), you have to manually install it, this should be fixed in the next release The command line to use is:\r\n<CODE>\r\nmincconvert -2 input.mnc output.mnc\r\n</CODE>\r\n<LI>Secondly, when i built the minc tools, i ran into problems using the HDF library version 1.6.5, but it works fine with 1.6.4. I am not sure why, but if you experience HDF errors when trying to convert minc files, this may be the source of the trouble.\r\n</OL>\r\n\r\n\r\n<b>Summary:</b>\r\nThe paper presents code to enable ITK to read and write the MINC2 file format.\r\n \r\n<b>Evidence:</b>\r\nThe authors provide a small test program which manipulates one test dataset that is provided. The test strategy seems to be visual - the results of the program are inspected for correctness by eye - rather than numerical.\r\n\r\n<b>Open Science:</b>\r\nThe paper adheres to the principles of open science. The work is reproducible.\r\n\r\n<b>Reproducibility:</b>\r\nI downloaded, compiled and ran the code. In that sense I reproduced the work. However the test strategy may not be adequate to fully test the code.\r\n\r\nAs an example, I tried to use the code to read my own data, but I had difficulty. I was only able to read the data provided with the code. In particular, i was not able to read data from MNI Brainweb, which would probably be a major use of this module. I got the following error in all cases:\r\n<CODE>\r\nrbrook@spender{IO}../../test/itkMINC2ImageIOTest ~/t1_icbm_normal_1mm_pn3_rf20.mnc \r\n This is a test for MINC2!!\r\nexception in file reader \r\nitk::ERROR: MINC2ImageIO(0x85a9b80): Unknown component type: 0\r\nUnknown\r\n</CODE>\r\nI am not sure if this problem was due to my data being in MINC1 format, or other reasons. The MINC2 library is supposed to be backwards compatible with MINC1, but it may be the case that the module presented here does not support reading minc1. I did not pursue this in great detail at this time.\r\n\r\n<b>Use of Open Source Software:</b>\r\nThe provided code will allow the open source ITK package to read the file format of the open source MINC tools. It is entirely open source based.\r\n\r\n<b>Open Source Contributions:</b>\r\nSource code is provided, however, it does not compile without editing. The line\r\n<CODE>\r\n#include \\\"itkMINC2ImageIOFactory.h\\\"\r\n</CODE>\r\nmust be commented out of itkMINC2ImageIOTest.cxx for it to compile. Furthermore, the writing in the paper implies that other code may exist that was not provided. Specifically, they mention that the module was added to ITK as an advanced option, but no CMAKE was provided. Also, the use of the pluggable factories was discussed - but an itkMINC2ImageIOFactory class was not provided. The commented line above implies that it exists somewhere.\r\n\r\nAdditional documentation on building the needed external libraries may be helpful. To assist other reviewers, i give some tips here - these worked for me on RedHat8 linux, there may be other and better solutions.\r\n<OL>\r\n<LI>In addition to the minc2, hdf and netcdf libraries, i found that the szip library was also required. Its true that its required for HDF, not for this code particularly, but its still useful to know.\r\n<LI>When building and installing these libraries, build and install them in this order: netcdf, szip, hdf, minc2.\r\n<LI>When linking the provided code, i found that the following link order worked \r\n<CODE><.o files> ... other stuff.... -lminc2 -lnetcdf -lhdf5 -lsz -lz </CODE>\r\n</OL>\r\n\r\n<b>Code Quality:</b>\r\nThe authors name and affiliation only appears in the .h file, not at the top of the .cxx file. The test file does not seem to meet the ITK testing standard of testing every method thoroughly. Beyond that, I did not read the code in detail.\r\n\r\n<b>Suggestions for future work:</b>\r\nI think that a more thorough test strategy would be needed to verify the code. As an example, minc is capable of storing data internally in any orientation and order (that is xyz, zyx, row major, column major, etc). I have seen other minc reading code work (using the minc1.4 library) on some orders and not others, so a thorough testing is required. Same applies for different numbers of dimensions, and different types of data (byte, int, etc).\r\n\r\nAdding the Factory classes would be very useful. \r\n\r\nA CMAKE build script, or instructions for modding the ITK CMakeList would also be helpful.\r\n\r\nIs the code intended to read MINC version 1 files? The minc2 library should be capable of it and this would be useful. \r\n\r\n<b>Additional Comments:</b>\r\nI think that this is an extremely useful contribution. Once tested and shown to be reliable, i would probably use this daily in my work. The MINC tools provide a valuable set of open source medical imaging tools, complementary to ITK. Furthermore, there is much data available in MINC, and the conversion process into a format that ITK can read and vice versa is time-consuming and risks losing data. \r\n\r\nWith regard to the paper itself, it would be important to add the author and date somewhere. It is not obvious how to contact the author. Style and grammar wise there are some issues, but as the main contribution is the code, i consider this relatively less important.",
        "date": "12-09-2005",
        "review_id": 138
      },
      {
        "author": {
          "author_email": "mathieu.malaterre@gmail.com",
          "author_firstname": "Mathieu",
          "author_id": 310,
          "author_lastname": "Malaterre"
        },
        "content": "<b>Summary:</b>\r\nThis is submission to add support for MINC2 file format for the Insight toolkit.\r\n \r\n<b>Evidence:</b>\r\nAuthor provide the standard mechanism in ITK to read and write IO file (lacking the factory, but author seems to have it).\r\n\r\n<b>Open Science:</b>\r\nThe work is reproducible.\r\n\r\n<b>Reproducibility:</b>\r\nI did download, compile and run the code (test example + demo file). Nothing is described to let people know about expected result.\r\n\r\n#1. The code is missing a CMakeLists.txt file. Here is the one I used:\r\n---------------------------------------------------------------------------------------------------\r\nPROJECT(ITKMINC)\r\nFIND_PACKAGE(ITK REQUIRED)\r\nINCLUDE(${ITK_USE_FILE})\r\nINCLUDE(${ITKMINC_SOURCE_DIR}/FindMINC2.cmake)\r\nINCLUDE_DIRECTORIES(${MINC2_INCLUDE_DIR})\r\nADD_EXECUTABLE(itkminc itkMINC2ImageIOTest.cxx itkMINC2ImageIO.cxx)\r\nTARGET_LINK_LIBRARIES(itkminc ITKIO ${MINC2_LIBRARIES} hdf5 netcdf)\r\n---------------------------------------------------------------------------------------------------\r\n\r\nand I also wrote a FindMINC2.cmake since the library is not so standard (very new)\r\n\r\n---------------------------------------------------------------------------------------------------\r\nFIND_PATH(MINC2_INCLUDE_DIR minc2.h\r\n/usr/include\r\n/usr/local/include\r\n)\r\nFIND_LIBRARY(MINC2_LIBRARIES minc2\r\n/usr/lib\r\n/usr/local/lib\r\n)\r\n---------------------------------------------------------------------------------------------------\r\n\r\nThen on a regular debian system you also need to install the following package:\r\nnetcdfg-dev\r\nlibhdf5-serial-dev\r\nRecommended package are:\r\nminc-tools\r\nhdf5-tools\r\n(although minc-tools only support minc1 file).\r\n\r\nI ran into multiple compilation issues, first one is none const correctness which is a big issue for ITK. I made some change to the code to replacer \\\\\\'char*\\\\\\' with std::string and char** with std::vector<std::string>\r\nThis affect: GetDimensionOrder / SetDimensionOrder\r\nFurthermore m_DimensionOrder was leaking (not destroyed in destructor) replacing it with std::string, ensure both const correctness and prevent memory leak. Same problem with m_DimensionName (never deleted).\r\nThen the test file try to includes: itkMINC2ImageIOFactory.h which not available, removing the guilty line fix the compilation\r\nThere is problem with #define MINC2_MAXDIM 10 what does it refers to ? This is only in the cxx, and not header, this cannot be user driven. More comment should be made about this #define\r\nEven after all those patch the code compiles with lots of warnings:\r\n\r\n/tmp/minc/itkMINC2ImageIO.cxx: In member function \\\\\\'virtual void itk::MINC2ImageIO::Read(void*)\\\\\\':\r\n/tmp/minc/itkMINC2ImageIO.cxx:111: warning: comparison between signed and unsigned integer expressions\r\n/tmp/minc/itkMINC2ImageIO.cxx: In member function \\\\\\'virtual void itk::MINC2ImageIO::ReadImageInformation()\\\\\\':\r\n/tmp/minc/itkMINC2ImageIO.cxx:253: warning: comparison between signed and unsigned integer expressions\r\n/tmp/minc/itkMINC2ImageIO.cxx:354: warning: comparison between signed and unsigned integer expressions\r\n/tmp/minc/itkMINC2ImageIO.cxx: In member function \\\\\\'virtual void itk::MINC2ImageIO::Write(const void*)\\\\\\':\r\n/tmp/minc/itkMINC2ImageIO.cxx:474: warning: comparison between signed and unsigned integer expressions\r\n/tmp/minc/itkMINC2ImageIO.cxx:479: warning: unused variable \\\\\\'dimseparation\\\\\\'\r\n/tmp/minc/itkMINC2ImageIO.cxx:480: warning: unused variable \\\\\\'dimstart\\\\\\'\r\n/tmp/minc/itkMINC2ImageIO.cxx:581: warning: comparison between signed and unsigned integer expressions\r\n/tmp/minc/itkMINC2ImageIO.cxx:538: warning: unused variable \\\\\\'minval\\\\\\'\r\n/tmp/minc/itkMINC2ImageIO.cxx:539: warning: unused variable \\\\\\'maxval\\\\\\'\r\n/tmp/minc/itkMINC2ImageIO.cxx:541: warning: unused variable \\\\\\'nChannels\\\\\\'\r\n/tmp/minc/itkMINC2ImageIO.cxx: At global scope:\r\n/tmp/minc/itkMINC2ImageIO.cxx:593: warning: unused parameter \\\\\\'fileName\\\\\\'\r\n/tmp/minc/itkMINC2ImageIO.cxx:593: warning: unused parameter \\\\\\'buffer\\\\\\'\r\n/tmp/minc/itkMINC2ImageIO.cxx: In member function \\\\\\'void itk::MINC2ImageIO::SetSliceScalingFromLocalScaling(mivolume*)\\\\\\':\r\n/tmp/minc/itkMINC2ImageIO.cxx:631: warning: comparison between signed and unsigned integer expressions\r\n/tmp/minc/itkMINC2ImageIO.cxx:636: warning: comparison between signed and unsigned integer expressions\r\n\r\nRunning through valgrind lead to the following memory leak:\r\nRunning the example throught valgrind lead to the following problems:\r\n\r\n==22892== Conditional jump or move depends on uninitialised value(s)\r\n==22892== at 0x80AB747: _miget_volume_class (volume.c:885)\r\n==22892== by 0x80ABFBB: miopen_volume (volume.c:1061)\r\n==22892== by 0x809A392: itk::MINC2ImageIO::ReadImageInformation() (itkMINC2ImageIO.cxx:190)\r\n==22892== by 0x80945BE: itk::ImageFileReader<itk::Image<unsigned short, 3>, itk::DefaultConvertPixelTraits<unsigned short> >::GenerateOutputInformation() (itkImageFileReader.txx:138)\r\n==22892== by 0x475BF12: itk::ProcessObject::UpdateOutputInformation() (itkProcessObject.cxx:690)\r\n==22892== by 0x8083FFD: itk::ImageBase<3>::UpdateOutputInformation() (itkImageBase.txx:174)\r\n==22892== by 0x471692F: itk::DataObject::Update() (itkDataObject.cxx:342)\r\n==22892== by 0x475BFCC: itk::ProcessObject::Update() (itkProcessObject.cxx:554)\r\n==22892== by 0x806E804: main (itkMINC2ImageIOTest.cxx:71)\r\n\r\nInspecting result, using the micnc tools still gives some errors are reported:\r\n$ mincstats LF2.mnc\r\n*** /tmp/minc-install/bin/mincstats - reported max (6) doesn\\\\\\'t equal header (255)\r\n$ mincstats test5.mnc\r\n*** /tmp/minc-install/bin/mincstats - reported max (0.0015259) doesn\\\\\\'t equal header (1)\r\n\r\n\r\n<b>Use of Open Source Software:</b>\r\nThe provided code will allow the open source ITK package to read the file format of the open source MINC tools. It is entirely open source based.\r\n\r\n<b>Open Source Contributions:</b>\r\nAuthor did provide part of the code they use. More code need to be sent for full integration into ITK. See Reproducibility for problems at compile time.\r\n\r\n<b>Code Quality:</b>\r\nOn overall the code did not respect ITK coding style ( identation, comment, use of cerr instead of itkDebugMacro). there are at least two functions not used:\r\nReadVolume and WriteSlice. There are some commented code at toplevel of cxx file.\r\n\r\nThe code itself might also be leaking since I can see a:\r\n midimhandle_t *hdims = new midimhandle_t[m_NDims];\r\nbut nowhere can I find a delete[]\r\n\r\nAnd a minor problem is the use of const char pointer instead of cstring:\r\n const char *vname = \\\\\\\"vector_dimension\\\\\\\";\r\nshould be\r\n const char vname[] = \\\\\\\"vector_dimension\\\\\\\";\r\n\r\nLast point: the code is not PIMPLed. This means that ITK will have to include netcdf, hdf and minc header file every time one include the itkMINC2 header.\r\n\r\n<b>Suggestions for future work:</b>\r\nThe code should be reviewed by author for next submission. More test should be written to. In particular it should not segfault on minc1 file. Commented code should go away, unused code too.\r\nAlso submission to Insight Journal require the use of template. As far as I understand this is not the case:\r\nhttp://www.itk.org/Wiki/ITK_Procedure_for_Contributing_New_Classes_and_Algorithms#How_to_Prepare_a_Submission_to_the_Insight_Journal\r\n\r\n<b>Additional Comments:</b>\r\nAs usual file format are the entry point to ITK world and therefore is always very welcome. \r\nAs a side note the external libraries involve are huge, therefore I would delay until some agreement is made for which library actually goes into ITK.\r\n",
        "date": "02-03-2006",
        "review_id": 173
      },
      {
        "author": {
          "author_email": "richard.beare@ieee.org",
          "author_firstname": "Richard",
          "author_id": 197,
          "author_lastname": "Beare"
        },
        "content": "<b>Summary:</b>\r\nThis paper introduces IO support for MINC 2.0 images. MINC, from the Montreal Neurological Institute, is a format derived from netcdf and hdf5, and there is a range of valuable tools that will be much more accessible if the file format is usable from ITK. \r\n\r\n<b>Evidence:</b>\r\nThe authors provides example data files and sample code. There is no confirmation that the data is correct once loaded - This could be done using the other minc tools, or ImageCompare.\r\n\r\n<b>Open Science:</b>\r\nThe work adheres to Open Science principles.\r\n\r\n<b>Reproducibility:</b>\r\nI was successful in reproducing the work.\r\n\r\n<b>Use of Open Source Software:</b>\r\nThe minc libraries are open source and use other open source tools.\r\n\r\n<b>Open Source Contributions:</b>\r\nYes, but see suggestions for future work.\r\n\r\n<b>Suggestions for future work:</b>\r\nWhile this contribution is a very good start, it isn\\\\\\'t fully integrated into the toolkit. It would be a great benefit if it was. Other reviewers have recommended ways in which the end user can carry out this integration, and I had much the same experience. I would strongly encourage ITK developers to look at including support for MINC2 directly in ITK, because there are a variety of valuable applications from MNI that work with minc format images. \r\n\r\nI discovered incompatibility problems between the code included in this project and various versions of the minc2 libraries. It appears that the most recent version of minc2 changed the API slightly, resulting in compilation errors for this project. Earlier versions had problems with some releases of hdf5. I hope that these are issues that will get sorted out with time.\r\n\r\n\r\n<b>Additional Comments:</b>\r\nA good start for what should become a very valuable contribution.",
        "date": "07-03-2006",
        "review_id": 233
      }
    ],
    "revisions": [
      {
        "article": "bafkreigdimlbaal722ytuzylccl2xcosbuoqd7alscj3wl6cmyjoimtczm",
        "dapp": null,
        "dataset": null,
        "doi": null,
        "handle": "1926/147",
        "source_code": null,
        "source_code_git_ref": null
      }
    ],
    "source_code_git_repo": null,
    "submitted_by_author": {
      "author_email": "baghdadi@phenogenomics.ca",
      "author_firstname": "Leila",
      "author_fullname": "Baghdadi, Leila",
      "author_id": 7,
      "author_institution": "MICe Imaging Centre",
      "author_lastname": "Baghdadi"
    },
    "tags": [
      "software",
      "programming"
    ],
    "title": "MINC2.0 IO Support for ITK"
  }
}