{
 "publication": {
  "abstract": "We propose a new MAP-based technique for the unsupervised segmentation of different brain structures (white matter, gray matter, etc.) from T1-weighted MR brain images. In this paper, we follow a procedure like most conventional approaches, in which T1-weighted MR brain images and desired maps of regions (white matter, gray matter, etc.) are modeled by a joint Markov-Gibbs Random Field model (MGRF) of independent image signals and interdependent region labels. However, we specifically focus on the most accurate model identification that can be achieved. The proposed joint MGRF model accounts for the following three descriptors: i) a 1st-order visual appearance descriptor(empirical distribution of signal intensity), ii) a 3D probabilistic shape prior, and iii) a 3D spatially invariant 2nd-order homogeneity descriptor. To better specify the 1st-order visual appearance descriptor, each empirical distribution of signals is precisely approximated by a Linear Combination of Discrete Gaussians (LCDG) having both positive and negative components. The 3D probabilistic shape prior is learned using a subset of 3D co-aligned training T1-weighted MR brain images. The 2nd-order homogeneity descriptor is modeled by a 2nd-order translation and rotation invariant MGRF of 3D T1-weighted MR brain region labels with analytically estimated potentials. The initial segmentation, based on a 1st-order visual appearance and 3D probabilistic shape, is then iteratively refined using a 3D MGRF model with analytically estimated potentials. Experiments on twelve 3D T1-weighted MR brain images confirm the high accuracy of the proposed approach.",
  "authors": [
   {
    "author_fullname": "Alansary, Amir",
    "author_place": 2,
    "persona_email": "amalan01@louisville.edu",
    "persona_firstname": "Amir",
    "persona_id": 8765,
    "persona_lastname": "Alansary"
   },
   {
    "author_fullname": "Soliman, Ahmed",
    "author_place": 3,
    "persona_email": "ahmedsoli@gmail.com",
    "persona_firstname": "Ahmed",
    "persona_id": 8726,
    "persona_lastname": "Soliman"
   },
   {
    "author_fullname": "Khalifa, Fahmi",
    "author_place": 4,
    "persona_id": null
   },
   {
    "author_fullname": "Elnakib, Ahmed",
    "author_place": 5,
    "persona_id": null
   },
   {
    "author_fullname": "Mostapha, Mahmoud",
    "author_place": 6,
    "persona_id": null
   },
   {
    "author_fullname": "Nitzken, Matthew",
    "author_place": 7,
    "persona_id": null
   },
   {
    "author_fullname": "Casanova, Manuel",
    "author_place": 8,
    "persona_id": null
   },
   {
    "author_fullname": "El-Baz, Ayman",
    "author_place": 9,
    "persona_id": null
   }
  ],
  "categories": [
   "Atlas-based segmentation",
   "Bayesian Decision Theory",
   "Density Estimation"
  ],
  "comments": [],
  "date_submitted": "2013-10-22 10:34:47",
  "handles": [
   {
    "handle": "10380/3440",
    "handle_url": "http://hdl.handle.net/10380/3440"
   }
  ],
  "identifiers": {
   "doi": null,
   "pubmed": null
  },
  "journals": [
   {
    "journal_id": 41,
    "journal_name": "MICCAI 2013 Workshops"
   }
  ],
  "license": "You are licensing your work to Kitware Inc. under the\nCreative Commons Attribution License Version 3.0.\n\nKitware Inc. agrees to the following:\n\nKitware is free\n * to copy, distribute, display, and perform the work\n * to make derivative works\n * to make commercial use of the work\n\nUnder the following conditions:\n\\\"by Attribution\\\" - Kitware must attribute the work in the manner specified by the author or licensor.\n\n * For any reuse or distribution, they must make clear to others the license terms of this work.\n * Any of these conditions can be waived if they get permission from the copyright holder.\n\nYour fair use and other rights are in no way affected by the above.\n\nThis is a human-readable summary of the Legal Code (the full license) available at\nhttp://creativecommons.org/licenses/by/3.0/legalcode",
  "publication_id": 904,
  "reviews": [],
  "submitted_by_author": {
   "author_email": "amalan01@louisville.edu",
   "author_firstname": "Amir",
   "author_fullname": "Alansary, Amir",
   "author_id": 8765,
   "author_institution": "University of Louisville, Louisville, Kentucky, USA.",
   "author_lastname": "Alansary"
  },
  "tags": [
   "T1-weighted MR Brain Segmentation",
   "3D Probabilistic Shape",
   "MGRF"
  ],
  "title": "MAP–Based Framework for Segmentation of MR Brain Images Based on Visual Appearance and Prior Shape"
 }
}