{
  "publication": {
    "abstract": "Meaningful physical models are important for studying cardiac physiology, such as quantitative assessments of pathology via changes in model parameters, and recovering information from medical images. In order to achieve realistic deformation studies, an anatomically accurate cardiac model under the prolate spheroidal coordinate system has been proposed, which comprises the pole-zero constitutive law characterized by 18 material parameters. Nevertheless, the large number of parameters and the complicated mathematics under the curvilinear coordinate system make it difficult to implement and computationally expensive. In consequence, we propose a cardiac model under the cartesian coordinate system comprising the Costa law, which is tailored for medical image analysis. The Costa law is characterized by a strain energy function with only seven material parameters, but has been reported as the best among the five tested well-known models in a comparative study, including the pole-zero law. In our framework, the penalty method for material incompressibility is used to avoid introduction of extra variables. Furthermore, we introduce a simple but novel boundary condition for enforcing cardiac specific boundary displacements under the cartesian coordinate system. With the active stresses provided by cardiac electromechanical models, and also the blood pressures acting as the natural boundary conditions on the endocardial surfaces, the physiologically plausible active deformation of the heart can be simulated. Experiments have been done on a cubical object to verify the correctness of the implementation, and also on a canine heart architecture to show the physiological plausibility of the cardiac model.",
    "articles": [
      "bafybeicnkm3xu5ffix44wdqwkabpvdq5oru632gufrqdjzcruyxdy4ktii",
      null,
      "bafybeig6bqtxv6riv3kurv4lecvkizggotsbhuls7y44tkh7rl7zj2c4m4"
    ],
    "authors": [
      {
        "author_fullname": "Wong, Ken C.L.",
        "author_place": 1,
        "persona_email": "kenclwong@mail.rit.edu",
        "persona_firstname": "Ken c. l.",
        "persona_id": 836,
        "persona_lastname": "Wong"
      },
      {
        "author_fullname": "Wang, Linwei",
        "author_place": 2,
        "persona_email": "maomaowlw@mail.rit.edu",
        "persona_firstname": "Linwei",
        "persona_id": 868,
        "persona_lastname": "Wang"
      },
      {
        "author_fullname": "Wang, Linwei",
        "author_place": 2,
        "persona_email": "li_wang@med.unc.edu",
        "persona_firstname": "Li",
        "persona_id": 9407,
        "persona_lastname": "Wang"
      },
      {
        "author_fullname": "Zhang, Heye",
        "author_place": 3,
        "persona_email": "heye.zhang@auckland.ac.nz",
        "persona_firstname": "Heye",
        "persona_id": 894,
        "persona_lastname": "Zhang"
      },
      {
        "author_fullname": "Liu, Huafeng",
        "author_place": 4,
        "persona_id": null
      },
      {
        "author_fullname": "Shi, Pengcheng",
        "author_place": 5,
        "persona_email": "shi_p_p@yeah.net",
        "persona_firstname": "Pengpeng",
        "persona_id": 9535,
        "persona_lastname": "Shi"
      }
    ],
    "categories": [
      "Data Representation",
      "Derivatives and Integrals",
      "Image",
      "Linear Algebra",
      "Mathematics"
    ],
    "comments": [],
    "date_submitted": "2008-05-21T21:31:44Z",
    "journals": [
      {
        "journal_id": 33,
        "journal_name": "MICCAI 2008 Workshops"
      }
    ],
    "license": "You are licensing your work to Kitware Inc. under the\nCreative Commons Attribution License Version 3.0.\n\nKitware Inc. agrees to the following:\n\nKitware is free\n * to copy, distribute, display, and perform the work\n * to make derivative works\n * to make commercial use of the work\n\nUnder the following conditions:\n\\\"by Attribution\\\" - Kitware must attribute the work in the manner specified by the author or licensor.\n\n * For any reuse or distribution, they must make clear to others the license terms of this work.\n * Any of these conditions can be waived if they get permission from the copyright holder.\n\nYour fair use and other rights are in no way affected by the above.\n\nThis is a human-readable summary of the Legal Code (the full license) available at\nhttp://creativecommons.org/licenses/by/3.0/legalcode",
    "publication_id": 556,
    "reviews": [
      {
        "author": {
          "author_email": "a.young@auckland.ac.nz",
          "author_firstname": "Alistair",
          "author_id": 882,
          "author_lastname": "Young"
        },
        "content": "<br /><span><font face=\"Times New Roman\" size=\"2\">This paper presents a mechanical simulation of heart mechanics, for analysis of medical images. A Cartesian coordinate system is employed with the Costa nonlinear hyperelastic material law. This is an interesting attempt to apply non-linear hyperelastic large strain mechanics to the modelling of heart wall motion. The application to parameter estimation and motion recovery is left to future work. The technique used for solving the nonlinear system of equations looks interesting. The paper would benefit from validation with motions derived from cardiac images using standard methods.&nbsp;</font></span><span><font face=\"Times New Roman\" size=\"2\">&nbsp;</font></span><span><font face=\"Times New Roman\" size=\"2\">&nbsp;</font></span> <p style=\"margin: 0cm 0cm 0pt; text-align: justify\" class=\"MsoNormal\"><span><font face=\"Times New Roman\" size=\"2\">References</font></span></p><span><font face=\"Times New Roman\" size=\"2\">&nbsp;</font></span> <ol style=\"margin-top: 0cm\"><li class=\"MsoNormal\" style=\"margin: 0cm 0cm 0pt; tab-stops: list 36.0pt\"><span><font size=\"2\"><font face=\"Times New Roman\"><span>&nbsp;</span>&ldquo;we are the first one to implement the Costa law up the ventricular level&rdquo; &ndash; such statements of priority are generally best avoided, and I believe others have published Costa implementations in realistic ventricular geometries (eg Costa <em>et al</em> Phil Trans R Soc Lond A 2001 359:1233-1250). Perhaps you mean Costa law in an active electromechanical model?</font></font></span></li><li class=\"MsoNormal\" style=\"margin: 0cm 0cm 0pt; tab-stops: list 36.0pt\"><span><font face=\"Times New Roman\" size=\"2\">&ldquo;we could not find any relevant literature which specifies&hellip;&rdquo; the displacement normal to the surface &ndash; see Sermesant <em>et al</em> IEEE TMI 25:612-625;2006.</font></span></li></ol><span><font face=\"Times New Roman\" size=\"2\">&nbsp;</font></span>",
        "date": "06-30-2008",
        "review_id": 1489
      },
      {
        "author": {
          "author_email": "martyn.nash@auckland.ac.nz",
          "author_firstname": "Martyn",
          "author_id": 883,
          "author_lastname": "Nash"
        },
        "content": " <p class=\"MsoNormal\"><span>Comments to the manuscript:</span></p> <p style=\"text-align: justify\" class=\"MsoNormal\"><span> </span></p> <p style=\"text-align: justify\" class=\"MsoNormal\"><span>This manuscript describes methods for simulating mechanics of the cardiac ventricles.<span> </span>The authors use finite deformation hyperelasticity with an orthotropic constitutive relation, and linearize and solve the governing nonlinear equations using total-Lagrangian system dynamics.<span> </span>They present a limited validation study in order to verify their implementation, followed by a simulation of ventricular systole that is only qualitatively compared to a limited set of MR images. Intro/Methods/Results sections are presented rather well, however Discussion of the findings and limitations are overly brief or non-existent.</span></p> <p style=\"text-align: justify\" class=\"MsoNormal\"><span> </span></p> <p style=\"text-align: justify\" class=\"MsoNormal\"><span>The authors claim to be the first to implement an orthotropic exponential constitutive relation (&ldquo;Costa law&rdquo;) at the ventricular level [Intro: last parag], however the UCSD group have published several studies on the use of orthotropic exponential constitutive relations for whole ventricle mechanics (e.g. Usyk et al. Journal of Elasticity 61:143&ndash;164, 2000; which also uses the penalty method for incompressibility). <span> </span>Throughout the manuscript, the authors repeatedly highlight some issues regarding one previous study (ref [9]), such as the choice of constitutive relation (&ldquo;pole-zero law&rdquo;) and coordinate system (&ldquo;prolate spheroidal coordinates&rdquo;). Instead, they would do better to concentrate on the/novel aspects of their own work &ndash; noting that models using Cartesian coordinates (e.g. Vetter et al., Annals of Biomedical Engineering, 28:781&ndash;792, 2000), and orthotropic material relations (e.g. Usyk et al., as above) have been widely studied. </span></p> <p style=\"text-align: justify\" class=\"MsoNormal\"><span> </span></p> <p style=\"text-align: justify\" class=\"MsoNormal\"><span>The authors also claim that their representation of the constraint that the pericardial sac places on wall motion is novel. However, the use of this choice of boundary conditions is remains to be quantitatively validated against experimental recordings or medical images (more on this below). Furthermore, a similar constraint was previously described by the INRIA group (Sermesant et al.).<span> </span></span></p> <p style=\"text-align: justify\" class=\"MsoNormal\"><span> </span></p> <p style=\"text-align: justify\" class=\"MsoNormal\"><span>Perhaps the main novelty of this study is the use of total-Lagrangian system dynamics numerical methods for cardiac electro-mechanics, but this requires further validation (more on this below). It would be interesting to quantitatively compare over multiple heart cycles the accuracy of this technique against that of the more traditional implicit finite element methods. </span></p> <p style=\"text-align: justify\" class=\"MsoNormal\"><span> </span></p> <p style=\"text-align: justify\" class=\"MsoNormal\"><span>The validation studies presented here are inadequate. A deformation study involving simple shear is presented. Analytical homogenous data are compared against numerical (finite element) non-homogeneous model predictions (Fig 1a shows non-homogeneous deformation). Thus two different types of deformation are being compared. Also of concern is: &ldquo;yet the errors increase when the deformation becomes large&rdquo; (parag. below Eq.14) &ndash; this requires further investigation (e.g. did errors reduce with smaller step size?). Furthermore, this test is based on just one mode of deformation, which involves just 2 of the 6 independent components of the strain tensor. A full validation should include multiple modes of deformation involving the shear and normal components of strain. Perhaps a more appropriate and comprehensive closed-form solution is that of the pressure inflation, axial extension and torsion of a homogeneous, isotropic cylinder (eg. Rivlin 1950, Phil. Trans. A242: 173&ndash;195).<span> </span></span></p> <p style=\"text-align: justify\" class=\"MsoNormal\"><span> </span></p> <p style=\"text-align: justify\" class=\"MsoNormal\"><span>Finally, another major shortcoming of this manuscript is the distinct lack of quantitative validation against experimental/clinical measures of ventricular wall motion.<span> </span>Just one set of medical images are presented and the comparison against model predictions is limited to a few qualitative statements (see parag. below Fig 4). Such gross observations have been previously reproduced using axi-symmetric truncated ellipsoids (e.g. the Dutch groups of Arts, Bovendeerd, et al.). The use of a geometrically detailed biventricular model should be justified and validated using regional measures of wall motion (e.g. from tagged MRI).</span></p> <p style=\"text-align: justify\" class=\"MsoNormal\"><span> </span></p> <p style=\"text-align: justify\" class=\"MsoNormal\"><span>Specific minor comments:</span></p> <ul style=\"margin-top: 0cm\"><li class=\"MsoNormal\" style=\"text-align: justify\"><span>In several places, &ldquo;In consequence&rdquo; should be changed to -&gt; &ldquo;As a consequence&rdquo;.</span></li><li class=\"MsoNormal\" style=\"text-align: justify\"><span>Page 2, Intro, line 3: &ldquo;At the macroscopic&rdquo;</span></li><li class=\"MsoNormal\" style=\"text-align: justify\"><span>Page 2, Intro, line 10: &ldquo;apart from&rdquo; -&gt; &ldquo;as well as&rdquo;</span></li><li class=\"MsoNormal\" style=\"text-align: justify\"><span>Page 2, bottom: last line &ldquo;Furthermore, &hellip;&rdquo; needs rewording.</span></li><li class=\"MsoNormal\" style=\"text-align: justify\"><span>Page 3, bottom: last line &ldquo;The f-n-s, &hellip;&rdquo; needs rewording.</span></li><li class=\"MsoNormal\" style=\"text-align: justify\"><span>Page 4, &ldquo;Elasticity Tensor&rdquo;, line 3: &ldquo;stain&rdquo; -&gt; &ldquo;strain&rdquo;</span></li><li class=\"MsoNormal\" style=\"text-align: justify\"><span>Page 5, eq (8): there are other nearly incompressible formulations. Cite a ref, and explain why this one was selected.</span></li><li class=\"MsoNormal\" style=\"text-align: justify\"><span>Page 5, Sec 2.3: it is unclear why you would want to &ldquo;impose transmural shear resistance&hellip;&rdquo;. This sentence is very unclear.<span> </span>Note that another (simpler?) way to approximate the effects would be to add an external traction constraint on the epicardium. Discuss pros/cons of this.</span></li><li class=\"MsoNormal\" style=\"text-align: justify\"><span>Page 9, line 1: &ldquo;20 frames&rdquo; of &ldquo;5 frames&rdquo; as pictured?</span></li><li class=\"MsoNormal\" style=\"text-align: justify\"><span>Page 9, bottom parag: the first 5-6 lines describes methods (and should thus be moved to Methods section) and takes material constants from a pig study. But at the bottom, there is a suggestion that these parameters are too stiff (&ldquo;stroke volume is very small&rdquo;). Thus, it would perhaps be better to use parameters for canine myocardium (e.g. from Usyk et al. Journal of Elasticity 61: 143&ndash;164, 2000). </span></li><li class=\"MsoNormal\" style=\"text-align: justify\"><span>Page 10, bottom: &ldquo;only the blood filling phase is included&rdquo;: this point is confusing and probably needs rewording. Suggests that the authors only studied diastole (however results for systole were also presented).</span></li></ul> <p style=\"text-align: justify\" class=\"MsoNormal\"><span> </span></p> <br /> <br /> ",
        "date": "07-04-2008",
        "review_id": 1496
      }
    ],
    "revisions": [
      {
        "article": "bafybeicnkm3xu5ffix44wdqwkabpvdq5oru632gufrqdjzcruyxdy4ktii",
        "dapp": null,
        "dataset": null,
        "doi": null,
        "handle": "10380/1368",
        "source_code": null,
        "source_code_git_ref": null
      }
    ],
    "source_code_git_repo": null,
    "submitted_by_author": {
      "author_email": "kenclwong@mail.rit.edu",
      "author_firstname": "Ken c. l.",
      "author_fullname": "Wong, Ken c. l.",
      "author_id": 836,
      "author_institution": "Rochester Institute of Technology",
      "author_lastname": "Wong"
    },
    "tags": [
      "cardiac physiome model",
      "hyperelastic material models",
      "cardiac dynamics"
    ],
    "title": "Simulation of Active Cardiac Dynamics with Orthotropic Hyperelastic Material Model"
  }
}