{
  "publication": {
    "abstract": "This paper describes a new open-source tutorial for image-guided therapy (IGT) and medical robotics that is both accessible and hands-on using the LEGO Mindstorms NXT (a commercially available robotics kit) and 3D Slicer (an open-source application for medical image processing). The tutorial covers all stages of a typical IGT or medical robotics procedure, including the concepts of imaging, preoperative planning, targeting and tracking, navigation and registration, by using the LEGO robot to perform a “needle biopsy” on a phantom (anatomical model) made of traditional LEGO pieces. In addition, this paper describes a C++ library that allows direct control of a LEGO Mindstorms NXT robot from a Linux computer over a USB connection.",
    "articles": [
      "bafybeieuherpoldc2g7afkzvvuyfmgtnxz3jlmslan4ov34qnsgta6ubni",
      "bafkreigqocj2xv3oltpn4co74aowrhvwocvirafnsuy6pzra3s5ukt2qh4",
      "bafybeieyd4elgxq2eohjjtwazy7tzgjyk77lmubnwnpbhsqwbsb4575wmi",
      "bafybeihvfq7qc52eqy3bazamrtrajdkif3itt74dt2rnfnnumh4x37675y",
      "bafybeihvfq7qc52eqy3bazamrtrajdkif3itt74dt2rnfnnumh4x37675y"
    ],
    "authors": [
      {
        "author_fullname": "Pace, Danielle F.",
        "author_place": 1,
        "persona_email": "danielle.pace@kitware.com",
        "persona_firstname": "Danielle",
        "persona_id": 643,
        "persona_lastname": "Pace"
      },
      {
        "author_fullname": "Kikinis, Ron",
        "author_place": 2,
        "persona_email": "kikinis@bwh.harvard.edu",
        "persona_firstname": "Ron",
        "persona_id": 238,
        "persona_lastname": "Kikinis"
      },
      {
        "author_fullname": "Hata, Nobuhiko",
        "author_place": 3,
        "persona_id": null
      }
    ],
    "categories": [
      "Data",
      "IO",
      "Registration",
      "Transforms"
    ],
    "comments": [],
    "date_submitted": "2007-07-01T00:00:00Z",
    "journals": [
      {
        "journal_id": 3,
        "journal_name": "The Insight Journal"
      }
    ],
    "license": "You are licensing your work to Kitware Inc. under the\nCreative Commons Attribution License Version 3.0.\n\nKitware Inc. agrees to the following:\n\nKitware is free\n * to copy, distribute, display, and perform the work\n * to make derivative works\n * to make commercial use of the work\n\nUnder the following conditions:\n\\\"by Attribution\\\" - Kitware must attribute the work in the manner specified by the author or licensor.\n\n * For any reuse or distribution, they must make clear to others the license terms of this work.\n * Any of these conditions can be waived if they get permission from the copyright holder.\n\nYour fair use and other rights are in no way affected by the above.\n\nThis is a human-readable summary of the Legal Code (the full license) available at\nhttp://creativecommons.org/licenses/by/3.0/legalcode",
    "publication_id": 171,
    "reviews": [
      {
        "author": {
          "author_email": "stephen.aylward@kitware.com",
          "author_firstname": "Stephen",
          "author_id": 1,
          "author_lastname": "Aylward"
        },
        "content": "<p><strong>Summary:</strong><br />This paper very clearly presents tutorials for building a LEGO-based robot and phantom for teaching and exploring the basics of image-guided robotic control for needle biospies. Also included is software for a C++ interface to the robot.</p><p>This project builds upon the LEGO Mindstorm robot and the NXT++ library for controlling that robot. The tutorials and papers also refer to a 3D Slicer v3 module for IGT.</p><p>The paper also includes an excellent evaluation of the accuracy of the robot given repeated applications of the tutorial script. </p><p>&nbsp;</p><p><strong>Methods:</strong><br />The instructions for building the phantom is outstanding. I am confident that if I had the LEGO pieces, then I could build it.</p><p>The tutorials are extremely well written and illustrated. They seem to be viable for a wide range of ages and backgrounds. These tutorials exceed the standard for open-source teaching materials. Basic and advanced tutorials are presented.</p><p>The instructions for building the robot seem to be missing.</p><p>The instructions for accessing (i.e., the code for) the Slicer 3D module are missing. A Google search does not reveal the &quot;Lego Module&quot; for Slicer. As a result, the basic and advanced tutorials cannot be replicated. </p><p>The robot control software included with the tutorial is a modified version of the NXT++ library.<br />1) The authors have ported the NXT++ library to 64-bit linux systems which is important for IGT research/environments<br />2) The NXT++ library is GPL licensed and therefore the included code is GPL licensed, however those licensing terms are never given in the code.<br />3) The code claims to be copyrighted by the Insight Software Consortium - but it is not. A legitimate copyright needs to be declared.</p><p>&nbsp;</p><p><strong>Results:</strong><br />Once the missing pieces are provided (LEGO-pun intended), this tutorial will be the highlight of many high-school, college, graduate, and perhaps even medical school courses. </p><p>As the authors point out, the focus of the tutorials is not robot building, but instead it is on IGT theory (planning, calibration, registration, and control). The concepts of error measurement presented in the paper are also excellent companionS to the how-to nature of the tutorials. When those topics are to be discussed in a classroom, the tutorials discussed provide a unique hands-on / real-world method for conveying the key concepts.</p><p>&nbsp;</p><p><strong>Conclusion</strong>:</p><p>The material provided sets a high standard for the presentation and evaluation of tutorial materials in a field (IGT) that desperately needs broadly useful educational materials. Furthermore, the use of LEGOs makes the tutorials cost effective and &quot;friendly&quot; to make IGT more accessible.</p><p>The absence of two key pieces (robot building instructions and the Slicer module) inhibit the actual use of the tutorial material, but hopefully the authors can quickly correct this oversight. </p>",
        "date": "09-10-2007",
        "review_id": 551
      },
      {
        "author": {
          "author_email": "marfGm@gmail.com",
          "author_firstname": "Miguel Angel",
          "author_id": 445,
          "author_lastname": "Rodriguez-Florido"
        },
        "content": "<p><strong>Summary:</strong><br />This paper presents a good system to teach technical students in the medical image computing area. They present a low cost robotic system that is driven by the open source software Slicer. Although, at this moment, they don&#39;t provide the user guide to build the robot, and the CT dataset of the phantom, they explain how they use it and how to use it.<br /> <strong>Open Science:</strong><br />This is an example of Open Science because they present a system that uses open source software and they describe a low cost robotic system, that could be bought for any research group. However is very important to add the guide to build the system and the CT dataset of the phantom<br /><strong>Reproducibility:</strong><br />I would like to reproduce the results, but although I&#39;m going to buy the LEGO system, I need the user guide to build the robot. I could be great to have the CT dataset of the phantom too.&nbsp;<br /><strong>Use of Open Source Software:</strong><br />They use open source software (Slicer) and they provide the software associated to the LEGO system. It could be great to provide the VTK Slicer module (at least at the svn slicer site) to reproduce the system.<br /><strong>Open Source Contributions:</strong><br />They provide some code, but it would be great to provide the VTK Slicer module.&nbsp;<br /><strong>Code Quality:</strong><br />It is well commented.<br /><strong>Applicability to other problems:</strong><br />How we are using slicer for medical students education, we would like to use this system. At this moment, we need the VTK Slicer module and the CT dataset of the phantom.<br /> <strong>Requests for additional information from authors:</strong><br />I&#39;ve read that authors are providing the user guide to build the robotic system. Also, we need the VTK Slicer module and perhaps the CT dataset. We would like to use it for education and teaching.&nbsp;<br /><strong>Additional Comments:</strong><br />Nice work.</p><p>&nbsp;</p>",
        "date": "10-02-2007",
        "review_id": 586
      },
      {
        "author": {
          "author_email": "danielle.pace@kitware.com",
          "author_firstname": "Danielle",
          "author_id": 643,
          "author_lastname": "Pace"
        },
        "content": "<p>Please note that this submission contains documents (including source code, documentation, tutorial slides, etc) that were up-to-date as of October 2007.</p><p>Continuted improvements and updates to this project will be maintained on the NA-MIC wiki at:</p><p><a href=\\\"http://wiki.na-mic.org/Wiki/index.php/LEGO_IGT_and_Medical_Robotics_Tutorial\\\">http://wiki.na-mic.org/Wiki/index.php/LEGO_IGT_and_Medical_Robotics_Tutorial</a></p><p>and will not be reflected on this page.&nbsp; Please refer to the website above for the most current files.</p><p>-Danielle Pace</p><p>&nbsp;</p>",
        "date": "01-18-2008",
        "review_id": 636
      },
      {
        "author": {
          "author_email": "holmes.david3@mayo.edu",
          "author_firstname": "David",
          "author_id": 20,
          "author_lastname": "Holmes"
        },
        "content": "<p><strong>&nbsp;Update:</strong></p><p>The authors have provided an outstanding contribution with this work.&nbsp; The revision includes everything that one would need to implement the tutorial.</p><p><strong>&nbsp;</strong><strong>Summary:</strong><br />The authors propose the use of the LEGO mindstorm and 3D&nbsp;slicer for teaching some of the concepts of Image-guided Therapy.&nbsp; The paper describes the LEGO system and some results from their initial experience.</p><p><br /><strong>Hypothesis:</strong><br />N/A</p><p><br /><strong>Evidence:</strong><br />The description of the LEGO system is reasonable, and the results suggest that it may be a viable teaching tool.</p><p><br /><strong>Open Science:</strong><br />This appears to be open science.&nbsp; The tools used are open.&nbsp; The LEGO system costs money, but as the authors point out, it is reasonable.&nbsp; There is great potential for teach with this tool.</p><p>&nbsp;</p><p><strong>Reproducibility:</strong><br />RESOLVED:&nbsp; While the authors provide some code for combining the LEGO system with 3D slice, the suggested teaching information is not available.&nbsp; Specifically, the authors, show a 3D robot but do not provide the design for it.&nbsp; The authors also talk about a phantom but do not provide the design.&nbsp; I cannot, at this point even with the LEGO system, recreate the system.</p><p><strong>Use of Open Source Software:</strong><br />All of the software described is open including the open interface to the LEGO system.&nbsp; The LEGO system does cost some money, but anyone can get it and it seems that the price is not outrageous.&nbsp; The potential applications of the LEGO system are great.</p><p><strong>Open Source Contributions:</strong><br />The main contribution should be the design of the phantom and robot for use in training along with the source code. This is unfortunately missing.</p><p><strong>Code Quality:</strong><br />The provided code is appropriately documented.</p><p><strong>Applicability to other problems:</strong><br />Once a person invests in the system, there are endless training possibilities.</p><p><strong>Suggestions for future work:</strong><br />RESOLVED: I think that a more detail curriculum with several lessons is warranted.</p><p><br /><strong>Requests for additional information from authors:</strong><br />RESOLVED: I fully recognize the great potential of this work, but request that the authors provide a description of how to build the phantom and robot as well as the proposed tutorial.&nbsp; I would like to use this for teaching.</p><p><br /><strong>Additional Comments:</strong><br />RESOLVED: Again, this is a great teaching tool.&nbsp; I commend the authors, but I don&#39;t have enough information to use it for teaching right now.</p>",
        "date": "09-06-2007",
        "review_id": 544
      }
    ],
    "revisions": [
      {
        "article": "bafybeiepxabn62lan7md242wlayvcrgkxi6snme5a6uoxakop35dekugdq",
        "citation_list": [
          {
            "doi": "10.1016/j.neuroimage.2007.04.026",
            "key": "ref1",
            "score": 206.12167,
            "unstructured": "Challenges in Image-Guided Therapy System Design+NeuroImage+37+Suppl 1+S144+S151+2007+S. DiMaio+K. Cleary+S. Aylward+P. Kazanzides+K. Vosburgh+R. Ellis+J. Duncan+K. Farahani+H. Lemke+T. Peters+W. Lorensen+D. Gobbi+J. Haller+L. Clarke+S. Pizer+R. Taylor+N. Hata+K. Lawson+C. Tempany+R. Kikinis+F. Jolesz"
          },
          {
            "key": "ref2",
            "score": 28.203772,
            "unstructured": "The ITK Software Guide. Kitware, Inc. ISBN 1-930934-10-6+2003+L. Ibanez+W. Schroeder"
          },
          {
            "doi": "10.1016/b978-012387582-2/50003-4",
            "key": "ref3",
            "score": 83.30175,
            "unstructured": "The Visualization Toolkit: An Object-Oriented Approach to 3D Graphics, 2nd ed+Kitware, Inc. ISBN 1-930934-12-2+1998+W. Schroeder+K. Martin+and W. Lorensen+Old Tappan+N.J."
          },
          {
            "doi": "10.1109/mc.2006.130",
            "key": "ref4",
            "score": 137.73158,
            "unstructured": "An Open Source Software Toolkit for Image-Guided Surgery+39+4+46+53+2006+K. Gary+L. Ibanez+S. Aylward+D. Gobbi+M.B. Blake+K. Cleary. IGSTK"
          },
          {
            "doi": "10.1007/978-3-540-75757-3_60",
            "key": "ref5",
            "score": 167.37459,
            "unstructured": "Application of Open Source Image Guided Therapy Software in MR-Guided Therapies+In Proceedings of the 10th International Conference on Medical Image Computing and Computer Assisted Intervention (MICCAI'07)+2007+N. Hata+S. Pieper+F. Jolesz+C. Tempany+P. Black+S. Morikawa+H. Iseki+M. Hashizume+R. Kikinis"
          },
          {
            "key": "ref6",
            "score": 26.787008,
            "unstructured": "[6] National Alliance for Medical Image Computing+2007"
          },
          {
            "key": "ref7",
            "score": 25.652925,
            "unstructured": "Slicer User Training 101: IGT Edition+2006+H. Liu+N. Hata"
          },
          {
            "doi": "10.1002/jmri.1139",
            "key": "ref8",
            "score": 141.31944,
            "unstructured": "An Integrated Visualization System for Surgical Planning and Guidance Using Image Fusion and an Open MR+Journal of Magnetic Resonance Imaging+13+6+967+975+2001+D. Gering+A. Nabavi+R. Kikinis+N. Hata+L. O 'Donnell+W. Eric L. Grimson+F. Jolesz+P. Black+W. Wells III"
          },
          {
            "key": "ref9",
            "score": 27.148586,
            "unstructured": "Designer is available for download at+Lego Digital"
          },
          {
            "doi": "10.1145/159544.159593",
            "key": "ref10",
            "score": 74.42478,
            "unstructured": "Behavior Construction Kits+Communications of the ACM+36+7+64+71+1993+M. Resnick"
          },
          {
            "doi": "10.1007/978-3-540-27835-1_21",
            "key": "ref11",
            "score": 137.7005,
            "unstructured": "Efficiency and Task Allocation in Prey Retrieval+In Proceedings of the Frist International Workshop on Biologically Inspired Approaches to Advanced Information Technology, Lecture Notes in Computer Science+3141+274+289+2004+T.H. Labella+M. Dorigo+J.L. Deneubourg"
          },
          {
            "key": "ref12",
            "score": 39.0386,
            "unstructured": "Rapid Prototyping for Interactive Robots+In Proceedings of the 8th Conference on Intelligent Autonomous Systems (IAS-8)+2004+C. Bartneck+J. Hu"
          },
          {
            "doi": "10.1145/563517.563345",
            "key": "ref13",
            "score": 130.84714,
            "unstructured": "A Case Study of LEGO Mindstorms'™ Suitability for Artificial Intelligence and Robotics Courses at the College Level+ACM SIGCSE Bulletin+34+1+8+12+2002+F. Klassner"
          },
          {
            "doi": "10.1109/fie.2001.963650",
            "key": "ref14",
            "score": 86.249016,
            "unstructured": "Using Robots in an Undergraduate Artificial Intelligence Course: An Experience Report. In Proceedings of the 31st Annual ASEE/IEEE Frontiers in Education Conference+2001+A.N. Kumar"
          },
          {
            "doi": "10.1109/fie.2002.1158731",
            "key": "ref15",
            "score": 110.6466,
            "unstructured": "Using First Lego League to Enhance Engineering Education and to Increase the Pool of Future Engineering Students+In Proceedings of the 32nd Annual ASEE/IEEE Frontiers in Education Conference+2002+D. Opplinger"
          },
          {
            "doi": "10.1109/robot.2000.844151",
            "key": "ref16",
            "score": 97.86292,
            "unstructured": "RoboCup Jr. with LEGO MINDSTORMS+In Proceedings of the IEEE International Conference on Robotics and Automation+1+1+813+819+2000+H.H. Lund+L. Pagliarini."
          },
          {
            "doi": "10.1109/mra.2003.1233551",
            "key": "ref17",
            "score": 94.00332,
            "unstructured": "From Science Projects to the Engineering Bench+IEEE Robotics & Automation Magazine+10+3+9+12+2003+O. Gerovich+R.P. Goldberg+and I.D. Donn"
          },
          {
            "key": "ref18",
            "score": 27.125202,
            "unstructured": "NXT Technology Overview+2007"
          },
          {
            "key": "ref19",
            "score": 59.30814,
            "unstructured": "Building Robots with Java Brains+ISBN 0973864915+2007+B. Bagnall. Maximum Lego+NXT+M.B. Canada"
          },
          {
            "key": "ref20",
            "unstructured": "Not"
          },
          {
            "key": "ref21",
            "score": 31.385729,
            "unstructured": " Bricx Command Center is available for download at http://bricxcc.sourceforge.net"
          },
          {
            "doi": "10.1227/00006123-200104000-00023",
            "key": "ref22",
            "score": 133.4913,
            "unstructured": "Fiducial Point Placement and the Accuracy of Point-based, Rigid Body Registration+48+4+810+817+2001+M.J. J.B. West+S.A. Fitzpatrick+C.R Maurer, Toms+R.J. Maciunas"
          },
          {
            "doi": "10.1571/cs3-16-06cc",
            "key": "ref23",
            "score": 110.54987,
            "unstructured": "2006+(included with the purchase of a LEGO Mindstorms NXT kit+LEGO The+Guide Group. LEGO Mindstorms User"
          },
          {
            "doi": "10.1571/cs3-16-06cc",
            "key": "ref24",
            "score": 70.235565,
            "unstructured": "The LEGO Mindstorms NXT robotics kit (#8527) and the LEGO Deluxe Brick Box (#6167) are available for purchase at"
          },
          {
            "key": "ref25",
            "score": 20.309921,
            "unstructured": "ie=UTF8&s=officeproducts+1+8+12+-"
          }
        ],
        "dapp": null,
        "dataset": null,
        "doi": null,
        "handle": "1926/567",
        "source_code": "bafybeiccen5tl25jumbupqo77dvgzskerngn5e5rjz2an72i2v2v2zec7e",
        "source_code_git_ref": null
      }
    ],
    "source_code_git_repo": null,
    "submitted_by_author": {
      "author_email": "danielle.pace@kitware.com",
      "author_firstname": "Danielle",
      "author_fullname": "Pace, Danielle",
      "author_id": 643,
      "author_institution": "Kitware Inc",
      "author_lastname": "Pace"
    },
    "tags": [
      "robotics",
      "image-guided therapy",
      "dissemination",
      "3D Slicer",
      "LEGO Mindstorms NXT",
      "education"
    ],
    "title": "An accessible, hands-on tutorial system for image-guided therapy and medical robotics using a robot and open-source software"
  }
}