{
  "publication": {
    "abstract": "Purpose\nThe lack of interfaces for system integration in the Operating Room (OR) has been recognized as one of the major factors to impede efficient OR turnover procedures as well as efficient intraoperative data handling and ergonomics in the OR. A software interface for application-layer connection between data processing units in the OR is presented.\nMethods\nThe requirements for data exchange in the OR were derived, mostly from the literature. A c++ class library was developed according to these requirements. The efficiency of the data exchange and the limits of the system were investigated by a series of experiments. An examplary application was built using the library to show its applicability under realistic conditions.\nResults\nWe present the software library TiCoLi for automatic OR network configuration, device and service discovery (\"surgical plug-and-play\"), message exchange, data streaming, and remote access to device parameters and functionalities through an Ethernet network. The system is based on a modular, object-oriented software design, which guarantees high flexibility regarding the adaptation of its subsystems to the needs of a particular clinical application.\nConclusions\nThe TiCoLi package is the first open source software library which was developed for system integration in the OR which covers message exchange, data streaming, and auto configuration.",
    "authors": [
      {
        "author_fullname": "Burgert, Oliver",
        "author_place": 1,
        "persona_email": "oliver.burgert@reutlingen-university.de",
        "persona_firstname": "Oliver",
        "persona_id": 8050,
        "persona_lastname": "Burgert"
      }
    ],
    "categories": [
      "IO",
      "Programming"
    ],
    "comments": [],
    "date_submitted": "2011-06-29 06:37:55",
    "journals": [
      {
        "journal_id": 31,
        "journal_name": "The MIDAS Journal"
      }
    ],
    "license": "You are licensing your work to Kitware Inc. under the\nCreative Commons Attribution License Version 3.0.\n\nKitware Inc. agrees to the following:\n\nKitware is free\n * to copy, distribute, display, and perform the work\n * to make derivative works\n * to make commercial use of the work\n\nUnder the following conditions:\n\\\"by Attribution\\\" - Kitware must attribute the work in the manner specified by the author or licensor.\n\n * For any reuse or distribution, they must make clear to others the license terms of this work.\n * Any of these conditions can be waived if they get permission from the copyright holder.\n\nYour fair use and other rights are in no way affected by the above.\n\nThis is a human-readable summary of the Legal Code (the full license) available at\nhttp://creativecommons.org/licenses/by/3.0/legalcode",
    "publication_id": 821,
    "reviews": [],
    "revisions": [
      {
        "article": "bafkreidrejz7lkprp7fij3jonamc5ifbdqypaud5skf5mlvnhghucu63wu",
        "dapp": null,
        "dataset": null,
        "doi": null,
        "handle": "10380/3291",
        "source_code": null,
        "source_code_git_ref": null
      }
    ],
    "source_code_git_repo": null,
    "submitted_by_author": {
      "author_email": "oliver.burgert@reutlingen-university.de",
      "author_firstname": "Oliver",
      "author_fullname": "Burgert, Oliver",
      "author_id": 8050,
      "author_institution": "Reutlingen University",
      "author_lastname": "Burgert"
    },
    "tags": [
      "Systems Interconnectivity",
      "Digital Operating Room",
      "Surgical Plug-and-Play",
      "Operating Room Integration"
    ],
    "title": "TiCoLi - An Open Software Library for Device Integration in the Digital OR based on Open Software and Open Standards"
  }
}