{
  "publication": {
    "abstract": "The Lung Tissue Research Consortium (LTRC) is an NHLBI sponsored project which is studying histological, radiological, and clinical data on patients with Chronic Obstructive Pulmonary Disease (COPD) and idiopathic pulmonary fibrosis (IPF). At completion, over 1200 subjects will be enrolled. Each subject will have a minimum of one CT scan; however, many will likely have 3 CT scans. Each scan will have a corresponding radiological report, clinical report, and histological report. The NHLBI requires that the data collected through the LTRC be anonymized and available to independent researchers. The LTRC imaging database will be the most comprehensive database of lung CT data available to date and will serve as the basis for imaging studies of chronic lung disease for years to come. It is a significant opportunity for the medical image analysis community to investigate this database with the intent to develop new methods of registration, segmentation, and classification that may be used to diagnosis and treat patients with diffuse lung disease.",
    "articles": [
      "bafkreibqwmqz55pef4ninw6f5oruc7ujeg2ooebfdjdvnuuj2igspy4wem",
      "bafkreidoourwznzk6f6iootreaei2cg7rbglceuusdwzhcpkckqusz3j6a"
    ],
    "authors": [
      {
        "author_fullname": "Bartholmai, Brian",
        "author_place": 1,
        "persona_id": null
      },
      {
        "author_fullname": "Karwoski, Ronald",
        "author_place": 2,
        "persona_id": null
      },
      {
        "author_fullname": "Zavaletta, Vanessa",
        "author_place": 3,
        "persona_id": null
      },
      {
        "author_fullname": "Robb, Richard",
        "author_place": 4,
        "persona_id": null
      },
      {
        "author_fullname": "Holmes, David R III",
        "author_place": 5,
        "persona_email": "holmes.david3@mayo.edu",
        "persona_firstname": "David",
        "persona_id": 20,
        "persona_lastname": "Holmes"
      }
    ],
    "categories": [],
    "comments": [],
    "date_submitted": "2006-07-01T00:00:00Z",
    "journals": [
      {
        "journal_id": 3,
        "journal_name": "The Insight Journal"
      }
    ],
    "license": "You are licensing your work to Kitware Inc. under the\nCreative Commons Attribution License Version 3.0.\n\nKitware Inc. agrees to the following:\n\nKitware is free\n * to copy, distribute, display, and perform the work\n * to make derivative works\n * to make commercial use of the work\n\nUnder the following conditions:\n\\\"by Attribution\\\" - Kitware must attribute the work in the manner specified by the author or licensor.\n\n * For any reuse or distribution, they must make clear to others the license terms of this work.\n * Any of these conditions can be waived if they get permission from the copyright holder.\n\nYour fair use and other rights are in no way affected by the above.\n\nThis is a human-readable summary of the Legal Code (the full license) available at\nhttp://creativecommons.org/licenses/by/3.0/legalcode",
    "publication_id": 109,
    "reviews": [
      {
        "author": {
          "author_email": "yi.gao@gatech.edu",
          "author_firstname": "Yi",
          "author_id": 468,
          "author_lastname": "Gao"
        },
        "content": "<b>Summary:</b>\r\nThis paper is about a NHLBI sponsored project, LTRC, which creates an open repository of histological, radiological, and clinical data for the studying of COPD and IPF.\r\n \r\n<b>Hypothesis:</b>\r\n1. Open this database will speed up the research process on lung diseases.\r\n2. Image processing community will benefit from the opening of data set.\r\n3. Base on same data set, both clinical and engineering researchers has a common platform to compare there results.\r\n\r\n<b>Evidence:</b>\r\nThere have been some work based on this data set, as given in the reference.\r\n\r\n<b>Open Science:</b>\r\nOpen Science is much more than only Open Source Code. Such opening of data set is extremely welcomed.\r\n\r\n<b>Reproducibility:</b>\r\nN/A\r\n\r\n<b>Use of Open Source Software:</b>\r\nIt didn\\'t use Open Source Software but it will definitely used by many Open Source Software.\r\n\r\n<b>Open Source Contributions:</b>\r\nN/A\r\n\r\n<b>Code Quality:</b>\r\nN/A\r\n\r\n<b>Applicability to other problems:</b>\r\nApart from clinical research of lung disease and medical image analysis area, many other fields like the teaching of lung pathology can make use of this data set.\r\n\r\n<b>Suggestions for future work:</b>\r\n[Suggest to authors future directions for improving their methods, or other domains from which they could learn technique that could help them advance in their research.]\r\n\r\n<b>Requests for additional information from authors:</b>\r\n[Did you find that information was missing from the paper? Maybe parameters for running the tests? Maybe some images were missing? Would you like to get more details on how the diagrams, or plots were generated?]\r\n\r\n<b>Additional Comments:</b>\r\n[This is a free-form field]\r\n\r\n\r\n",
        "date": "08-18-2006",
        "review_id": 301
      },
      {
        "author": {
          "author_email": "andinet.enqu@kitware.com",
          "author_firstname": "Andinet",
          "author_id": 68,
          "author_lastname": "Enquobahrie"
        },
        "content": "</b>\r\nThis paper describes initiative for development of an open database containing histological, radiological and clinical data for study of COPD and IPF.\r\n\r\n<b>Hypothesis:</b>\r\nThe hypothesis is that the availability of an open and publicly available database spurs medical research and development efforts for COPD and IPF. Furthermore, performance of image analysis algorithms can be truly compared when evaluated on common database.\r\n\r\n<b>Evidence:</b>\r\nSome research work is already done using this database as listed in the reference section. With the completion and official release of the database, more investigational work using this database is expected.\r\n\r\n<b>Open Science:</b>\r\nOpen database is the backbone of open science. This paper presenting development of an open database definitely adheres to the basic concepts of open science.\r\n\r\n<b>Reproducibility:</b>\r\nNot applicable\r\n\r\n<b>Use of Open Source Software:</b>\r\nNot applicable\r\n\r\n<b>Open Source Contributions:</b>\r\nNot applicable\r\n\r\n<b>Code Quality:</b>\r\nNot applicable\r\n\r\n<b>Applicability to other problems:</b>\r\nDevelopment of an open and publicly accessible database is something that other areas of medical image research should adopt.\r\n\r\n<b>Suggestions for future work:</b>\r\nIt would be very instructive if the authors share their experiences in this project which involves collaboration between multiple institutions and medical professionals. The lessons learned would be valuable for other initiatives which are planning to pull resources/institutions together for database development.\r\n\r\n<b>Requests for additional information from authors:</b>\r\nThe website link provided in the paper seems to have a problem ( www.ctascstudies.com) I was wondering if this was a temporary server or a general Internet traffic issue.\r\n\r\n<b>Additional Comments:</b>\r\n[This is a free-form field]\r\n\r\n",
        "date": "07-12-2006",
        "review_id": 259
      }
    ],
    "revisions": [
      {
        "article": "bafybeie5niufqrjozc4bpcodtv7t6utw2zcredil3cnng65tpuumlrqnm4",
        "dapp": null,
        "dataset": null,
        "doi": null,
        "handle": "1926/221",
        "source_code": null,
        "source_code_git_ref": null
      }
    ],
    "source_code_git_repo": null,
    "submitted_by_author": {
      "author_email": "holmes.david3@mayo.edu",
      "author_firstname": "David",
      "author_fullname": "Holmes, David",
      "author_id": 20,
      "author_institution": "Biomedical Imaging Resource, Mayo Clinic",
      "author_lastname": "Holmes"
    },
    "tags": [
      "Diffuse lung disease",
      "Image databases",
      "Chronic Obstructive Pulmonary Disease",
      "Open data"
    ],
    "title": "The Lung Tissue Research Consortium: An extensive open database containing histological, clinical, and radiological data to study chronic lung disease"
  }
}