{
  "publication": {
    "abstract": "The ﬁeld of computational anatomy has developed rigorous frameworks for analyzing anatomical shape, based on diffeomorphic transformations of a template. However, differences in algorithms used for template warping, in regularization parameters, and in the template itself, lead to different representations of the same anatomy. Variations of these parameters are considered as confounding factors. Recently, extensions of the conventional computational anatomy framework to account for such confounding variations has shown that learning the equivalence class derived from the multitude of representations can lead to improved and more stable morphological descriptors. Herein, we follow that approach, estimating the morphological appearance manifold obtained by varying parameters of the template warping procedure. Our approach parallels work in the computer vision ﬁeld, in which variations lighting, pose and other parameters leads to image appearance manifolds representing the exact same ﬁgure in different ways. The proposed framework is then used for groupwise registration and statistical analysis of biomedical images, by employing a minimum variance criterion to perform manifold-constrained optimization, i.e. to traverse each individual’s morphological appearance manifold until all individuals' representations come as close to each other as possible. Eﬀectively,\r\nthis process removes the aforementioned confounding eﬀects and potentially leads to morphological representations reﬂecting purely biological variations, instead of variations introduced by modeling assumptions and parameter settings. The nonlinearity of a morphological appearance manifold is treated via local approximations of the manifold via PCA.",
    "articles": [
      "bafkreifpgccom44lm4vn2ujwpolc7t7uffbxx3evtkpbif2xsbmouro554"
    ],
    "authors": [
      {
        "author_fullname": "Lian, Nai-Xiang",
        "author_place": 1,
        "persona_email": "naixiang.lian@uphs.upenn.edu",
        "persona_firstname": "Nai-xiang",
        "persona_id": 2090,
        "persona_lastname": "Lian"
      },
      {
        "author_fullname": "Davatzikos, Christos",
        "author_place": 2,
        "persona_id": null
      }
    ],
    "categories": [
      "Mathematics",
      "Registration"
    ],
    "comments": [],
    "date_submitted": "2008-09-12 12:17:18",
    "journals": [
      {
        "journal_id": 33,
        "journal_name": "MICCAI 2008 Workshops"
      }
    ],
    "license": "You are licensing your work to Kitware Inc. under the\nCreative Commons Attribution License Version 3.0.\n\nKitware Inc. agrees to the following:\n\nKitware is free\n * to copy, distribute, display, and perform the work\n * to make derivative works\n * to make commercial use of the work\n\nUnder the following conditions:\n\\\"by Attribution\\\" - Kitware must attribute the work in the manner specified by the author or licensor.\n\n * For any reuse or distribution, they must make clear to others the license terms of this work.\n * Any of these conditions can be waived if they get permission from the copyright holder.\n\nYour fair use and other rights are in no way affected by the above.\n\nThis is a human-readable summary of the Legal Code (the full license) available at\nhttp://creativecommons.org/licenses/by/3.0/legalcode",
    "publication_id": 637,
    "reviews": [],
    "revisions": [
      {
        "article": "bafybeiaop7erpm6gsb6lrszsentabfmal4f3eagj6xb54rxe4nshd5pumu",
        "citation_list": [
          {
            "doi": "10.1073/pnas.90.24.11944",
            "key": "ref1",
            "score": 106.66818,
            "unstructured": "Mathematical textbook of deformable neuroanatomies+” Proc. the National Acad. of Sciences+90+24+11944+11948+1993+M. Miller+G. Christensen+Y. Amit"
          }
        ],
        "dapp": null,
        "dataset": null,
        "doi": null,
        "handle": "10380/1505",
        "source_code": null,
        "source_code_git_ref": null
      }
    ],
    "source_code_git_repo": null,
    "submitted_by_author": {
      "author_email": "naixiang.lian@uphs.upenn.edu",
      "author_firstname": "Nai-xiang",
      "author_fullname": "Lian, Nai-xiang",
      "author_id": 2090,
      "author_institution": "University of Pennsylvania",
      "author_lastname": "Lian"
    },
    "tags": [
      "Morphological",
      "Registation"
    ],
    "title": "Morphological Appearance Manifolds in Computational Anatomy: Groupwise Registration and Morphological Analysis"
  }
}