[
{"id" : 1, "name" : "2005 MICCAI Open-Source Workshop", "short_description" : "ISC and NA-MIC sponsored event at MICCAI 2005", "introductory_text" : "<P>Papers, data, and reviews from the Open-Source Workshop at the 2005 MICCAI.</P>", "publications" : [8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44]},
{"id" : 3, "name" : "2005 August - December", "short_description" : "Open-source items submitted to the IJ in August of 2005", "introductory_text" : "<p>\r\nPapers, data, and reviews from the Insight Journal.\r\n</p>\r\n", "publications" : [45, 46, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67]},
{"id" : 20, "name" : "2006 January - June", "short_description" : "Open-source items submitted to the IJ between January and June 2006", "introductory_text" : "<p>\r\nPapers, data, and reviews from the Insight Journal.\r\n</p>\r\n", "publications" : [68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 83, 85, 86, 87, 88, 90, 91, 92, 93]},
{"id" : 21, "name" : "2006 MICCAI Open Science Workshop", "short_description" : "Open source and free data", "introductory_text" : "Submissions to the 2006 Workshop on open source and data for medical image computing and computer assisted intervention", "publications" : [84, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 109, 110, 111, 112, 113, 115, 116]},
{"id" : 22, "name" : "2006 July - December", "short_description" : "Open-source items submitted to the IJ between July and December 2006", "introductory_text" : "<p>\r\nPapers, data, and reviews from the Insight Journal.\r\n</p>\r\n", "publications" : [114, 117, 118, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 132, 133, 134, 135, 137, 138]},
{"id" : 30, "name" : "2007 January - June", "short_description" : "Open-source items submitted to the IJ between January and June 2007", "introductory_text" : "<p>\r\nPapers, data, and reviews from the Insight Journal.\r\n</p>\r\n", "publications" : [139, 140, 141, 142, 143, 144, 145, 146, 148, 149, 150, 151, 152, 153]},
{"id" : 32, "name" : "2007 MICCAI Open Science Workshop", "short_description" : "Open Science and Open Data for MICCAI", "introductory_text" : "This workshop features peer-reviewed submissions that describe the available data and software of MICCAI, 2007.", "publications" : [147, 154, 155, 156, 157, 158, 159, 160, 162, 163, 164, 166, 167, 169, 170, 171, 172, 173, 201]},
{"id" : 35, "name" : "2007 July - December", "short_description" : "Open-source items submitted to the IJ between July and December 2007", "introductory_text" : "<p>\r\nPapers, data, and reviews from the Insight Journal.\r\n</p>", "publications" : [161, 165, 168, 174, 175, 176, 177, 178, 179, 180, 181, 182, 197, 202, 203, 204, 207, 208, 209, 210]},
{"id" : 123, "name" : "T1-Brain", "short_description" : "Automatically exported from search criteria", "introductory_text" : "", "publications" : []},
{"id" : 155, "name" : "Verdict - 2007-2008 ", "short_description" : "Verdict Geometric Quality Special Issue (2007-2008)", "introductory_text" : "The purpose of this special issue of the I.J. is to collect proposed\r\nchanges to the Verdict library over the year for consideration at the\r\nannual meeting of the Verdict editorial board. Any new quality functions\r\nor proposed changes to existing functions must include a reference\r\nimplementation and a set of relevant tests. ", "publications" : []},
{"id" : 156, "name" : "RPI - OpenSource 2007", "short_description" : "", "introductory_text" : "Issue for receiving submissions from projects developed during the Open Source Practices course given at RPI.", "publications" : [183, 184, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 198, 199, 200, 211]},
{"id" : 157, "name" : "2008 January - June", "short_description" : "Open-source items submitted to the IJ between January and June 2008", "introductory_text" : "Papers, data, and reviews from the Insight Journal.", "publications" : [213, 216, 217, 218, 228, 230, 231, 237, 240, 244]},
{"id" : 162, "name" : "2008 - Medical Image Registration Evaluation", "short_description" : "Evaluation of registration Image-to-Image algorithms ", "introductory_text" : "", "publications" : [242, 247, 249]},
{"id" : 166, "name" : "2008 July - December", "short_description" : "Open-source items submitted to the IJ between July and December 2008", "introductory_text" : "<p>\r\nPapers, data, and reviews from the Insight Journal.\r\n</p>", "publications" : [272, 285, 296, 298, 299, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310]},
{"id" : 170, "name" : "2009 January - June", "short_description" : "Open-source items submitted to the IJ between January and June 2009", "introductory_text" : "Papers, data, and reviews from the Insight Journal.\r\n", "publications" : [311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324, 640, 641, 642, 643, 644, 645]},
{"id" : 298, "name" : "T1-Brain", "short_description" : "Automatically exported from search criteria", "introductory_text" : "", "publications" : []},
{"id" : 333, "name" : "Computational Biomechanics for Medicine (MICCAI 2008 Workshop)", "short_description" : "", "introductory_text" : "One of the greatest challenges for mechanists is to extend the success of computational mechanics to fields outside traditional engineering, in particular to biology, biomedical sciences, and medicine. The proposed workshop will provide an opportunity for computational biomechanics specialists to present and exchange opinions on the opportunities of applying their techniques to computer-integrated medicine.", "publications" : [543, 549, 550, 551, 552, 553, 554, 555, 556, 558, 561, 563, 564, 565, 567, 568, 629, 631]},
{"id" : 334, "name" : "Systems and Architectures for Computer Assisted Interventions (MICCAI 2008 Workshop)", "short_description" : "MICCAI 2008 Workshop", "introductory_text" : "The goal of this workshop is to establish a forum for discussing open source toolkits and open interfaces and how they have been applied in the development of computer assisted intervention systems. The intent is to establish a dialogue between the open source community, industry, and researchers in the field. The workshop will include presentations and panel discussions about: 1) existing open source toolkits, 2) open (research) interfaces to medical products, and 3) integrated systems for computer assisted interventions.", "publications" : [572, 615, 617, 618, 620, 622, 623, 624, 626]},
{"id" : 335, "name" : "Computational and visualization challenges in the new era of virtual colonoscopy (MICCAI 2008 Workshop)", "short_description" : "MICCAI 2008 Workshop onComputational and visualization challenges in the new era of virtual colonoscopy", "introductory_text" : "MICCAI 2008 Workshop onComputational and visualization challenges in the new era of virtual colonoscopy", "publications" : []},
{"id" : 338, "name" : "Grand Challenge Coronary Artery Tracking (MICCAI 2008 Workshop)", "short_description" : "MICCAI 2008 Workshop", "introductory_text" : "", "publications" : [574, 575, 577, 580, 583, 585, 586, 592, 593, 594, 595, 600, 619, 639]},
{"id" : 339, "name" : "MS Lesion Segmentation (MICCAI 2008 Workshop)", "short_description" : "MICCAI 2008 Workshop", "introductory_text" : "", "publications" : [604, 605, 606, 609, 610, 611, 612, 613, 616, 638]},
{"id" : 340, "name" : "Grand Challenge Liver Tumor Segmentation (2008 MICCAI Workshop)", "short_description" : "MICCAI 2008 Workshop", "introductory_text" : "", "publications" : [579, 581, 582, 584, 588, 589, 590, 591, 596, 597, 598, 598, 599, 603, 607]},
{"id" : 341, "name" : "Manifolds in Medical Imaging: Metrics, Learning and Beyond (MICCAI 2008 Workshop)", "short_description" : "In modern medical image data, manifolds arise at varying scales. At one extreme, complete 3D data sets lie along manifolds parameterized by (for example) patient breathing and heartbeat patterns, or by confounding variables such as parameters or templates used in an image warping algorithm. At the other extreme, measurements taken at each voxel in multi-parametric MR images lie along locally defined manifolds that reflect nonlinear relationships among various MRI measurements on a voxel. \r\n", "introductory_text" : "Discovering, visualizing and exploiting the structure of these manifolds supports the ability to select image-derived attributes that are informed by the structure of the underlying manifold. This offers fundamentally new tools for image registration, segmentation, visualization, reconstruction, and classification of data volumes. This collection brings together research in computer science, applied mathematics, statistics and medical imaging. \r\n\r\nOrganizers / Associate Editors:\r\nRobert Pless, Washington University in St. Louis\r\nChristos Davatzikos, University of Pennsylvania\r\n", "publications" : [632, 633, 634, 635, 636, 637]},
{"id" : 342, "name" : "Systems and Architectures for Computer Assisted Interventions", "short_description" : "", "introductory_text" : "This workshop aims to provide a forum for discussing open interfaces, interoperability, and standards for the development of computer assisted intervention systems. The workshop extends the successful dialog at the “Systems and Architectures” workshop at MICCAI 2008 in New York City.\nThe 2008 workshop focused on toolkits. The current 2009 edition emphasizes the importance of open interfaces and standards as they will be the key factors towards better interoperability, resulting in more innovative and reliable solutions. As in previous editions, this workshop will include strong participation from industry and academia. \nTopics for presentation and discussion at the workshop will include challenges with research interfaces to commercial systems (e.g., regulatory, liability), the progress and status of formal standardization efforts (e.g., DICOM, CANopen, and ISO 11073) as well as efforts in the research community (e.g., OpenIGTLink and SAW), opportunities for further integration and interoperability, and discussion of successes and unmet needs.", "publications" : [647, 648, 649, 650, 651, 652, 653, 654, 655, 656, 659, 660]},
{"id" : 343, "name" : "Carotid Lumen Segmentation and Stenosis Grading (Grand Challenge)", "short_description" : "Proceedings of the Carotid Lumen Segmentation and Stenosis Grading Challenge, which is part of the MICCAI 2009 Grand Challenge III workshop.", "introductory_text" : "", "publications" : [661, 663, 664, 665, 670, 671, 672, 675, 697, 699]},
{"id" : 348, "name" : "Cardiac MR Left Ventricle Segmentation Challenge", "short_description" : "", "introductory_text" : "This challenge is part of MICCAI 2009’s 3D Segmentation Challenge for Clinical Applications (visit website). In the challenge, participants enter their best software algorithm to find LV contours automatically, with little or no user intervention. The goal of this contest is to compare state-of-the-art LV segmentation methods by providing an evaluation system and a database of cardiac cine MR images and expert contours freely available on the internet for research purposes. The database will contain 45 cine-MRI images from a range of patients and pathology, together with the manual segmentations determined by an experienced cardiologist on the end-diastolic (ED) and end-systolic (ES) phases. The data will be provided by Sunnybrook Health Sciences Centre.", "publications" : [657, 658, 677, 678, 679, 683, 684, 686, 691]},
{"id" : 349, "name" : "Head and Neck Auto-Segmentation Challenge", "short_description" : "", "introductory_text" : "The goal of this challenge is to compare fully automatic methods for segmenting anatomical structures in head and neck CT data used in radiotherapy planning. One bony structure -mandible- and one soft tissue structure -brainstem- are offered for the competition. They both represent important organs at risk, which need to be accurately delineated in preparation for radiation treatment.", "publications" : [666, 667, 668, 669, 685, 703]},
{"id" : 350, "name" : "2009 July-December", "short_description" : "Open-source items submitted to the IJ between July and December 2009", "introductory_text" : "Papers, data, and reviews from the Insight Journal.", "publications" : [646, 662, 673, 676, 680, 681, 682, 687, 688, 692, 693, 694, 696, 698, 700, 701, 702, 704, 705, 706, 707]},
{"id" : 351, "name" : "Medical Imaging and Computing", "short_description" : "This issue regroups papers related to medical imaging and computing and does not fit in the context of the Insight Journal because they do not provide source code and/or datasets.", "introductory_text" : "", "publications" : [689, 690, 723, 771, 796, 822, 824, 825, 826, 882, 957]},
{"id" : 352, "name" : "2010 January - December Submissions", "short_description" : "Yearly submissions in support of the VTK community representing a collection of proposed and implemented algorithms, documented features, and case studies.", "introductory_text" : "", "publications" : [695, 708, 709, 710, 711, 712, 713, 715, 716, 718, 719, 720, 724, 725, 726, 764, 765, 766, 767, 772, 781]},
{"id" : 353, "name" : "2010 January-June", "short_description" : "Open-source items submitted to the Insight Journal between January and June 2010", "introductory_text" : "Papers, data, and reviews from the Insight Journal.", "publications" : [714, 717, 721, 722, 727, 728, 729]},
{"id" : 354, "name" : "Computer Assisted Intervention", "short_description" : "International Workshop on Systems and Architectures for Computer Assisted Interventions 2010 ", "introductory_text" : "The goal of this workshop is to establish a forum for discussing open interfaces, interoperability, and standards for the development of computer assisted intervention systems.<br>\nModularization of surgical assist systems is of growing importance due to the increasing complexity of the components such a system consists of. Forthcoming systems will have to depend on reliable components and frameworks, which are used as building blocks to realize the desired functionality. Standards are the key to modularization since they allow for cross-vendor interoperability of systems and modules.", "publications" : [730, 734, 735, 736, 738, 739, 744, 745, 747]},
{"id" : 355, "name" : "2010 July-December", "short_description" : "Open-source items submitted to the Insight Journal between July and December 2010", "introductory_text" : "Papers, data, and reviews from the Insight Journal.", "publications" : [737, 740, 741, 742, 743, 746, 748, 749, 750, 751, 752, 753, 755, 756, 760, 761, 762, 763, 768, 769, 770, 773, 774, 775, 776, 777, 778, 779, 780, 782, 783, 784, 785, 853]},
{"id" : 359, "name" : "Computational Imaging Biomarkers for Tumors (CIBT)", "short_description" : "", "introductory_text" : "Imaging plays an important role in the management of tumors, including lesion detection, quantification and classification, decision-making for treatment planning, and assessment of response to treatment. Mass information is visually presented in images while crucial information for clinical decision-making is expressed by types of imaging biomarkers, which reflect key aspects of the presence and progression of tumors. Validation and standardization of relevant biomarkers is required to 1) guide clinical management for individual patients and 2) coordinate large-scale clinical trials of novel therapeutic agents among multiple centers. For researchers, it is important to not only find the proper association between imaging biomarkers and clinical endpoints, but also extract and quantify imaging biomarkers in an objective, efficient and reliable way. The 1-day workshop aims to report the latest progress and development on computational methods, tools and procedures for the extraction and quantification of imaging biomarkers, with the specific application in tumor management.\n", "publications" : [754, 757, 758, 759]},
{"id" : 360, "name" : "2011 January-June", "short_description" : "Open-source items submitted to the Insight Journal between January and June 2011", "introductory_text" : "Papers, data, and reviews from the Insight Journal.", "publications" : [786, 787, 789, 791, 793, 794, 798, 799, 800, 801, 802, 803, 811, 812]},
{"id" : 361, "name" : "2011 January-December Submissions", "short_description" : "Yearly submissions in support of the VTK community representing a collection of proposed and implemented algorithms, documented features, and case studies.", "introductory_text" : "", "publications" : [788, 790, 792, 797, 820, 830, 833, 838, 839, 842]},
{"id" : 362, "name" : "Systems and Architectures for Computer Assisted Interventions 2011", "short_description" : "The goal of this workshop is to establish a forum for discussing systems and architectures for computer assisted intervention (CAI) applications. Continuing the success of the last three years, the workshop will focus on open interfaces, interoperability, and standards. In addition, this year, we will discuss practical issues, clinical applications and future directions of CAI systems and frameworks. As in the previous years, this workshop will include strong participation from industry and academia.", "introductory_text" : "Having an open interface/framework increases the pace of research and discovery by promoting collaborations within and between clinicians, biomedical engineers, and software developers. Often times, these systems follow a modular architecture to model the complexity involved in surgical assistance systems. Hence, standards are critical to allow for cross-framework interoperability of systems and modules. The workshop presentations will inform participants about appropriate architectural designs, formal standardization efforts, such as DICOM WG24 and IHE, academic efforts at interoperability, such as OpenIGTLink and SAW, as well as open interfaces to commercial products. Several examples will be presented to illustrate success stories and areas for improvements. Topics for panel discussions and presentations will include:\n• Future of open interfaces and frameworks in CAI\n• Commercial product development using open source software and systems\n• Opportunities for further integration and interoperability\n• Challenges in the standardization process", "publications" : [804, 805, 808, 809, 810, 813, 815, 816, 817, 818, 819, 821, 823, 827]},
{"id" : 363, "name" : "Computational Algorithms", "short_description" : "Any algorithms with source code and testing data could be submitted to this issue. This continuous issue promotes new algorithms not necessarily related to specific toolkits such as ITK and VTK.\n\nIf your submission proposes and extension or addition to ITK or VTK, please submit to the corresponding issues instead. ", "introductory_text" : "The Computational Algorithms Journal is an Open Access on-line publication covering the domain of computational algorithms. This journal is intended to be a place to share algorithm implementations with a very low barrier of entry. The goal of this journal is to fill in some of the gaps left by research which is published in a non-reproducible way. Potential things to submit to this journal are:\n - Algorithm implementations\n - Accessible descriptions and explanations of algorithms", "publications" : [828, 829, 951, 976]},
{"id" : 364, "name" : "2011 July-December", "short_description" : "Open-source items submitted to the Insight Journal between July and December 2011\n", "introductory_text" : "Papers, data, and reviews from the Insight Journal.", "publications" : [831, 832, 834, 835, 836, 837, 840, 841, 843, 844, 845, 846, 847]},
{"id" : 365, "name" : "2012 January-December", "short_description" : "Open-source items submitted to the Insight Journal between January and December 2012", "introductory_text" : "Papers, data, and reviews from the Insight Journal.", "publications" : [848, 849, 850, 851, 852, 855, 857, 859, 860, 861, 869, 870, 871, 872, 874, 875, 876, 877, 878, 879, 881, 883, 884]},
{"id" : 366, "name" : "2012 January-December Submissions", "short_description" : "Yearly submissions in support of the VTK community representing a collection of proposed and implemented algorithms, documented features, and case studies.", "introductory_text" : "", "publications" : [854, 856, 880]},
{"id" : 367, "name" : "Systems and Architectures for Computer Assisted Interventions 2012", "short_description" : "The goal of this workshop is to establish a forum for discussing systems and architectures for computer assisted intervention (CAI) applications. Continuing the success of the last three years, the workshop will focus on open interfaces, interoperability, and standards. In addition, this year, we will discuss practical issues, clinical applications and future directions of CAI systems and frameworks. As in the previous years, this workshop will include strong participation from industry and academia.", "introductory_text" : "Open interfaces/frameworks increase the pace of research and discovery by promoting collaborations within and between clinicians, biomedical engineers, and software developers. These systems usually modular architectures to model the complexity involved in surgical assistance systems. Hence, standards are critical to allow for cross-framework interoperability of systems, and modules.", "publications" : [858, 862, 863, 864, 866, 868, 873]},
{"id" : 368, "name" : "2013 January-December", "short_description" : "Open-source items submitted to the Insight Journal between January and December 2013\nPapers, data, and reviews from the Insight Journal.", "introductory_text" : "", "publications" : [885, 886, 887, 890, 896, 899, 912]},
{"id" : 371, "name" : "Systems and Architectures for Computer Assisted Interventions 2013", "short_description" : "", "introductory_text" : "SACAI 2013 is a satellite workshop of MICCAI 2013. The goal of this workshop is to provide a forum for sharing developments in systems and architectures for computer assisted intervention (CAI) applications. Continuing the success of the last five years, the workshop will focus on open interfaces, interoperability, and standards. This sixth edition will include a broader forum for poster/interactive demonstrations, and expert panel insights into practical issues, clinical applications and future directions of CAI systems and frameworks. As in its previous iterations, the workshop will continue the tradition of strong participation from both industry and academia.", "publications" : [889, 892, 893, 894, 897, 898]},
{"id" : 372, "name" : "2013 January-December Submissions", "short_description" : "Yearly submissions in support of the VTK community representing a collection of proposed and implemented algorithms, documented features, and case studies.", "introductory_text" : "", "publications" : [891]},
{"id" : 375, "name" : "The MICCAI Grand Challenge on MR Brain Image Segmentation (MRBrainS13) ", "short_description" : "", "introductory_text" : "The MICCAI Grand Challenge on MR Brain Image Segmentation (MRBrainS13) workshop was held on September 26, 2013 in Nagoya, Japan. It was organized by dr. Adriënne M. Mendrik of the Image Sciences Institute (UMC Utrecht, the Netherlands).\n \nThe aim of the MRBrainS challenge was to compare (semi-)automatic algorithms for segmentation of grey matter, white matter and cerebrospinal fluid on multi-sequence (T1-weighted, T1-weighted inversion recovery and FLAIR) 3 Tesla MRI scans of the brain. The challenge consisted of an off-site and on-site part. For the off-site part, teams could register on the MRBrainS website, download 5 training datasets (MRI scans + manual segmentations) and 12 test datasets (only MRI scans), train their algorithm, apply it to the test datasets and submit their results. In total 86 teams registered on the website, of which 58 teams signed the confidentiality agreement and downloaded the data. Twelve teams submitted the obtained results and a workshop paper for the MICCAI MRBrainS13 workshop with a description of their algorithm. The workshop papers are available here.", "publications" : [900, 901, 902, 903, 904, 905, 906, 907, 908, 909, 910, 911]},
{"id" : 376, "name" : "OSVIS 2014", "short_description" : "Workshop on Open Source in Visualization (OSVIS) as part of EuroVis 2014.", "introductory_text" : "The goal of this workshop is to present, discuss and assess the development and use of Open-Source Software (OSS) for scientific visualization. This one-day workshop will bring together developers and users of well-known OSS for visualization and will focus on user\\\\\\'s experience in specific scientific and industrial contexts. Attendees are encouraged to submit a short abstract paper. ", "publications" : [918, 919, 920]},
{"id" : 377, "name" : "2014 January-December", "short_description" : "Insight Journal Annual Issue for 2014", "introductory_text" : "Welcoming articles related to ITK ", "publications" : [913, 914, 915, 917, 923, 924, 950, 953]},
{"id" : 378, "name" : "Ongoing Submissions", "short_description" : "Submissions in support of the VTK community representing a collection of proposed and implemented algorithms, documented features, and case studies.", "introductory_text" : "", "publications" : [916, 949, 975]},
{"id" : 379, "name" : "2014 IEEE Summer School on Biomedical Imaging", "short_description" : "This issue is welcomes all submission from Open Science training activities that took place at the IEEE Summer School on Biomedical Imaging, in Saint Jacut de la Mer, France, June 2014", "introductory_text" : "Celebrating Open Science by learning about principles and practices. This is a collection of reproducible papers that showcase how to use many of the Open Science tools.", "publications" : []},
{"id" : 380, "name" : "2014 SciPy Reproducible Research - Walking the Walk", "short_description" : "Training sessions at SciPy 2014 on the use of tools supporting Reproducible Research and Open Science.", "introductory_text" : "This articles will be submitted by participants in the training sessions.", "publications" : [921, 922]},
{"id" : 383, "name" : "Image-Guided Adaptive Radiation Therapy (IGART)", "short_description" : "The workshop aims at presenting leading edge applications of medical image processing in the field of radiotherapy. The workshop provides an invaluable opportunity to present and discuss recent and preliminary research in this exciting field, in addition to providing a good forum to get constructive feedback from fellow researchers on more developed pieces of work.", "introductory_text" : "", "publications" : [925, 937, 938, 939, 940, 941, 942, 943, 944, 945, 946, 947, 948, 958]},
{"id" : 387, "name" : "Challenge on Endocardial Three-dimensional Ultrasound Segmentation", "short_description" : "The goal of this contest is to compare left ventricle segmentation methods for both End Diastolic and End Systolic phase instances. This will be done using a common database of 3D cardiac ultrasound images acquired from 45 patients and the associated manual references based on the analysis of three different experts.", "introductory_text" : "Real-time 3D echocardiography has already been shown to be an accurate tool for left ventricular (LV) volume assessment. However, LV border identification remains a challenging task, mainly because of the low contrast of the images combined with drop-out artifacts and speckle. Image quality may differ significantly and image characteristics depend on ultrasound machine and operator settings.\n<br><br>\nThere thus exist strong efforts in developing fully or semi-automatic algorithms able to capture the LV morphology. Many (semi-)automatic algorithms have been proposed for segmenting the LV border, but a systematic and fair comparison between such methods has so far been impossible due to lack of publicly available common datasets with expert-defined segmentations. \n<br><br>\nThe aim of this challenge is thus to gather researchers around the field of LV segmentation in 3D cardiac ultrasound by providing such common dataset enabling direct algorithm comparison. Such platform will allow consistent evaluation of the proposed segmentation solutions while highlighting the best performing ones, thus contributing to a faster clinical translation of groundbreaking technical advances.\n<br><br>", "publications" : [926, 927, 928, 929, 930, 931, 932, 933, 934, 935, 936]},
{"id" : 388, "name" : "NEATBrainS15", "short_description" : "ISBI Workshop on Neonatal and Adult MR Brain Image Segmentation", "introductory_text" : "<p>The main academic objective of the NEATBrainS15 workshop is to compare and discuss the performance of algorithms in segmenting gray matter, white matter and cerebrospinal fluid in adult and neonatal brain MRI scans, and to discuss the similarities and differences between these two areas of research.</p>\n\n<p>For this issue we invite submission of papers that\n<ul>\n <li> Present novel segmentation methods evaluated on neonatal (preterm and term born), pediatric or adult MR brain scans;</li>\n <li>Describe the results and discuss the major issues encountered when applying a novel or already published method to both the neonatal (http://neobrains12.isi.uu.nl/) and adult (http://mrbrains13.isi.uu.nl/) MR scans;</li>\n</ul>\n</p>\n<p>\nMore information can be found on http://neatbrains15.isi.uu.nl/\n</p>\n\n<p>Adriënne M. Mendrik, PhD</p>\n<p>Ivana Išgum, PhD</p>\n<p>Prof. Max A. Viergever</p>", "publications" : []},
{"id" : 389, "name" : "2015 January-December", "short_description" : "Insight Journal Annual Issue for 2015", "introductory_text" : "Welcoming articles related to ITK ", "publications" : [952, 954, 955, 956, 973]},
{"id" : 400, "name" : "Spectral Analysis in Medical Imaging", "short_description" : "This workshop will provide an invaluable opportunity for researchers to present recent work on spectral analysis in medical imaging. Interactions among fellow researchers will foster a deeper understanding of the underlying concepts and will provide insights on the benefits of incorporating spectral analysis into medical imaging applications. ", "introductory_text" : "We gladly announce the workshop for Spectral Analysis in Medical Imaging (SAMI), which is held in conjunction with the conference on Medical Image Computing and Computer Assisted Interventions (MICCAI) in Munich, Germany. This workshop aims at presenting leading methods and applications for spectral analysis in medical imaging. At the core of these techniques is the spectral decomposition, also known as eigenvalue decomposition, which finds a wide range of applications in image processing and analysis. The sequence of eigenvalues (the spectrum) and eigenfunctions have properties often exploited for image segmentation, mesh matching, classification or reduction of complex data. In this workshop, we will cover theoretical contributions to spectral analysis, as well as exciting applications of spectral methods in medical image processing and analysis. ", "publications" : [959, 960, 961, 962]},
{"id" : 408, "name" : "Head and Neck Auto Segmentation Challenge", "short_description" : "The third Head And Neck Auto-Segmentation Challenge, held in conjunction with the 2015 Medical Image Computing and Computer Assisted Interventions (MICCAI) conference in Munich, Germany.", "introductory_text" : "The primary objective of this MICCAI 2015 challenge is to establish an unbiased benchmark of automatic segmentation performance. It is hoped that this challenge will give valuable feedback both to researchers and the user community about algorithm performance in real world applications. In addition the challenge will provide medical imaging researchers a venue where they can discuss and form collaborations on medical image segmentation for radiotherapy planning.<br>\n<br>\nThe organizing committee is:<br>\n- Karl Fritscher, UMIT<br>\n- Patrik Raudaschl, UMIT<br>\n- Greg Sharp, MGH<br>\n- Paolo Zaffino, UMG<br>", "publications" : [964, 965, 966, 967, 968, 970, 971]},
{"id" : 409, "name" : "2016 January-December", "short_description" : "Insight Journal Annual Issue for 2016", "introductory_text" : "Welcoming articles related to ITK", "publications" : [963, 969, 972, 974, 977, 978, 979, 980, 981, 986]},
{"id" : 412, "name" : "Workshop on Systems and Architectures for Computer Assisted Interventions (SACAI)", "short_description" : "The goal of this workshop is to provide a forum for sharing developments in systems and architectures for\ncomputer assisted intervention (CAI) applications. This workshop was offered for six consecutive years at\nMICCAI 2008-2013 and focused on open interfaces, interoperability, and standards.\n\nWe propose to reinstitute this successful workshop series for MICCAI 2016, with renewed focus on these topics and highlighting recent developments in open source, shared research platforms.", "introductory_text" : "", "publications" : []},
{"id" : 413, "name" : "2017 January-December", "short_description" : "Insight Journal Annual Issue for 2017", "introductory_text" : "Welcoming articles related to ITK", "publications" : [982, 983, 984, 985, 987]}
]
