{
  "publication": {
    "abstract": "Mathematical modeling and computer simulation have proved tremendously\r\nsuccessful in engineering. One of the greatest challenges for mechanists is\r\nto extend the success of computational mechanics to fields outside\r\ntraditional engineering, in particular to biology, biomedical sciences, and\r\nmedicine. The proposed workshop will provide an opportunity for\r\ncomputational biomechanics specialists to present and exchange opinions on\r\nthe opportunities of applying their techniques to computer-integrated\r\nmedicine. For example, continuum mechanics models provide a rational basis\r\nfor analyzing biomedical images by constraining the solution to biologically\r\nreasonable motions and processes. Biomechanical modeling can also provide\r\nclinically important information about the physical status of the underlying\r\nbiology, integrating information across molecular, tissue, organ, and\r\norganism scales. The main goal of this workshop is to showcase the clinical\r\nand scientific utility of computational biomechanics in computer-integrated\r\nmedicine.\r\n\r\nThe authors of the best papers presented at the Computational Biomechanics\r\nfor Medicine workshop will be requested to submit an extended version of\r\ntheir papers to the special section of the Medical Image Analysis journal.",
    "articles": [
      "bafkreidfjm3tfbl4qcd4waaufvmcwulxtyxknqzyzwpc7n5r3bk7xrgx3q"
    ],
    "authors": [
      {
        "author_fullname": "Miller, Karol",
        "author_place": 1,
        "persona_email": "kmiller@mech.uwa.edu.au",
        "persona_firstname": "Karol",
        "persona_id": 791,
        "persona_lastname": "Miller"
      },
      {
        "author_fullname": "Nielsen, Poul",
        "author_place": 2,
        "persona_email": "p.nielsen@auckland.ac.nz",
        "persona_firstname": "Poul",
        "persona_id": 857,
        "persona_lastname": "Nielsen"
      }
    ],
    "categories": [],
    "comments": [],
    "date_submitted": "2008-03-12T16:19:11Z",
    "journals": [
      {
        "journal_id": 33,
        "journal_name": "MICCAI 2008 Workshops"
      }
    ],
    "license": "You are licensing your work to Kitware Inc. under the\nCreative Commons Attribution License Version 3.0.\n\nKitware Inc. agrees to the following:\n\nKitware is free\n * to copy, distribute, display, and perform the work\n * to make derivative works\n * to make commercial use of the work\n\nUnder the following conditions:\n\\\"by Attribution\\\" - Kitware must attribute the work in the manner specified by the author or licensor.\n\n * For any reuse or distribution, they must make clear to others the license terms of this work.\n * Any of these conditions can be waived if they get permission from the copyright holder.\n\nYour fair use and other rights are in no way affected by the above.\n\nThis is a human-readable summary of the Legal Code (the full license) available at\nhttp://creativecommons.org/licenses/by/3.0/legalcode",
    "publication_id": 543,
    "reviews": [],
    "revisions": [
      {
        "article": "bafkreidfjm3tfbl4qcd4waaufvmcwulxtyxknqzyzwpc7n5r3bk7xrgx3q",
        "dapp": null,
        "dataset": null,
        "doi": null,
        "handle": "10380/1334",
        "source_code": null,
        "source_code_git_ref": null
      }
    ],
    "source_code_git_repo": null,
    "submitted_by_author": {
      "author_email": "stephen.aylward@kitware.com",
      "author_firstname": "Stephen",
      "author_fullname": "Aylward, Stephen",
      "author_id": 1,
      "author_institution": "Kitware, Inc.",
      "author_lastname": "Aylward"
    },
    "tags": null,
    "title": "Computational Biomechanics for Medicine III: a MICCAI 2008 satellite"
  }
}