{
  "publication": {
    "abstract": "Liver tumors segmentation is an important prerequisite for planning of surgical interventions.\r\nFor clinical applicability, the segmentation approach must be able to cope with\r\nthe high variation in shape and gray-value appearance of the liver. We present a fully\r\nautomatic 3D segmentation method for the liver tumors from contrast-enhanced CT data.\r\nThe method consists of two main stages.\r\nFirst an initial histogram and statistical distribution functions are created, and from\r\nthem a new image is created where, in each voxel, a weighted function is attached in accordance\r\nwith the probability of the voxel grey level. Next, we use the active contour method\r\non the new image, where the active contour evolution is based upon the minimization of\r\nvariances between the liver tumor and its closest neighborhood.",
    "articles": [
      "bafkreigd3v4bxsrx5jcze7eqbfgps5sx3pl27dxatnh6v47ecphsfa6vj4"
    ],
    "authors": [
      {
        "author_fullname": "Ben-Dan, Itay",
        "author_place": 1,
        "persona_email": "itaybd@gmail.com",
        "persona_firstname": "Itay",
        "persona_id": 916,
        "persona_lastname": "Ben-dan"
      },
      {
        "author_fullname": "Shenhav, Elior",
        "author_place": 2,
        "persona_id": null
      }
    ],
    "categories": [],
    "comments": [],
    "date_submitted": "2008-07-14T16:33:05Z",
    "journals": [
      {
        "journal_id": 31,
        "journal_name": "The MIDAS Journal"
      }
    ],
    "license": "You are licensing your work to Kitware Inc. under the\nCreative Commons Attribution License Version 3.0.\n\nKitware Inc. agrees to the following:\n\nKitware is free\n * to copy, distribute, display, and perform the work\n * to make derivative works\n * to make commercial use of the work\n\nUnder the following conditions:\n\\\"by Attribution\\\" - Kitware must attribute the work in the manner specified by the author or licensor.\n\n * For any reuse or distribution, they must make clear to others the license terms of this work.\n * Any of these conditions can be waived if they get permission from the copyright holder.\n\nYour fair use and other rights are in no way affected by the above.\n\nThis is a human-readable summary of the Legal Code (the full license) available at\nhttp://creativecommons.org/licenses/by/3.0/legalcode",
    "publication_id": 607,
    "reviews": [
      {
        "author": {
          "author_email": "dengxiang05@gmail.com",
          "author_firstname": "Xiang",
          "author_id": 872,
          "author_lastname": "Deng"
        },
        "content": "<p>This paper presents an automatic live tumor segmentation technique. <br />In this method,&nbsp;probalistic intensity models of the tumor and surrounding liver tissue are first estimated using a non-parametric technique. Second, the tumors are segmented using a 3D active contour model that can minimize the intensity variance inside and outside the object of interest.</p><p><br />Detailed comments:</p><p>1) The active surface model used in the segmentation seems to require some kind of initialization, e.g., manually defined&nbsp;initial contour. If that&#39;s the case, the method should be semi-automatic. Could the authors clarify this point?</p><p>2) The meaning of symbols in equation (1) in section 2.1 are not clearly defined, i.e., does &quot;measure of the region of the tumor&quot; mean the volume of the tumor? what does |Vol_{in}| stand for?</p><p>3) In &quot;Experimental results&quot; section, the statement &quot;the small relative difference between the intensity of the tumor and the healthy part this cause that any energy based segmentation of the normalized intensity values will not work&quot; is too strong.</p><p>4) In &quot;Experimental results&quot; section, I don&#39;t see a clear advatange of the proposed distribution estimation method from Figures 2 and 3. Could the authors show some quantitative comparison?</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
        "date": "07-25-2008",
        "review_id": 1517
      }
    ],
    "revisions": [
      {
        "article": "bafybeifml2r5mfvscakd6micc7backupzpua72mxmrlbwxouutnvf674be",
        "citation_list": [
          {
            "doi": "10.1007/978-3-540-73273-0_4",
            "key": "ref1",
            "score": 113.63135,
            "unstructured": "Gareth Funka-Lea, and James Williams Liver Segmentation Using Sparse 3D Prior Models with Optimal Data Support Inf Process Med Imaging+2007+20+38+49+Florin Charles"
          },
          {
            "key": "ref2",
            "score": 54.08919,
            "unstructured": "Yo-Sung Ho Segmentation of the Liver Using the Deformable Contour Method on+LJH [+Lim Seong-Jae+Yong-Yeon Jeong"
          },
          {
            "key": "ref3",
            "score": 36.138878,
            "unstructured": "Segmentation of the Liver using a 3D Statistical Shape ModelZIB-Report 04-09"
          },
          {
            "key": "ref4",
            "score": 36.552002,
            "unstructured": "Hepatocellular Carcinoma (Liver Cancer)www+FS [+Fong Tse-Ling+Leslie J. Schoenfield"
          },
          {
            "doi": "10.1117/12.872457",
            "key": "ref5",
            "score": 66.46806,
            "unstructured": "Tony Chan,Luminete Vese A multiphase level set framework for image segmentation using the Mumford and Shah model+Int. Journal of Comp. Vis.+50+3+271293+2002"
          }
        ],
        "dapp": null,
        "dataset": null,
        "doi": null,
        "handle": "10380/1443",
        "source_code": null,
        "source_code_git_ref": null
      }
    ],
    "source_code_git_repo": null,
    "submitted_by_author": {
      "author_email": "itaybd@gmail.com",
      "author_firstname": "Itay",
      "author_fullname": "Ben-dan, Itay",
      "author_id": 916,
      "author_institution": "Technion",
      "author_lastname": "Ben-dan"
    },
    "tags": [
      "variance",
      "probability image",
      "density",
      "Chan Vese"
    ],
    "title": "Liver Tumor segmentation in CT images using probabilistic"
  }
}