{
  "publication": {
    "abstract": "For over two decades, the National Library of Medicine (NLM)\r\nhas provided support for the collection of biomedical image data for use\r\nthroughout the biomedical image, visualization and analysis community.\r\nData collected during the Visible Human Project has been utilized to\r\nadvance development of medical image research, education, and other\r\nventures. One goal of our research has been to further diversify such\r\nimage data and make it openly available to the biomedical imaging community.\r\nThe approach is to provide open access to a diverse collection\r\nof biomedical image data that can be used for the development and validation\r\nof new image processing and analysis techniques. With support\r\nfrom NLM, over 100 datasets were incorporated into the NLM-Mayo\r\ndata collection. There is variation in species, anatomy, pathology, scale,\r\nand modality. In addition to providing linical qualitymedical image\r\ndata, the collection also includes newly acquired datasets of several animals,\r\nincluding a whole mouse with both T and R data volumes.\r\nThis unique collection of data was categorized and organized into an intuitive\r\nweb-based browser which allows a user to rapidly access descriptive\r\ninformation as well as the actual data volumes. The data collection\r\nwill be made available by the NLM for distribution, vis-a-vis its Visible\r\nHuman Project (VHP). Because the landscape of biomedical imaging\r\ncontinues to change with new, advanced image acquisition systems and\r\ntechniques, continuously updating the VHP data collection seems prudent.\r\nAdditional new and varied image data will be incorporated into our\r\ncollection and disseminated to researchers in the medical image analysis\r\ncommunity.",
    "articles": [
      "bafybeigsrgwlhxcnl5fn5nlmtrlu3q5ldol6usm4hc3ssm3ob23v4kjyx4"
    ],
    "authors": [
      {
        "author_fullname": "Holmes, David R III",
        "author_place": 1,
        "persona_email": "holmes.david3@mayo.edu",
        "persona_firstname": "David",
        "persona_id": 20,
        "persona_lastname": "Holmes"
      },
      {
        "author_fullname": "Workman, Ellis L",
        "author_place": 2,
        "persona_id": null
      },
      {
        "author_fullname": "Robb, Richard A",
        "author_place": 3,
        "persona_id": null
      }
    ],
    "categories": [],
    "comments": [],
    "date_submitted": "2005-08-01T17:13:05Z",
    "journals": [
      {
        "journal_id": 3,
        "journal_name": "The Insight Journal"
      }
    ],
    "license": "You are licensing your work to Kitware Inc. under the\nCreative Commons Attribution License Version 3.0.\n\nKitware Inc. agrees to the following:\n\nKitware is free\n * to copy, distribute, display, and perform the work\n * to make derivative works\n * to make commercial use of the work\n\nUnder the following conditions:\n\\\"by Attribution\\\" - Kitware must attribute the work in the manner specified by the author or licensor.\n\n * For any reuse or distribution, they must make clear to others the license terms of this work.\n * Any of these conditions can be waived if they get permission from the copyright holder.\n\nYour fair use and other rights are in no way affected by the above.\n\nThis is a human-readable summary of the Legal Code (the full license) available at\nhttp://creativecommons.org/licenses/by/3.0/legalcode",
    "publication_id": 18,
    "reviews": [
      {
        "author": {
          "author_email": "cates@sci.utah.edu",
          "author_firstname": "Josh",
          "author_id": 133,
          "author_lastname": "Cates"
        },
        "content": "<b>Summary:</b> This paper describes a new, open-access collection of medical \r\nimage data assembled by the Mayo Clinic with support from the National Library \r\nof Medicine (NLM). The collection includes over 100 datasets of\r\nvarying modalities, anatomy and subject species and is intended to support\r\nmedical imaging research. The focus of the collection is on diversity, \r\nmulti-modalilty, and new imaging modalities. A web-based interface to the \r\ncollection has been developed and the data will be made available through\r\nthe NLM.\r\n \r\n<b>Hypothesis:</b>\r\nThe work was motivated by the idea that open access data collections facilitate \r\nmedical imaging research, and it follows in the footsteps of the original Visible \r\nHuman Project initiative. The authors anticipate that this data will be useful\r\nin the development and validation of new imaging algorithms.\r\n\r\n<b>Evidence:</b>\r\nThe authors clearly state their motivations behind the work and cite some evidence that \r\nsimilar efforts have been effective, but this paper is not intended to be a rigorous \r\ninvestigation into the usefulness of open access data collections.\r\n\r\n<b>Open Science:</b> This is a true open science initiative. The data is to be\r\nreleased to the research community through a web interface. The article indicates \r\nthat this is an ongoing effort.\r\n\r\nSome issues: None of the data seems to be currently available. When will it be\r\nreleased? It is also not clear from the article what restrictions will be placed \r\non the use of the data. Will they be similar to those governing use of Visible \r\nHuman Data?\r\n\r\n<b>Reproducibility:</b>\r\nNot applicable.\r\n\r\n<b>Use of Open Source Software:</b>\r\nNot applicable.\r\n\r\n<b>Open Source Contributions:</b>\r\n(Will the web interface be open source?)\r\n\r\n<b>Code Quality:</b>\r\nNot applicable.\r\n\r\n<b>Applicability to other problems:</b>\r\nThe data will no doubt be of interest to researchers in domains outside\r\nmedical imaging (e.g. computer graphics, anatomists, education, ...).\r\n\r\n<b>Suggestions for future work:</b>\r\n\r\n\r\n<b>Requests for additional information from authors:</b> Will any of the\r\nvolumetric datasets include the raw (un-reconstructed) scanner data? This data\r\nwould obviously be of great interest to the reconstruction community. It would\r\nalso be helpful to include information about the reconstruction algorithms used\r\nto produce the volumes and the scanner geometries.\r\n\r\n<b>Additional Comments:</b> I would encourage the authors to include additional\r\ninformation as it becomes available, i.e. where and how to access, restrictions\r\non use, etc.\r\n\r\nSome minor points:\r\nThe article reads fairly well, but another editing pass might be useful. There are \r\nfor example, one or two typos to address (e.g. p. 3 comprhensive->comprehensive).\r\nAlso, I believe the acronym 'BIR' is never fully spelled out.\r\n\r\nI look forward to getting my hands on some of this data!\r\n\r\n",
        "date": "09-08-2005",
        "review_id": 50
      },
      {
        "author": {
          "author_email": "tkapur@bwh.harvard.edu",
          "author_firstname": "Tina",
          "author_id": 96,
          "author_lastname": "Kapur"
        },
        "content": "<b>Summary:</b>\r\n\r\nAs previous reviewers have stated, this paper describes a collection of 100 diverse data sets that has been compiled already and will be made available (shortly?) for open access by the NLM via the Visible Human Project. The data sets are across species (mouse, Canine, Dophin, Mouse, Rabbit), anatomy(Abdomen, Brain, Cells, Chest, Ear, Hand, Heart, Knee, Larynx, Liver, Prostate), modality (MR, CT, Confocal Microscopy, PET, SPECT, Ultrasound, microCT, microMR), and pathology. The highest level categories of the collection are human and animal, each further subdivided into anatomical regions, then into modality, and then pathology. Many of the data sets were retrieved from archives at Mayo and collaborators, while an interesting one acquired specifcally for the collection is a full mouse data set acquired as overlapping sections with microCT and microMR at voxel resolutions of 0.02mm^3 and 0.125mm^3, and realigned into a single volume.\r\n\r\nEach data set is available in three file formats: Analyze 7.5, Analyze Volumefile, and MetaIO. References for descriptions of these formats are provided.\r\n\r\nHuman data has been anonymized and complies with HIPPA standards. \r\n\r\nThe data has been organized into a website with a custom browser.\r\n\r\n<b>Hypothesis:</b>\r\nA hypotheis is that openly accessible data is useful for advancing science.\r\n\r\n<b>Evidence:</b>\r\nThis is a widely accepted truth in many fields, including biomedical research. The authors have also provided references on how exisiting collections of data such as the Visible Human and the Vanderbilt Registration data have been successfully used by many researchers in different applications.\r\n\r\n<b>Open Science:</b>\r\nData sets like this are key enablers of open science. \r\n\r\n<b>Reproducibility:</b>\r\n\r\n<b>Use of Open Source Software:</b>\r\nIt is not clear if the web browser and file format conversion tools are open source.\r\n\r\n<b>Additional Comments:</b>\r\n\r\n- This is very useful work and should enable research in the area as the authors have noted.\r\n\r\n- For those interested in additional image collections, the authors have provided an interesting list (from open to restricted to closed): the visible Koren and Chinese human projects, MNI Brainweb for brain anatomy, UCDavis Brain atlas project for human and animal brains, BIRN brain data collection.\r\n\r\n- Following a link in the bibliography explains BIR (http://www.mayo.edu/bir)- it stands for Biomedical Imaging Resource, the group computational group at Mayo where this work was conducted. \r\n\r\n-The categories noted in the paper include 5 species, 11 anatomical regions, and 8 modalities. One can see that even if one data set was available for each bin of this table, 5x11x8x2 (the last two is one normal and one pathological) or 880 data sets would be needed. Clearly, there is room to add to this collection. Question for authors: are there guidelines that would allow other researchers to supply data sets that could be added to the collection to help populate the table? Are there NLM plans to solicit entries for this collection the way that algorithm implementations were successfully added to ITK?\r\n\r\n- Having a web based browser for the data was a great choice. As useful as downloaded data viewing applications can be, it seems that browsing data in a collection is something that is very well suited for a web based browser. I am waiting to try it out to see if the data sizes will make network lag an issue while browsing.\r\n\r\n-File formats: Is there a reason that images in this collection are not provided in the industry standard DICOM format? Most of the data in this collection seem to be the direct output of imaging scanners, does keeping it in DICOM (assuming it was once in that format) rather than converting it to the Analyze/MetaIO formats lose anything?\r\n",
        "date": "09-17-2005",
        "review_id": 96
      },
      {
        "author": {
          "author_email": "hans-johnson@uiowa.edu",
          "author_firstname": "Hans",
          "author_id": 21,
          "author_lastname": "Johnson"
        },
        "content": "\r\n<b>Summary:</b>\r\nThis document describes a repository of publicly available images and the tools developed to allow access to the data.\r\n \r\n<b>Hypothesis:</b>\r\nAccess to diverse data sets is critical to testing software. These data sets are useful for verifying that an algorithm is robust across data sets that differ from the data \r\nused during the initial development of the agorithm.\r\n\r\n<b>Evidence:</b>\r\nExamples of the web based interface to the downloading the data, as well as a description of the organization of the data is described.\r\n\r\n<b>Open Science:</b>\r\nThe data in this document are public. The tools described for dissemination of the data do not seem to be publicly available (although that is not the focus of the \r\npaper).\r\n\r\n\r\n<b>Reproducibility:</b>\r\nNA\r\n\r\n<b>Use of Open Source Software:</b>\r\nUnclear, but the data itself is collected from multiple public repositories.\r\n\r\n<b>Open Source Contributions:</b>\r\nNo code, but the data is very important to have available.\r\n\r\n<b>Code Quality:</b>\r\nNA\r\n\r\n<b>Suggestions for future work:</b>\r\nContinue to add interesting data sets to this collection.\r\n",
        "date": "09-16-2005",
        "review_id": 93
      }
    ],
    "revisions": [
      {
        "article": "bafybeigsrgwlhxcnl5fn5nlmtrlu3q5ldol6usm4hc3ssm3ob23v4kjyx4",
        "dapp": null,
        "dataset": null,
        "doi": null,
        "handle": "1926/22",
        "source_code": null,
        "source_code_git_ref": null
      }
    ],
    "source_code_git_repo": null,
    "submitted_by_author": {
      "author_email": "holmes.david3@mayo.edu",
      "author_firstname": "David",
      "author_fullname": "Holmes, David",
      "author_id": 20,
      "author_institution": "Biomedical Imaging Resource, Mayo Clinic",
      "author_lastname": "Holmes"
    },
    "tags": [
      "Medical Image Archive",
      "Open Data"
    ],
    "title": "The NLM-Mayo Image Collection: Common Access to Uncommon Data"
  }
}